#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]

/* automatically generated by rust-bindgen */

pub const LIBXML_DOTTED_VERSION: &'static [u8; 6usize] = b"2.9.4\0";
pub const LIBXML_VERSION: u32 = 20904;
pub const LIBXML_VERSION_STRING: &'static [u8; 6usize] = b"20904\0";
pub const LIBXML_VERSION_EXTRA: &'static [u8; 1usize] = b"\0";
pub const LIBXML_MODULE_EXTENSION: &'static [u8; 4usize] = b".so\0";
pub const __GNUC_VA_LIST: u32 = 1;
pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __STDC_NO_THREADS__: u32 = 1;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;

pub const XML_SCHEMAS_ELEM_TOPLEVEL: u32 = 32;
pub const XML_SCHEMAS_ELEM_REF: u32 = 64;
pub const XML_SCHEMAS_ELEM_NSDEFAULT: u32 = 128;
pub const XML_SCHEMAS_ELEM_INTERNAL_RESOLVED: u32 = 256;
pub const XML_SCHEMAS_ELEM_CIRCULAR: u32 = 512;
pub const XML_SCHEMAS_ELEM_BLOCK_ABSENT: u32 = 1024;
pub const XML_SCHEMAS_ELEM_BLOCK_EXTENSION: u32 = 2048;
pub const XML_SCHEMAS_ELEM_BLOCK_RESTRICTION: u32 = 4096;
pub const XML_SCHEMAS_ELEM_BLOCK_SUBSTITUTION: u32 = 8192;
pub const XML_SCHEMAS_ELEM_FINAL_ABSENT: u32 = 16384;
pub const XML_SCHEMAS_ELEM_FINAL_EXTENSION: u32 = 32768;
pub const XML_SCHEMAS_ELEM_FINAL_RESTRICTION: u32 = 65536;
pub const XML_SCHEMAS_ELEM_SUBST_GROUP_HEAD: u32 = 131072;
pub const XML_SCHEMAS_ELEM_INTERNAL_CHECKED: u32 = 262144;
pub const XML_SCHEMAS_FACET_UNKNOWN: u32 = 0;
pub const XML_SCHEMAS_FACET_PRESERVE: u32 = 1;
pub const XML_SCHEMAS_FACET_REPLACE: u32 = 2;
pub const XML_SCHEMAS_FACET_COLLAPSE: u32 = 3;
pub const XML_SCHEMAS_QUALIF_ELEM: u32 = 1;
pub const XML_SCHEMAS_QUALIF_ATTR: u32 = 2;
pub const XML_SCHEMAS_FINAL_DEFAULT_EXTENSION: u32 = 4;
pub const XML_SCHEMAS_FINAL_DEFAULT_RESTRICTION: u32 = 8;
pub const XML_SCHEMAS_FINAL_DEFAULT_LIST: u32 = 16;
pub const XML_SCHEMAS_FINAL_DEFAULT_UNION: u32 = 32;
pub const XML_SCHEMAS_BLOCK_DEFAULT_EXTENSION: u32 = 64;
pub const XML_SCHEMAS_BLOCK_DEFAULT_RESTRICTION: u32 = 128;
pub const XML_SCHEMAS_BLOCK_DEFAULT_SUBSTITUTION: u32 = 256;
pub const XML_SCHEMAS_INCLUDING_CONVERT_NS: u32 = 512;
extern "C" {
  pub fn xmlCheckVersion(version: ::std::os::raw::c_int);
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
  pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
  assert_eq!(
    ::std::mem::size_of::<__fsid_t>(),
    8usize,
    concat!("Size of: ", stringify!(__fsid_t))
  );
  assert_eq!(
    ::std::mem::align_of::<__fsid_t>(),
    4usize,
    concat!("Alignment of ", stringify!(__fsid_t))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__fsid_t),
      "::",
      stringify!(__val)
    )
  );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
  pub __count: ::std::os::raw::c_int,
  pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
  pub __wch: ::std::os::raw::c_uint,
  pub __wchb: [::std::os::raw::c_char; 4usize],
  _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
    4usize,
    concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__mbstate_t__bindgen_ty_1),
      "::",
      stringify!(__wch)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__mbstate_t__bindgen_ty_1),
      "::",
      stringify!(__wchb)
    )
  );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
  assert_eq!(
    ::std::mem::size_of::<__mbstate_t>(),
    8usize,
    concat!("Size of: ", stringify!(__mbstate_t))
  );
  assert_eq!(
    ::std::mem::align_of::<__mbstate_t>(),
    4usize,
    concat!("Alignment of ", stringify!(__mbstate_t))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__mbstate_t),
      "::",
      stringify!(__count)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(__mbstate_t),
      "::",
      stringify!(__value)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
  pub __pos: __off_t,
  pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
  assert_eq!(
    ::std::mem::size_of::<_G_fpos_t>(),
    16usize,
    concat!("Size of: ", stringify!(_G_fpos_t))
  );
  assert_eq!(
    ::std::mem::align_of::<_G_fpos_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_G_fpos_t))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_G_fpos_t),
      "::",
      stringify!(__pos)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_G_fpos_t),
      "::",
      stringify!(__state)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
  pub __pos: __off64_t,
  pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
  assert_eq!(
    ::std::mem::size_of::<_G_fpos64_t>(),
    16usize,
    concat!("Size of: ", stringify!(_G_fpos64_t))
  );
  assert_eq!(
    ::std::mem::align_of::<_G_fpos64_t>(),
    8usize,
    concat!("Alignment of ", stringify!(_G_fpos64_t))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_G_fpos64_t),
      "::",
      stringify!(__pos)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_G_fpos64_t),
      "::",
      stringify!(__state)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
  _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
  pub _next: *mut _IO_marker,
  pub _sbuf: *mut _IO_FILE,
  pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
  assert_eq!(
    ::std::mem::size_of::<_IO_marker>(),
    24usize,
    concat!("Size of: ", stringify!(_IO_marker))
  );
  assert_eq!(
    ::std::mem::align_of::<_IO_marker>(),
    8usize,
    concat!("Alignment of ", stringify!(_IO_marker))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_marker>()))._next as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_marker),
      "::",
      stringify!(_next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_marker),
      "::",
      stringify!(_sbuf)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_marker>()))._pos as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_marker),
      "::",
      stringify!(_pos)
    )
  );
}
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
  pub _flags: ::std::os::raw::c_int,
  pub _IO_read_ptr: *mut ::std::os::raw::c_char,
  pub _IO_read_end: *mut ::std::os::raw::c_char,
  pub _IO_read_base: *mut ::std::os::raw::c_char,
  pub _IO_write_base: *mut ::std::os::raw::c_char,
  pub _IO_write_ptr: *mut ::std::os::raw::c_char,
  pub _IO_write_end: *mut ::std::os::raw::c_char,
  pub _IO_buf_base: *mut ::std::os::raw::c_char,
  pub _IO_buf_end: *mut ::std::os::raw::c_char,
  pub _IO_save_base: *mut ::std::os::raw::c_char,
  pub _IO_backup_base: *mut ::std::os::raw::c_char,
  pub _IO_save_end: *mut ::std::os::raw::c_char,
  pub _markers: *mut _IO_marker,
  pub _chain: *mut _IO_FILE,
  pub _fileno: ::std::os::raw::c_int,
  pub _flags2: ::std::os::raw::c_int,
  pub _old_offset: __off_t,
  pub _cur_column: ::std::os::raw::c_ushort,
  pub _vtable_offset: ::std::os::raw::c_schar,
  pub _shortbuf: [::std::os::raw::c_char; 1usize],
  pub _lock: *mut _IO_lock_t,
  pub _offset: __off64_t,
  pub __pad1: *mut ::std::os::raw::c_void,
  pub __pad2: *mut ::std::os::raw::c_void,
  pub __pad3: *mut ::std::os::raw::c_void,
  pub __pad4: *mut ::std::os::raw::c_void,
  pub __pad5: usize,
  pub _mode: ::std::os::raw::c_int,
  pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
  assert_eq!(
    ::std::mem::size_of::<_IO_FILE>(),
    216usize,
    concat!("Size of: ", stringify!(_IO_FILE))
  );
  assert_eq!(
    ::std::mem::align_of::<_IO_FILE>(),
    8usize,
    concat!("Alignment of ", stringify!(_IO_FILE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_flags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_read_ptr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_read_end)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_read_base)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_write_base)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_write_ptr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_write_end)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_buf_base)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_buf_end)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_save_base)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_backup_base)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_IO_save_end)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_markers)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_chain)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_fileno)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
    116usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_flags2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_old_offset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_cur_column)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
    130usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_vtable_offset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
    131usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_shortbuf)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_lock)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_offset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(__pad1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(__pad2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(__pad3)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(__pad4)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(__pad5)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_mode)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
    196usize,
    concat!(
      "Offset of field: ",
      stringify!(_IO_FILE),
      "::",
      stringify!(_unused2)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
  _unused: [u8; 0],
}
extern "C" {
  #[link_name = "\u{1}_IO_2_1_stdin_"]
  pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
  #[link_name = "\u{1}_IO_2_1_stdout_"]
  pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
  #[link_name = "\u{1}_IO_2_1_stderr_"]
  pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::std::option::Option<
  unsafe extern "C" fn(
    __cookie: *mut ::std::os::raw::c_void,
    __buf: *mut ::std::os::raw::c_char,
    __nbytes: usize,
  ) -> __ssize_t,
>;
pub type __io_write_fn = ::std::option::Option<
  unsafe extern "C" fn(
    __cookie: *mut ::std::os::raw::c_void,
    __buf: *const ::std::os::raw::c_char,
    __n: usize,
  ) -> __ssize_t,
>;
pub type __io_seek_fn = ::std::option::Option<
  unsafe extern "C" fn(
    __cookie: *mut ::std::os::raw::c_void,
    __pos: *mut __off64_t,
    __w: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int,
>;
pub type __io_close_fn = ::std::option::Option<
  unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
extern "C" {
  pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
  pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
  pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_vfscanf(
    arg1: *mut _IO_FILE,
    arg2: *const ::std::os::raw::c_char,
    arg3: *mut __va_list_tag,
    arg4: *mut ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_vfprintf(
    arg1: *mut _IO_FILE,
    arg2: *const ::std::os::raw::c_char,
    arg3: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int, arg3: __ssize_t) -> __ssize_t;
}
extern "C" {
  pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void, arg3: usize) -> usize;
}
extern "C" {
  pub fn _IO_seekoff(
    arg1: *mut _IO_FILE,
    arg2: __off64_t,
    arg3: ::std::os::raw::c_int,
    arg4: ::std::os::raw::c_int,
  ) -> __off64_t;
}
extern "C" {
  pub fn _IO_seekpos(
    arg1: *mut _IO_FILE,
    arg2: __off64_t,
    arg3: ::std::os::raw::c_int,
  ) -> __off64_t;
}
extern "C" {
  pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
  #[link_name = "\u{1}stdin"]
  pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
  #[link_name = "\u{1}stdout"]
  pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
  #[link_name = "\u{1}stderr"]
  pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
  pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn rename(
    __old: *const ::std::os::raw::c_char,
    __new: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn renameat(
    __oldfd: ::std::os::raw::c_int,
    __old: *const ::std::os::raw::c_char,
    __newfd: ::std::os::raw::c_int,
    __new: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn tmpfile() -> *mut FILE;
}
extern "C" {
  pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn tempnam(
    __dir: *const ::std::os::raw::c_char,
    __pfx: *const ::std::os::raw::c_char,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fopen(
    __filename: *const ::std::os::raw::c_char,
    __modes: *const ::std::os::raw::c_char,
  ) -> *mut FILE;
}
extern "C" {
  pub fn freopen(
    __filename: *const ::std::os::raw::c_char,
    __modes: *const ::std::os::raw::c_char,
    __stream: *mut FILE,
  ) -> *mut FILE;
}
extern "C" {
  pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
  pub fn fmemopen(
    __s: *mut ::std::os::raw::c_void,
    __len: usize,
    __modes: *const ::std::os::raw::c_char,
  ) -> *mut FILE;
}
extern "C" {
  pub fn open_memstream(
    __bufloc: *mut *mut ::std::os::raw::c_char,
    __sizeloc: *mut usize,
  ) -> *mut FILE;
}
extern "C" {
  pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
  pub fn setvbuf(
    __stream: *mut FILE,
    __buf: *mut ::std::os::raw::c_char,
    __modes: ::std::os::raw::c_int,
    __n: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
  pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
  pub fn fprintf(
    __stream: *mut FILE,
    __format: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn sprintf(
    __s: *mut ::std::os::raw::c_char,
    __format: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vfprintf(
    __s: *mut FILE,
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vprintf(
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vsprintf(
    __s: *mut ::std::os::raw::c_char,
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn snprintf(
    __s: *mut ::std::os::raw::c_char,
    __maxlen: usize,
    __format: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vsnprintf(
    __s: *mut ::std::os::raw::c_char,
    __maxlen: usize,
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vdprintf(
    __fd: ::std::os::raw::c_int,
    __fmt: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn dprintf(
    __fd: ::std::os::raw::c_int,
    __fmt: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fscanf(
    __stream: *mut FILE,
    __format: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn sscanf(
    __s: *const ::std::os::raw::c_char,
    __format: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  #[link_name = "\u{1}__isoc99_fscanf"]
  pub fn fscanf1(
    __stream: *mut FILE,
    __format: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  #[link_name = "\u{1}__isoc99_scanf"]
  pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
  #[link_name = "\u{1}__isoc99_sscanf"]
  pub fn sscanf1(
    __s: *const ::std::os::raw::c_char,
    __format: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vfscanf(
    __s: *mut FILE,
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vscanf(
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn vsscanf(
    __s: *const ::std::os::raw::c_char,
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  #[link_name = "\u{1}__isoc99_vfscanf"]
  pub fn vfscanf1(
    __s: *mut FILE,
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  #[link_name = "\u{1}__isoc99_vscanf"]
  pub fn vscanf1(
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  #[link_name = "\u{1}__isoc99_vsscanf"]
  pub fn vsscanf1(
    __s: *const ::std::os::raw::c_char,
    __format: *const ::std::os::raw::c_char,
    __arg: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fgets(
    __s: *mut ::std::os::raw::c_char,
    __n: ::std::os::raw::c_int,
    __stream: *mut FILE,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn __getdelim(
    __lineptr: *mut *mut ::std::os::raw::c_char,
    __n: *mut usize,
    __delimiter: ::std::os::raw::c_int,
    __stream: *mut FILE,
  ) -> __ssize_t;
}
extern "C" {
  pub fn getdelim(
    __lineptr: *mut *mut ::std::os::raw::c_char,
    __n: *mut usize,
    __delimiter: ::std::os::raw::c_int,
    __stream: *mut FILE,
  ) -> __ssize_t;
}
extern "C" {
  pub fn getline(
    __lineptr: *mut *mut ::std::os::raw::c_char,
    __n: *mut usize,
    __stream: *mut FILE,
  ) -> __ssize_t;
}
extern "C" {
  pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fread(
    __ptr: *mut ::std::os::raw::c_void,
    __size: usize,
    __n: usize,
    __stream: *mut FILE,
  ) -> usize;
}
extern "C" {
  pub fn fwrite(
    __ptr: *const ::std::os::raw::c_void,
    __size: usize,
    __n: usize,
    __s: *mut FILE,
  ) -> usize;
}
extern "C" {
  pub fn fread_unlocked(
    __ptr: *mut ::std::os::raw::c_void,
    __size: usize,
    __n: usize,
    __stream: *mut FILE,
  ) -> usize;
}
extern "C" {
  pub fn fwrite_unlocked(
    __ptr: *const ::std::os::raw::c_void,
    __size: usize,
    __n: usize,
    __stream: *mut FILE,
  ) -> usize;
}
extern "C" {
  pub fn fseek(
    __stream: *mut FILE,
    __off: ::std::os::raw::c_long,
    __whence: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn rewind(__stream: *mut FILE);
}
extern "C" {
  pub fn fseeko(
    __stream: *mut FILE,
    __off: __off_t,
    __whence: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
  pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
  pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
  pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
  #[link_name = "\u{1}sys_nerr"]
  pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
  #[link_name = "\u{1}sys_errlist"]
  pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
  pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn popen(
    __command: *const ::std::os::raw::c_char,
    __modes: *const ::std::os::raw::c_char,
  ) -> *mut FILE;
}
extern "C" {
  pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
  pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn funlockfile(__stream: *mut FILE);
}
/// xmlChar:
///
/// This is a basic byte in an UTF-8 encoded string.
/// It's unsigned allowing to pinpoint case where char * are assigned
/// to xmlChar * (possibly making serialization back impossible).
pub type xmlChar = ::std::os::raw::c_uchar;
extern "C" {
  pub fn xmlStrdup(cur: *const xmlChar) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlStrndup(cur: *const xmlChar, len: ::std::os::raw::c_int) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlCharStrndup(
    cur: *const ::std::os::raw::c_char,
    len: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlCharStrdup(cur: *const ::std::os::raw::c_char) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlStrsub(
    str: *const xmlChar,
    start: ::std::os::raw::c_int,
    len: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlStrchr(str: *const xmlChar, val: xmlChar) -> *const xmlChar;
}
extern "C" {
  pub fn xmlStrstr(str: *const xmlChar, val: *const xmlChar) -> *const xmlChar;
}
extern "C" {
  pub fn xmlStrcasestr(str: *const xmlChar, val: *const xmlChar) -> *const xmlChar;
}
extern "C" {
  pub fn xmlStrcmp(str1: *const xmlChar, str2: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrncmp(
    str1: *const xmlChar,
    str2: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrcasecmp(str1: *const xmlChar, str2: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrncasecmp(
    str1: *const xmlChar,
    str2: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrEqual(str1: *const xmlChar, str2: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrQEqual(
    pref: *const xmlChar,
    name: *const xmlChar,
    str: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrlen(str: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrcat(cur: *mut xmlChar, add: *const xmlChar) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlStrncat(
    cur: *mut xmlChar,
    add: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlStrncatNew(
    str1: *const xmlChar,
    str2: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlStrPrintf(
    buf: *mut xmlChar,
    len: ::std::os::raw::c_int,
    msg: *const ::std::os::raw::c_char,
    ...
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlStrVPrintf(
    buf: *mut xmlChar,
    len: ::std::os::raw::c_int,
    msg: *const ::std::os::raw::c_char,
    ap: *mut __va_list_tag,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlGetUTF8Char(
    utf: *const ::std::os::raw::c_uchar,
    len: *mut ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlCheckUTF8(utf: *const ::std::os::raw::c_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlUTF8Strsize(utf: *const xmlChar, len: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlUTF8Strndup(utf: *const xmlChar, len: ::std::os::raw::c_int) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlUTF8Strpos(utf: *const xmlChar, pos: ::std::os::raw::c_int) -> *const xmlChar;
}
extern "C" {
  pub fn xmlUTF8Strloc(utf: *const xmlChar, utfchar: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlUTF8Strsub(
    utf: *const xmlChar,
    start: ::std::os::raw::c_int,
    len: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlUTF8Strlen(utf: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlUTF8Size(utf: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlUTF8Charcmp(utf1: *const xmlChar, utf2: *const xmlChar) -> ::std::os::raw::c_int;
}
pub type xmlParserInputBuffer = _xmlParserInputBuffer;
pub type xmlParserInputBufferPtr = *mut xmlParserInputBuffer;
pub type xmlOutputBuffer = _xmlOutputBuffer;
pub type xmlOutputBufferPtr = *mut xmlOutputBuffer;
pub type xmlParserInput = _xmlParserInput;
pub type xmlParserInputPtr = *mut xmlParserInput;
pub type xmlParserCtxt = _xmlParserCtxt;
pub type xmlParserCtxtPtr = *mut xmlParserCtxt;
pub type xmlSAXLocator = _xmlSAXLocator;
pub type xmlSAXLocatorPtr = *mut xmlSAXLocator;
pub type xmlSAXHandler = _xmlSAXHandler;
pub type xmlSAXHandlerPtr = *mut xmlSAXHandler;
pub type xmlEntity = _xmlEntity;
pub type xmlEntityPtr = *mut xmlEntity;
pub const xmlBufferAllocationScheme_XML_BUFFER_ALLOC_DOUBLEIT: xmlBufferAllocationScheme = 0;
pub const xmlBufferAllocationScheme_XML_BUFFER_ALLOC_EXACT: xmlBufferAllocationScheme = 1;
pub const xmlBufferAllocationScheme_XML_BUFFER_ALLOC_IMMUTABLE: xmlBufferAllocationScheme = 2;
pub const xmlBufferAllocationScheme_XML_BUFFER_ALLOC_IO: xmlBufferAllocationScheme = 3;
pub const xmlBufferAllocationScheme_XML_BUFFER_ALLOC_HYBRID: xmlBufferAllocationScheme = 4;
pub const xmlBufferAllocationScheme_XML_BUFFER_ALLOC_BOUNDED: xmlBufferAllocationScheme = 5;
/// xmlBufferAllocationScheme:
///
/// A buffer allocation scheme can be defined to either match exactly the
/// need or double it's allocated size each time it is found too small.
pub type xmlBufferAllocationScheme = u32;
/// xmlBuffer:
///
/// A buffer structure, this old construct is limited to 2GB and
/// is being deprecated, use API with xmlBuf instead
pub type xmlBuffer = _xmlBuffer;
pub type xmlBufferPtr = *mut xmlBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlBuffer {
  pub content: *mut xmlChar,
  pub use_: ::std::os::raw::c_uint,
  pub size: ::std::os::raw::c_uint,
  pub alloc: xmlBufferAllocationScheme,
  pub contentIO: *mut xmlChar,
}
#[test]
fn bindgen_test_layout__xmlBuffer() {
  assert_eq!(
    ::std::mem::size_of::<_xmlBuffer>(),
    32usize,
    concat!("Size of: ", stringify!(_xmlBuffer))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlBuffer>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlBuffer))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlBuffer>())).content as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlBuffer),
      "::",
      stringify!(content)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlBuffer>())).use_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlBuffer),
      "::",
      stringify!(use_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlBuffer>())).size as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlBuffer),
      "::",
      stringify!(size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlBuffer>())).alloc as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlBuffer),
      "::",
      stringify!(alloc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlBuffer>())).contentIO as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlBuffer),
      "::",
      stringify!(contentIO)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlBuf {
  _unused: [u8; 0],
}
/// xmlBuf:
///
/// A buffer structure, new one, the actual structure internals are not public
pub type xmlBuf = _xmlBuf;
/// xmlBufPtr:
///
/// A pointer to a buffer structure, the actual structure internals are not
/// public
pub type xmlBufPtr = *mut xmlBuf;
extern "C" {
  pub fn xmlBufContent(buf: *const xmlBuf) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlBufEnd(buf: xmlBufPtr) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlBufUse(buf: xmlBufPtr) -> usize;
}
extern "C" {
  pub fn xmlBufShrink(buf: xmlBufPtr, len: usize) -> usize;
}
pub const xmlElementType_XML_ELEMENT_NODE: xmlElementType = 1;
pub const xmlElementType_XML_ATTRIBUTE_NODE: xmlElementType = 2;
pub const xmlElementType_XML_TEXT_NODE: xmlElementType = 3;
pub const xmlElementType_XML_CDATA_SECTION_NODE: xmlElementType = 4;
pub const xmlElementType_XML_ENTITY_REF_NODE: xmlElementType = 5;
pub const xmlElementType_XML_ENTITY_NODE: xmlElementType = 6;
pub const xmlElementType_XML_PI_NODE: xmlElementType = 7;
pub const xmlElementType_XML_COMMENT_NODE: xmlElementType = 8;
pub const xmlElementType_XML_DOCUMENT_NODE: xmlElementType = 9;
pub const xmlElementType_XML_DOCUMENT_TYPE_NODE: xmlElementType = 10;
pub const xmlElementType_XML_DOCUMENT_FRAG_NODE: xmlElementType = 11;
pub const xmlElementType_XML_NOTATION_NODE: xmlElementType = 12;
pub const xmlElementType_XML_HTML_DOCUMENT_NODE: xmlElementType = 13;
pub const xmlElementType_XML_DTD_NODE: xmlElementType = 14;
pub const xmlElementType_XML_ELEMENT_DECL: xmlElementType = 15;
pub const xmlElementType_XML_ATTRIBUTE_DECL: xmlElementType = 16;
pub const xmlElementType_XML_ENTITY_DECL: xmlElementType = 17;
pub const xmlElementType_XML_NAMESPACE_DECL: xmlElementType = 18;
pub const xmlElementType_XML_XINCLUDE_START: xmlElementType = 19;
pub const xmlElementType_XML_XINCLUDE_END: xmlElementType = 20;
pub const xmlElementType_XML_DOCB_DOCUMENT_NODE: xmlElementType = 21;
pub type xmlElementType = u32;
/// xmlNotation:
///
/// A DTD Notation definition.
pub type xmlNotation = _xmlNotation;
pub type xmlNotationPtr = *mut xmlNotation;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlNotation {
  pub name: *const xmlChar,
  pub PublicID: *const xmlChar,
  pub SystemID: *const xmlChar,
}
#[test]
fn bindgen_test_layout__xmlNotation() {
  assert_eq!(
    ::std::mem::size_of::<_xmlNotation>(),
    24usize,
    concat!("Size of: ", stringify!(_xmlNotation))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlNotation>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlNotation))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNotation>())).name as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNotation),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNotation>())).PublicID as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNotation),
      "::",
      stringify!(PublicID)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNotation>())).SystemID as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNotation),
      "::",
      stringify!(SystemID)
    )
  );
}
pub const xmlAttributeType_XML_ATTRIBUTE_CDATA: xmlAttributeType = 1;
pub const xmlAttributeType_XML_ATTRIBUTE_ID: xmlAttributeType = 2;
pub const xmlAttributeType_XML_ATTRIBUTE_IDREF: xmlAttributeType = 3;
pub const xmlAttributeType_XML_ATTRIBUTE_IDREFS: xmlAttributeType = 4;
pub const xmlAttributeType_XML_ATTRIBUTE_ENTITY: xmlAttributeType = 5;
pub const xmlAttributeType_XML_ATTRIBUTE_ENTITIES: xmlAttributeType = 6;
pub const xmlAttributeType_XML_ATTRIBUTE_NMTOKEN: xmlAttributeType = 7;
pub const xmlAttributeType_XML_ATTRIBUTE_NMTOKENS: xmlAttributeType = 8;
pub const xmlAttributeType_XML_ATTRIBUTE_ENUMERATION: xmlAttributeType = 9;
pub const xmlAttributeType_XML_ATTRIBUTE_NOTATION: xmlAttributeType = 10;
/// xmlAttributeType:
///
/// A DTD Attribute type definition.
pub type xmlAttributeType = u32;
pub const xmlAttributeDefault_XML_ATTRIBUTE_NONE: xmlAttributeDefault = 1;
pub const xmlAttributeDefault_XML_ATTRIBUTE_REQUIRED: xmlAttributeDefault = 2;
pub const xmlAttributeDefault_XML_ATTRIBUTE_IMPLIED: xmlAttributeDefault = 3;
pub const xmlAttributeDefault_XML_ATTRIBUTE_FIXED: xmlAttributeDefault = 4;
/// xmlAttributeDefault:
///
/// A DTD Attribute default definition.
pub type xmlAttributeDefault = u32;
/// xmlEnumeration:
///
/// List structure used when there is an enumeration in DTDs.
pub type xmlEnumeration = _xmlEnumeration;
pub type xmlEnumerationPtr = *mut xmlEnumeration;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlEnumeration {
  pub next: *mut _xmlEnumeration,
  pub name: *const xmlChar,
}
#[test]
fn bindgen_test_layout__xmlEnumeration() {
  assert_eq!(
    ::std::mem::size_of::<_xmlEnumeration>(),
    16usize,
    concat!("Size of: ", stringify!(_xmlEnumeration))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlEnumeration>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlEnumeration))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEnumeration>())).next as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEnumeration),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEnumeration>())).name as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEnumeration),
      "::",
      stringify!(name)
    )
  );
}
/// xmlAttribute:
///
/// An Attribute declaration in a DTD.
pub type xmlAttribute = _xmlAttribute;
pub type xmlAttributePtr = *mut xmlAttribute;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlAttribute {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: xmlElementType,
  pub name: *const xmlChar,
  pub children: *mut _xmlNode,
  pub last: *mut _xmlNode,
  pub parent: *mut _xmlDtd,
  pub next: *mut _xmlNode,
  pub prev: *mut _xmlNode,
  pub doc: *mut _xmlDoc,
  pub nexth: *mut _xmlAttribute,
  pub atype: xmlAttributeType,
  pub def: xmlAttributeDefault,
  pub defaultValue: *const xmlChar,
  pub tree: xmlEnumerationPtr,
  pub prefix: *const xmlChar,
  pub elem: *const xmlChar,
}
#[test]
fn bindgen_test_layout__xmlAttribute() {
  assert_eq!(
    ::std::mem::size_of::<_xmlAttribute>(),
    120usize,
    concat!("Size of: ", stringify!(_xmlAttribute))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlAttribute>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlAttribute))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).name as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).children as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(children)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).last as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(last)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).parent as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).next as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).prev as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(prev)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).doc as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).nexth as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(nexth)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).atype as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(atype)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).def as *const _ as usize },
    84usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(def)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).defaultValue as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(defaultValue)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).tree as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(tree)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).prefix as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(prefix)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttribute>())).elem as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttribute),
      "::",
      stringify!(elem)
    )
  );
}
pub const xmlElementContentType_XML_ELEMENT_CONTENT_PCDATA: xmlElementContentType = 1;
pub const xmlElementContentType_XML_ELEMENT_CONTENT_ELEMENT: xmlElementContentType = 2;
pub const xmlElementContentType_XML_ELEMENT_CONTENT_SEQ: xmlElementContentType = 3;
pub const xmlElementContentType_XML_ELEMENT_CONTENT_OR: xmlElementContentType = 4;
/// xmlElementContentType:
///
/// Possible definitions of element content types.
pub type xmlElementContentType = u32;
pub const xmlElementContentOccur_XML_ELEMENT_CONTENT_ONCE: xmlElementContentOccur = 1;
pub const xmlElementContentOccur_XML_ELEMENT_CONTENT_OPT: xmlElementContentOccur = 2;
pub const xmlElementContentOccur_XML_ELEMENT_CONTENT_MULT: xmlElementContentOccur = 3;
pub const xmlElementContentOccur_XML_ELEMENT_CONTENT_PLUS: xmlElementContentOccur = 4;
/// xmlElementContentOccur:
///
/// Possible definitions of element content occurrences.
pub type xmlElementContentOccur = u32;
/// xmlElementContent:
///
/// An XML Element content as stored after parsing an element definition
/// in a DTD.
pub type xmlElementContent = _xmlElementContent;
pub type xmlElementContentPtr = *mut xmlElementContent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlElementContent {
  pub type_: xmlElementContentType,
  pub ocur: xmlElementContentOccur,
  pub name: *const xmlChar,
  pub c1: *mut _xmlElementContent,
  pub c2: *mut _xmlElementContent,
  pub parent: *mut _xmlElementContent,
  pub prefix: *const xmlChar,
}
#[test]
fn bindgen_test_layout__xmlElementContent() {
  assert_eq!(
    ::std::mem::size_of::<_xmlElementContent>(),
    48usize,
    concat!("Size of: ", stringify!(_xmlElementContent))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlElementContent>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlElementContent))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElementContent>())).type_ as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElementContent),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElementContent>())).ocur as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElementContent),
      "::",
      stringify!(ocur)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElementContent>())).name as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElementContent),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElementContent>())).c1 as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElementContent),
      "::",
      stringify!(c1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElementContent>())).c2 as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElementContent),
      "::",
      stringify!(c2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElementContent>())).parent as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElementContent),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElementContent>())).prefix as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElementContent),
      "::",
      stringify!(prefix)
    )
  );
}
pub const xmlElementTypeVal_XML_ELEMENT_TYPE_UNDEFINED: xmlElementTypeVal = 0;
pub const xmlElementTypeVal_XML_ELEMENT_TYPE_EMPTY: xmlElementTypeVal = 1;
pub const xmlElementTypeVal_XML_ELEMENT_TYPE_ANY: xmlElementTypeVal = 2;
pub const xmlElementTypeVal_XML_ELEMENT_TYPE_MIXED: xmlElementTypeVal = 3;
pub const xmlElementTypeVal_XML_ELEMENT_TYPE_ELEMENT: xmlElementTypeVal = 4;
/// xmlElementTypeVal:
///
/// The different possibilities for an element content type.
pub type xmlElementTypeVal = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlRegexp {
  _unused: [u8; 0],
}
/// xmlRegexpPtr:
///
/// A libxml regular expression, they can actually be far more complex
/// thank the POSIX regex expressions.
pub type xmlRegexp = _xmlRegexp;
pub type xmlRegexpPtr = *mut xmlRegexp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlRegExecCtxt {
  _unused: [u8; 0],
}
/// xmlRegExecCtxtPtr:
///
/// A libxml progressive regular expression evaluation context
pub type xmlRegExecCtxt = _xmlRegExecCtxt;
pub type xmlRegExecCtxtPtr = *mut xmlRegExecCtxt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlDict {
  _unused: [u8; 0],
}
pub type xmlDict = _xmlDict;
pub type xmlDictPtr = *mut xmlDict;
extern "C" {
  pub fn xmlInitializeDict() -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDictCreate() -> xmlDictPtr;
}
extern "C" {
  pub fn xmlDictSetLimit(dict: xmlDictPtr, limit: usize) -> usize;
}
extern "C" {
  pub fn xmlDictGetUsage(dict: xmlDictPtr) -> usize;
}
extern "C" {
  pub fn xmlDictCreateSub(sub: xmlDictPtr) -> xmlDictPtr;
}
extern "C" {
  pub fn xmlDictReference(dict: xmlDictPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDictFree(dict: xmlDictPtr);
}
extern "C" {
  pub fn xmlDictLookup(
    dict: xmlDictPtr,
    name: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> *const xmlChar;
}
extern "C" {
  pub fn xmlDictExists(
    dict: xmlDictPtr,
    name: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> *const xmlChar;
}
extern "C" {
  pub fn xmlDictQLookup(
    dict: xmlDictPtr,
    prefix: *const xmlChar,
    name: *const xmlChar,
  ) -> *const xmlChar;
}
extern "C" {
  pub fn xmlDictOwns(dict: xmlDictPtr, str: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDictSize(dict: xmlDictPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDictCleanup();
}
extern "C" {
  pub fn xmlRegexpCompile(regexp: *const xmlChar) -> xmlRegexpPtr;
}
extern "C" {
  pub fn xmlRegFreeRegexp(regexp: xmlRegexpPtr);
}
extern "C" {
  pub fn xmlRegexpExec(comp: xmlRegexpPtr, value: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlRegexpPrint(output: *mut FILE, regexp: xmlRegexpPtr);
}
extern "C" {
  pub fn xmlRegexpIsDeterminist(comp: xmlRegexpPtr) -> ::std::os::raw::c_int;
}
/// xmlRegExecCallbacks:
/// @exec: the regular expression context
/// @token: the current token string
/// @transdata: transition data
/// @inputdata: input data
///
/// Callback function when doing a transition in the automata
pub type xmlRegExecCallbacks = ::std::option::Option<
  unsafe extern "C" fn(
    exec: xmlRegExecCtxtPtr,
    token: *const xmlChar,
    transdata: *mut ::std::os::raw::c_void,
    inputdata: *mut ::std::os::raw::c_void,
  ),
>;
extern "C" {
  pub fn xmlRegNewExecCtxt(
    comp: xmlRegexpPtr,
    callback: xmlRegExecCallbacks,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlRegExecCtxtPtr;
}
extern "C" {
  pub fn xmlRegFreeExecCtxt(exec: xmlRegExecCtxtPtr);
}
extern "C" {
  pub fn xmlRegExecPushString(
    exec: xmlRegExecCtxtPtr,
    value: *const xmlChar,
    data: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlRegExecPushString2(
    exec: xmlRegExecCtxtPtr,
    value: *const xmlChar,
    value2: *const xmlChar,
    data: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlRegExecNextValues(
    exec: xmlRegExecCtxtPtr,
    nbval: *mut ::std::os::raw::c_int,
    nbneg: *mut ::std::os::raw::c_int,
    values: *mut *mut xmlChar,
    terminal: *mut ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlRegExecErrInfo(
    exec: xmlRegExecCtxtPtr,
    string: *mut *const xmlChar,
    nbval: *mut ::std::os::raw::c_int,
    nbneg: *mut ::std::os::raw::c_int,
    values: *mut *mut xmlChar,
    terminal: *mut ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlExpCtxt {
  _unused: [u8; 0],
}
pub type xmlExpCtxt = _xmlExpCtxt;
pub type xmlExpCtxtPtr = *mut xmlExpCtxt;
extern "C" {
  pub fn xmlExpFreeCtxt(ctxt: xmlExpCtxtPtr);
}
extern "C" {
  pub fn xmlExpNewCtxt(maxNodes: ::std::os::raw::c_int, dict: xmlDictPtr) -> xmlExpCtxtPtr;
}
extern "C" {
  pub fn xmlExpCtxtNbNodes(ctxt: xmlExpCtxtPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlExpCtxtNbCons(ctxt: xmlExpCtxtPtr) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlExpNode {
  _unused: [u8; 0],
}
pub type xmlExpNode = _xmlExpNode;
pub type xmlExpNodePtr = *mut xmlExpNode;
pub const xmlExpNodeType_XML_EXP_EMPTY: xmlExpNodeType = 0;
pub const xmlExpNodeType_XML_EXP_FORBID: xmlExpNodeType = 1;
pub const xmlExpNodeType_XML_EXP_ATOM: xmlExpNodeType = 2;
pub const xmlExpNodeType_XML_EXP_SEQ: xmlExpNodeType = 3;
pub const xmlExpNodeType_XML_EXP_OR: xmlExpNodeType = 4;
pub const xmlExpNodeType_XML_EXP_COUNT: xmlExpNodeType = 5;
pub type xmlExpNodeType = u32;
extern "C" {
  #[link_name = "\u{1}forbiddenExp"]
  pub static mut forbiddenExp: xmlExpNodePtr;
}
extern "C" {
  #[link_name = "\u{1}emptyExp"]
  pub static mut emptyExp: xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpFree(ctxt: xmlExpCtxtPtr, expr: xmlExpNodePtr);
}
extern "C" {
  pub fn xmlExpRef(expr: xmlExpNodePtr);
}
extern "C" {
  pub fn xmlExpParse(ctxt: xmlExpCtxtPtr, expr: *const ::std::os::raw::c_char) -> xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpNewAtom(
    ctxt: xmlExpCtxtPtr,
    name: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpNewOr(
    ctxt: xmlExpCtxtPtr,
    left: xmlExpNodePtr,
    right: xmlExpNodePtr,
  ) -> xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpNewSeq(
    ctxt: xmlExpCtxtPtr,
    left: xmlExpNodePtr,
    right: xmlExpNodePtr,
  ) -> xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpNewRange(
    ctxt: xmlExpCtxtPtr,
    subset: xmlExpNodePtr,
    min: ::std::os::raw::c_int,
    max: ::std::os::raw::c_int,
  ) -> xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpIsNillable(expr: xmlExpNodePtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlExpMaxToken(expr: xmlExpNodePtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlExpGetLanguage(
    ctxt: xmlExpCtxtPtr,
    expr: xmlExpNodePtr,
    langList: *mut *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlExpGetStart(
    ctxt: xmlExpCtxtPtr,
    expr: xmlExpNodePtr,
    tokList: *mut *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlExpStringDerive(
    ctxt: xmlExpCtxtPtr,
    expr: xmlExpNodePtr,
    str: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpExpDerive(
    ctxt: xmlExpCtxtPtr,
    expr: xmlExpNodePtr,
    sub: xmlExpNodePtr,
  ) -> xmlExpNodePtr;
}
extern "C" {
  pub fn xmlExpSubsume(
    ctxt: xmlExpCtxtPtr,
    expr: xmlExpNodePtr,
    sub: xmlExpNodePtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlExpDump(buf: xmlBufferPtr, expr: xmlExpNodePtr);
}
/// xmlElement:
///
/// An XML Element declaration from a DTD.
pub type xmlElement = _xmlElement;
pub type xmlElementPtr = *mut xmlElement;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlElement {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: xmlElementType,
  pub name: *const xmlChar,
  pub children: *mut _xmlNode,
  pub last: *mut _xmlNode,
  pub parent: *mut _xmlDtd,
  pub next: *mut _xmlNode,
  pub prev: *mut _xmlNode,
  pub doc: *mut _xmlDoc,
  pub etype: xmlElementTypeVal,
  pub content: xmlElementContentPtr,
  pub attributes: xmlAttributePtr,
  pub prefix: *const xmlChar,
  pub contModel: xmlRegexpPtr,
}
#[test]
fn bindgen_test_layout__xmlElement() {
  assert_eq!(
    ::std::mem::size_of::<_xmlElement>(),
    112usize,
    concat!("Size of: ", stringify!(_xmlElement))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlElement>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlElement))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).name as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).children as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(children)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).last as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(last)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).parent as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).next as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).prev as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(prev)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).doc as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).etype as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(etype)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).content as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(content)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).attributes as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(attributes)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).prefix as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(prefix)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlElement>())).contModel as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlElement),
      "::",
      stringify!(contModel)
    )
  );
}
pub use self::xmlElementType as xmlNsType;
/// xmlNs:
///
/// An XML namespace.
/// Note that prefix == NULL is valid, it defines the default namespace
/// within the subtree (until overridden).
///
/// xmlNsType is unified with xmlElementType.
pub type xmlNs = _xmlNs;
pub type xmlNsPtr = *mut xmlNs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlNs {
  pub next: *mut _xmlNs,
  pub type_: xmlNsType,
  pub href: *const xmlChar,
  pub prefix: *const xmlChar,
  pub _private: *mut ::std::os::raw::c_void,
  pub context: *mut _xmlDoc,
}
#[test]
fn bindgen_test_layout__xmlNs() {
  assert_eq!(
    ::std::mem::size_of::<_xmlNs>(),
    48usize,
    concat!("Size of: ", stringify!(_xmlNs))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlNs>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlNs))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNs>())).next as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNs),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNs>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNs),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNs>())).href as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNs),
      "::",
      stringify!(href)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNs>())).prefix as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNs),
      "::",
      stringify!(prefix)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNs>()))._private as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNs),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNs>())).context as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNs),
      "::",
      stringify!(context)
    )
  );
}
/// xmlDtd:
///
/// An XML DTD, as defined by <!DOCTYPE ... There is actually one for
/// the internal subset and for the external subset.
pub type xmlDtd = _xmlDtd;
pub type xmlDtdPtr = *mut xmlDtd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlDtd {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: xmlElementType,
  pub name: *const xmlChar,
  pub children: *mut _xmlNode,
  pub last: *mut _xmlNode,
  pub parent: *mut _xmlDoc,
  pub next: *mut _xmlNode,
  pub prev: *mut _xmlNode,
  pub doc: *mut _xmlDoc,
  pub notations: *mut ::std::os::raw::c_void,
  pub elements: *mut ::std::os::raw::c_void,
  pub attributes: *mut ::std::os::raw::c_void,
  pub entities: *mut ::std::os::raw::c_void,
  pub ExternalID: *const xmlChar,
  pub SystemID: *const xmlChar,
  pub pentities: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__xmlDtd() {
  assert_eq!(
    ::std::mem::size_of::<_xmlDtd>(),
    128usize,
    concat!("Size of: ", stringify!(_xmlDtd))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlDtd>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlDtd))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).name as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).children as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(children)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).last as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(last)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).parent as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).next as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).prev as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(prev)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).doc as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).notations as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(notations)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).elements as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(elements)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).attributes as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(attributes)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).entities as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(entities)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).ExternalID as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(ExternalID)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).SystemID as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(SystemID)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDtd>())).pentities as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDtd),
      "::",
      stringify!(pentities)
    )
  );
}
/// xmlAttr:
///
/// An attribute on an XML node.
pub type xmlAttr = _xmlAttr;
pub type xmlAttrPtr = *mut xmlAttr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlAttr {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: xmlElementType,
  pub name: *const xmlChar,
  pub children: *mut _xmlNode,
  pub last: *mut _xmlNode,
  pub parent: *mut _xmlNode,
  pub next: *mut _xmlAttr,
  pub prev: *mut _xmlAttr,
  pub doc: *mut _xmlDoc,
  pub ns: *mut xmlNs,
  pub atype: xmlAttributeType,
  pub psvi: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__xmlAttr() {
  assert_eq!(
    ::std::mem::size_of::<_xmlAttr>(),
    96usize,
    concat!("Size of: ", stringify!(_xmlAttr))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlAttr>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlAttr))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).name as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).children as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(children)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).last as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(last)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).parent as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).next as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).prev as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(prev)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).doc as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).ns as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(ns)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).atype as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(atype)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlAttr>())).psvi as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlAttr),
      "::",
      stringify!(psvi)
    )
  );
}
/// xmlID:
///
/// An XML ID instance.
pub type xmlID = _xmlID;
pub type xmlIDPtr = *mut xmlID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlID {
  pub next: *mut _xmlID,
  pub value: *const xmlChar,
  pub attr: xmlAttrPtr,
  pub name: *const xmlChar,
  pub lineno: ::std::os::raw::c_int,
  pub doc: *mut _xmlDoc,
}
#[test]
fn bindgen_test_layout__xmlID() {
  assert_eq!(
    ::std::mem::size_of::<_xmlID>(),
    48usize,
    concat!("Size of: ", stringify!(_xmlID))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlID>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlID))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlID>())).next as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlID),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlID>())).value as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlID),
      "::",
      stringify!(value)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlID>())).attr as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlID),
      "::",
      stringify!(attr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlID>())).name as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlID),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlID>())).lineno as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlID),
      "::",
      stringify!(lineno)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlID>())).doc as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlID),
      "::",
      stringify!(doc)
    )
  );
}
/// xmlRef:
///
/// An XML IDREF instance.
pub type xmlRef = _xmlRef;
pub type xmlRefPtr = *mut xmlRef;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlRef {
  pub next: *mut _xmlRef,
  pub value: *const xmlChar,
  pub attr: xmlAttrPtr,
  pub name: *const xmlChar,
  pub lineno: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__xmlRef() {
  assert_eq!(
    ::std::mem::size_of::<_xmlRef>(),
    40usize,
    concat!("Size of: ", stringify!(_xmlRef))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlRef>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlRef))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlRef>())).next as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlRef),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlRef>())).value as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlRef),
      "::",
      stringify!(value)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlRef>())).attr as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlRef),
      "::",
      stringify!(attr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlRef>())).name as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlRef),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlRef>())).lineno as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlRef),
      "::",
      stringify!(lineno)
    )
  );
}
/// xmlNode:
///
/// A node in an XML tree.
pub type xmlNode = _xmlNode;
pub type xmlNodePtr = *mut xmlNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlNode {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: xmlElementType,
  pub name: *const xmlChar,
  pub children: *mut _xmlNode,
  pub last: *mut _xmlNode,
  pub parent: *mut _xmlNode,
  pub next: *mut _xmlNode,
  pub prev: *mut _xmlNode,
  pub doc: *mut _xmlDoc,
  pub ns: *mut xmlNs,
  pub content: *mut xmlChar,
  pub properties: *mut _xmlAttr,
  pub nsDef: *mut xmlNs,
  pub psvi: *mut ::std::os::raw::c_void,
  pub line: ::std::os::raw::c_ushort,
  pub extra: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__xmlNode() {
  assert_eq!(
    ::std::mem::size_of::<_xmlNode>(),
    120usize,
    concat!("Size of: ", stringify!(_xmlNode))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlNode>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlNode))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).name as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).children as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(children)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).last as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(last)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).parent as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).next as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).prev as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(prev)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).doc as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).ns as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(ns)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).content as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(content)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).properties as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(properties)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).nsDef as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(nsDef)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).psvi as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(psvi)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).line as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(line)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlNode>())).extra as *const _ as usize },
    114usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlNode),
      "::",
      stringify!(extra)
    )
  );
}
pub const xmlDocProperties_XML_DOC_WELLFORMED: xmlDocProperties = 1;
pub const xmlDocProperties_XML_DOC_NSVALID: xmlDocProperties = 2;
pub const xmlDocProperties_XML_DOC_OLD10: xmlDocProperties = 4;
pub const xmlDocProperties_XML_DOC_DTDVALID: xmlDocProperties = 8;
pub const xmlDocProperties_XML_DOC_XINCLUDE: xmlDocProperties = 16;
pub const xmlDocProperties_XML_DOC_USERBUILT: xmlDocProperties = 32;
pub const xmlDocProperties_XML_DOC_INTERNAL: xmlDocProperties = 64;
pub const xmlDocProperties_XML_DOC_HTML: xmlDocProperties = 128;
/// xmlDocProperty
///
/// Set of properties of the document as found by the parser
/// Some of them are linked to similary named xmlParserOption
pub type xmlDocProperties = u32;
/// xmlDoc:
///
/// An XML document.
pub type xmlDoc = _xmlDoc;
pub type xmlDocPtr = *mut xmlDoc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlDoc {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: xmlElementType,
  pub name: *mut ::std::os::raw::c_char,
  pub children: *mut _xmlNode,
  pub last: *mut _xmlNode,
  pub parent: *mut _xmlNode,
  pub next: *mut _xmlNode,
  pub prev: *mut _xmlNode,
  pub doc: *mut _xmlDoc,
  pub compression: ::std::os::raw::c_int,
  pub standalone: ::std::os::raw::c_int,
  pub intSubset: *mut _xmlDtd,
  pub extSubset: *mut _xmlDtd,
  pub oldNs: *mut _xmlNs,
  pub version: *const xmlChar,
  pub encoding: *const xmlChar,
  pub ids: *mut ::std::os::raw::c_void,
  pub refs: *mut ::std::os::raw::c_void,
  pub URL: *const xmlChar,
  pub charset: ::std::os::raw::c_int,
  pub dict: *mut _xmlDict,
  pub psvi: *mut ::std::os::raw::c_void,
  pub parseFlags: ::std::os::raw::c_int,
  pub properties: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__xmlDoc() {
  assert_eq!(
    ::std::mem::size_of::<_xmlDoc>(),
    176usize,
    concat!("Size of: ", stringify!(_xmlDoc))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlDoc>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlDoc))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).name as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).children as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(children)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).last as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(last)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).parent as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).next as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).prev as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(prev)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).doc as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).compression as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(compression)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).standalone as *const _ as usize },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(standalone)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).intSubset as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(intSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).extSubset as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(extSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).oldNs as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(oldNs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).version as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(version)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).encoding as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(encoding)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).ids as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(ids)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).refs as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(refs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).URL as *const _ as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(URL)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).charset as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(charset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).dict as *const _ as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(dict)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).psvi as *const _ as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(psvi)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).parseFlags as *const _ as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(parseFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDoc>())).properties as *const _ as usize },
    172usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDoc),
      "::",
      stringify!(properties)
    )
  );
}
pub type xmlDOMWrapCtxt = _xmlDOMWrapCtxt;
pub type xmlDOMWrapCtxtPtr = *mut xmlDOMWrapCtxt;
/// xmlDOMWrapAcquireNsFunction:
/// @ctxt:  a DOM wrapper context
/// @node:  the context node (element or attribute)
/// @nsName:  the requested namespace name
/// @nsPrefix:  the requested namespace prefix
///
/// A function called to acquire namespaces (xmlNs) from the wrapper.
///
/// Returns an xmlNsPtr or NULL in case of an error.
pub type xmlDOMWrapAcquireNsFunction = ::std::option::Option<
  unsafe extern "C" fn(
    ctxt: xmlDOMWrapCtxtPtr,
    node: xmlNodePtr,
    nsName: *const xmlChar,
    nsPrefix: *const xmlChar,
  ) -> xmlNsPtr,
>;
/// xmlDOMWrapCtxt:
///
/// Context for DOM wrapper-operations.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlDOMWrapCtxt {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: ::std::os::raw::c_int,
  pub namespaceMap: *mut ::std::os::raw::c_void,
  pub getNsForNodeFunc: xmlDOMWrapAcquireNsFunction,
}
#[test]
fn bindgen_test_layout__xmlDOMWrapCtxt() {
  assert_eq!(
    ::std::mem::size_of::<_xmlDOMWrapCtxt>(),
    32usize,
    concat!("Size of: ", stringify!(_xmlDOMWrapCtxt))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlDOMWrapCtxt>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlDOMWrapCtxt))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDOMWrapCtxt>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDOMWrapCtxt),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDOMWrapCtxt>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDOMWrapCtxt),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDOMWrapCtxt>())).namespaceMap as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDOMWrapCtxt),
      "::",
      stringify!(namespaceMap)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlDOMWrapCtxt>())).getNsForNodeFunc as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlDOMWrapCtxt),
      "::",
      stringify!(getNsForNodeFunc)
    )
  );
}
extern "C" {
  pub fn xmlValidateNCName(
    value: *const xmlChar,
    space: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateQName(
    value: *const xmlChar,
    space: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateName(
    value: *const xmlChar,
    space: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateNMToken(
    value: *const xmlChar,
    space: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBuildQName(
    ncname: *const xmlChar,
    prefix: *const xmlChar,
    memory: *mut xmlChar,
    len: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlSplitQName2(name: *const xmlChar, prefix: *mut *mut xmlChar) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlSplitQName3(name: *const xmlChar, len: *mut ::std::os::raw::c_int) -> *const xmlChar;
}
extern "C" {
  pub fn xmlSetBufferAllocationScheme(scheme: xmlBufferAllocationScheme);
}
extern "C" {
  pub fn xmlGetBufferAllocationScheme() -> xmlBufferAllocationScheme;
}
extern "C" {
  pub fn xmlBufferCreate() -> xmlBufferPtr;
}
extern "C" {
  pub fn xmlBufferCreateSize(size: usize) -> xmlBufferPtr;
}
extern "C" {
  pub fn xmlBufferCreateStatic(mem: *mut ::std::os::raw::c_void, size: usize) -> xmlBufferPtr;
}
extern "C" {
  pub fn xmlBufferResize(buf: xmlBufferPtr, size: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferFree(buf: xmlBufferPtr);
}
extern "C" {
  pub fn xmlBufferDump(file: *mut FILE, buf: xmlBufferPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferAdd(
    buf: xmlBufferPtr,
    str: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferAddHead(
    buf: xmlBufferPtr,
    str: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferCat(buf: xmlBufferPtr, str: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferCCat(
    buf: xmlBufferPtr,
    str: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferShrink(buf: xmlBufferPtr, len: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferGrow(buf: xmlBufferPtr, len: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferEmpty(buf: xmlBufferPtr);
}
extern "C" {
  pub fn xmlBufferContent(buf: *const xmlBuffer) -> *const xmlChar;
}
extern "C" {
  pub fn xmlBufferDetach(buf: xmlBufferPtr) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlBufferSetAllocationScheme(buf: xmlBufferPtr, scheme: xmlBufferAllocationScheme);
}
extern "C" {
  pub fn xmlBufferLength(buf: *const xmlBuffer) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlCreateIntSubset(
    doc: xmlDocPtr,
    name: *const xmlChar,
    ExternalID: *const xmlChar,
    SystemID: *const xmlChar,
  ) -> xmlDtdPtr;
}
extern "C" {
  pub fn xmlNewDtd(
    doc: xmlDocPtr,
    name: *const xmlChar,
    ExternalID: *const xmlChar,
    SystemID: *const xmlChar,
  ) -> xmlDtdPtr;
}
extern "C" {
  pub fn xmlGetIntSubset(doc: *const xmlDoc) -> xmlDtdPtr;
}
extern "C" {
  pub fn xmlFreeDtd(cur: xmlDtdPtr);
}
extern "C" {
  pub fn xmlNewGlobalNs(doc: xmlDocPtr, href: *const xmlChar, prefix: *const xmlChar) -> xmlNsPtr;
}
extern "C" {
  pub fn xmlNewNs(node: xmlNodePtr, href: *const xmlChar, prefix: *const xmlChar) -> xmlNsPtr;
}
extern "C" {
  pub fn xmlFreeNs(cur: xmlNsPtr);
}
extern "C" {
  pub fn xmlFreeNsList(cur: xmlNsPtr);
}
extern "C" {
  pub fn xmlNewDoc(version: *const xmlChar) -> xmlDocPtr;
}
extern "C" {
  pub fn xmlFreeDoc(cur: xmlDocPtr);
}
extern "C" {
  pub fn xmlNewDocProp(doc: xmlDocPtr, name: *const xmlChar, value: *const xmlChar) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlNewProp(node: xmlNodePtr, name: *const xmlChar, value: *const xmlChar) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlNewNsProp(
    node: xmlNodePtr,
    ns: xmlNsPtr,
    name: *const xmlChar,
    value: *const xmlChar,
  ) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlNewNsPropEatName(
    node: xmlNodePtr,
    ns: xmlNsPtr,
    name: *mut xmlChar,
    value: *const xmlChar,
  ) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlFreePropList(cur: xmlAttrPtr);
}
extern "C" {
  pub fn xmlFreeProp(cur: xmlAttrPtr);
}
extern "C" {
  pub fn xmlCopyProp(target: xmlNodePtr, cur: xmlAttrPtr) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlCopyPropList(target: xmlNodePtr, cur: xmlAttrPtr) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlCopyDtd(dtd: xmlDtdPtr) -> xmlDtdPtr;
}
extern "C" {
  pub fn xmlCopyDoc(doc: xmlDocPtr, recursive: ::std::os::raw::c_int) -> xmlDocPtr;
}
extern "C" {
  pub fn xmlNewDocNode(
    doc: xmlDocPtr,
    ns: xmlNsPtr,
    name: *const xmlChar,
    content: *const xmlChar,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewDocNodeEatName(
    doc: xmlDocPtr,
    ns: xmlNsPtr,
    name: *mut xmlChar,
    content: *const xmlChar,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewNode(ns: xmlNsPtr, name: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewNodeEatName(ns: xmlNsPtr, name: *mut xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewChild(
    parent: xmlNodePtr,
    ns: xmlNsPtr,
    name: *const xmlChar,
    content: *const xmlChar,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewDocText(doc: *const xmlDoc, content: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewText(content: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewDocPI(doc: xmlDocPtr, name: *const xmlChar, content: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewPI(name: *const xmlChar, content: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewDocTextLen(
    doc: xmlDocPtr,
    content: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewTextLen(content: *const xmlChar, len: ::std::os::raw::c_int) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewDocComment(doc: xmlDocPtr, content: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewComment(content: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewCDataBlock(
    doc: xmlDocPtr,
    content: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewCharRef(doc: xmlDocPtr, name: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewReference(doc: *const xmlDoc, name: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlCopyNode(node: xmlNodePtr, recursive: ::std::os::raw::c_int) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlDocCopyNode(
    node: xmlNodePtr,
    doc: xmlDocPtr,
    recursive: ::std::os::raw::c_int,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlDocCopyNodeList(doc: xmlDocPtr, node: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlCopyNodeList(node: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewTextChild(
    parent: xmlNodePtr,
    ns: xmlNsPtr,
    name: *const xmlChar,
    content: *const xmlChar,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewDocRawNode(
    doc: xmlDocPtr,
    ns: xmlNsPtr,
    name: *const xmlChar,
    content: *const xmlChar,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNewDocFragment(doc: xmlDocPtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlGetLineNo(node: *const xmlNode) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn xmlGetNodePath(node: *const xmlNode) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlDocGetRootElement(doc: *const xmlDoc) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlGetLastChild(parent: *const xmlNode) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNodeIsText(node: *const xmlNode) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlIsBlankNode(node: *const xmlNode) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDocSetRootElement(doc: xmlDocPtr, root: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNodeSetName(cur: xmlNodePtr, name: *const xmlChar);
}
extern "C" {
  pub fn xmlAddChild(parent: xmlNodePtr, cur: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlAddChildList(parent: xmlNodePtr, cur: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlReplaceNode(old: xmlNodePtr, cur: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlAddPrevSibling(cur: xmlNodePtr, elem: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlAddSibling(cur: xmlNodePtr, elem: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlAddNextSibling(cur: xmlNodePtr, elem: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlUnlinkNode(cur: xmlNodePtr);
}
extern "C" {
  pub fn xmlTextMerge(first: xmlNodePtr, second: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlTextConcat(
    node: xmlNodePtr,
    content: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlFreeNodeList(cur: xmlNodePtr);
}
extern "C" {
  pub fn xmlFreeNode(cur: xmlNodePtr);
}
extern "C" {
  pub fn xmlSetTreeDoc(tree: xmlNodePtr, doc: xmlDocPtr);
}
extern "C" {
  pub fn xmlSetListDoc(list: xmlNodePtr, doc: xmlDocPtr);
}
extern "C" {
  pub fn xmlSearchNs(doc: xmlDocPtr, node: xmlNodePtr, nameSpace: *const xmlChar) -> xmlNsPtr;
}
extern "C" {
  pub fn xmlSearchNsByHref(doc: xmlDocPtr, node: xmlNodePtr, href: *const xmlChar) -> xmlNsPtr;
}
extern "C" {
  pub fn xmlGetNsList(doc: *const xmlDoc, node: *const xmlNode) -> *mut xmlNsPtr;
}
extern "C" {
  pub fn xmlSetNs(node: xmlNodePtr, ns: xmlNsPtr);
}
extern "C" {
  pub fn xmlCopyNamespace(cur: xmlNsPtr) -> xmlNsPtr;
}
extern "C" {
  pub fn xmlCopyNamespaceList(cur: xmlNsPtr) -> xmlNsPtr;
}
extern "C" {
  pub fn xmlSetProp(node: xmlNodePtr, name: *const xmlChar, value: *const xmlChar) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlSetNsProp(
    node: xmlNodePtr,
    ns: xmlNsPtr,
    name: *const xmlChar,
    value: *const xmlChar,
  ) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlGetNoNsProp(node: *const xmlNode, name: *const xmlChar) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlGetProp(node: *const xmlNode, name: *const xmlChar) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlHasProp(node: *const xmlNode, name: *const xmlChar) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlHasNsProp(
    node: *const xmlNode,
    name: *const xmlChar,
    nameSpace: *const xmlChar,
  ) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlGetNsProp(
    node: *const xmlNode,
    name: *const xmlChar,
    nameSpace: *const xmlChar,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlStringGetNodeList(doc: *const xmlDoc, value: *const xmlChar) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlStringLenGetNodeList(
    doc: *const xmlDoc,
    value: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlNodeListGetString(
    doc: xmlDocPtr,
    list: *const xmlNode,
    inLine: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlNodeListGetRawString(
    doc: *const xmlDoc,
    list: *const xmlNode,
    inLine: ::std::os::raw::c_int,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlNodeSetContent(cur: xmlNodePtr, content: *const xmlChar);
}
extern "C" {
  pub fn xmlNodeSetContentLen(cur: xmlNodePtr, content: *const xmlChar, len: ::std::os::raw::c_int);
}
extern "C" {
  pub fn xmlNodeAddContent(cur: xmlNodePtr, content: *const xmlChar);
}
extern "C" {
  pub fn xmlNodeAddContentLen(cur: xmlNodePtr, content: *const xmlChar, len: ::std::os::raw::c_int);
}
extern "C" {
  pub fn xmlNodeGetContent(cur: *const xmlNode) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlNodeBufGetContent(buffer: xmlBufferPtr, cur: *const xmlNode) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufGetNodeContent(buf: xmlBufPtr, cur: *const xmlNode) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlNodeGetLang(cur: *const xmlNode) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlNodeGetSpacePreserve(cur: *const xmlNode) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlNodeSetLang(cur: xmlNodePtr, lang: *const xmlChar);
}
extern "C" {
  pub fn xmlNodeSetSpacePreserve(cur: xmlNodePtr, val: ::std::os::raw::c_int);
}
extern "C" {
  pub fn xmlNodeGetBase(doc: *const xmlDoc, cur: *const xmlNode) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlNodeSetBase(cur: xmlNodePtr, uri: *const xmlChar);
}
extern "C" {
  pub fn xmlRemoveProp(cur: xmlAttrPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlUnsetNsProp(
    node: xmlNodePtr,
    ns: xmlNsPtr,
    name: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlUnsetProp(node: xmlNodePtr, name: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufferWriteCHAR(buf: xmlBufferPtr, string: *const xmlChar);
}
extern "C" {
  pub fn xmlBufferWriteChar(buf: xmlBufferPtr, string: *const ::std::os::raw::c_char);
}
extern "C" {
  pub fn xmlBufferWriteQuotedString(buf: xmlBufferPtr, string: *const xmlChar);
}
extern "C" {
  pub fn xmlAttrSerializeTxtContent(
    buf: xmlBufferPtr,
    doc: xmlDocPtr,
    attr: xmlAttrPtr,
    string: *const xmlChar,
  );
}
extern "C" {
  pub fn xmlReconciliateNs(doc: xmlDocPtr, tree: xmlNodePtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDocDumpFormatMemory(
    cur: xmlDocPtr,
    mem: *mut *mut xmlChar,
    size: *mut ::std::os::raw::c_int,
    format: ::std::os::raw::c_int,
  );
}
extern "C" {
  pub fn xmlDocDumpMemory(cur: xmlDocPtr, mem: *mut *mut xmlChar, size: *mut ::std::os::raw::c_int);
}
extern "C" {
  pub fn xmlDocDumpMemoryEnc(
    out_doc: xmlDocPtr,
    doc_txt_ptr: *mut *mut xmlChar,
    doc_txt_len: *mut ::std::os::raw::c_int,
    txt_encoding: *const ::std::os::raw::c_char,
  );
}
extern "C" {
  pub fn xmlDocDumpFormatMemoryEnc(
    out_doc: xmlDocPtr,
    doc_txt_ptr: *mut *mut xmlChar,
    doc_txt_len: *mut ::std::os::raw::c_int,
    txt_encoding: *const ::std::os::raw::c_char,
    format: ::std::os::raw::c_int,
  );
}
extern "C" {
  pub fn xmlDocFormatDump(
    f: *mut FILE,
    cur: xmlDocPtr,
    format: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDocDump(f: *mut FILE, cur: xmlDocPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlElemDump(f: *mut FILE, doc: xmlDocPtr, cur: xmlNodePtr);
}
extern "C" {
  pub fn xmlSaveFile(
    filename: *const ::std::os::raw::c_char,
    cur: xmlDocPtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlSaveFormatFile(
    filename: *const ::std::os::raw::c_char,
    cur: xmlDocPtr,
    format: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlBufNodeDump(
    buf: xmlBufPtr,
    doc: xmlDocPtr,
    cur: xmlNodePtr,
    level: ::std::os::raw::c_int,
    format: ::std::os::raw::c_int,
  ) -> usize;
}
extern "C" {
  pub fn xmlNodeDump(
    buf: xmlBufferPtr,
    doc: xmlDocPtr,
    cur: xmlNodePtr,
    level: ::std::os::raw::c_int,
    format: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlSaveFileTo(
    buf: xmlOutputBufferPtr,
    cur: xmlDocPtr,
    encoding: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlSaveFormatFileTo(
    buf: xmlOutputBufferPtr,
    cur: xmlDocPtr,
    encoding: *const ::std::os::raw::c_char,
    format: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlNodeDumpOutput(
    buf: xmlOutputBufferPtr,
    doc: xmlDocPtr,
    cur: xmlNodePtr,
    level: ::std::os::raw::c_int,
    format: ::std::os::raw::c_int,
    encoding: *const ::std::os::raw::c_char,
  );
}
extern "C" {
  pub fn xmlSaveFormatFileEnc(
    filename: *const ::std::os::raw::c_char,
    cur: xmlDocPtr,
    encoding: *const ::std::os::raw::c_char,
    format: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlSaveFileEnc(
    filename: *const ::std::os::raw::c_char,
    cur: xmlDocPtr,
    encoding: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlIsXHTML(systemID: *const xmlChar, publicID: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlGetDocCompressMode(doc: *const xmlDoc) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlSetDocCompressMode(doc: xmlDocPtr, mode: ::std::os::raw::c_int);
}
extern "C" {
  pub fn xmlGetCompressMode() -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlSetCompressMode(mode: ::std::os::raw::c_int);
}
extern "C" {
  pub fn xmlDOMWrapNewCtxt() -> xmlDOMWrapCtxtPtr;
}
extern "C" {
  pub fn xmlDOMWrapFreeCtxt(ctxt: xmlDOMWrapCtxtPtr);
}
extern "C" {
  pub fn xmlDOMWrapReconcileNamespaces(
    ctxt: xmlDOMWrapCtxtPtr,
    elem: xmlNodePtr,
    options: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDOMWrapAdoptNode(
    ctxt: xmlDOMWrapCtxtPtr,
    sourceDoc: xmlDocPtr,
    node: xmlNodePtr,
    destDoc: xmlDocPtr,
    destParent: xmlNodePtr,
    options: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDOMWrapRemoveNode(
    ctxt: xmlDOMWrapCtxtPtr,
    doc: xmlDocPtr,
    node: xmlNodePtr,
    options: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlDOMWrapCloneNode(
    ctxt: xmlDOMWrapCtxtPtr,
    sourceDoc: xmlDocPtr,
    node: xmlNodePtr,
    clonedNode: *mut xmlNodePtr,
    destDoc: xmlDocPtr,
    destParent: xmlNodePtr,
    deep: ::std::os::raw::c_int,
    options: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlChildElementCount(parent: xmlNodePtr) -> ::std::os::raw::c_ulong;
}
extern "C" {
  pub fn xmlNextElementSibling(node: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlFirstElementChild(parent: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlLastElementChild(parent: xmlNodePtr) -> xmlNodePtr;
}
extern "C" {
  pub fn xmlPreviousElementSibling(node: xmlNodePtr) -> xmlNodePtr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlHashTable {
  _unused: [u8; 0],
}
pub type xmlHashTable = _xmlHashTable;
pub type xmlHashTablePtr = *mut xmlHashTable;
/// xmlHashDeallocator:
/// @payload:  the data in the hash
/// @name:  the name associated
///
/// Callback to free data from a hash.
pub type xmlHashDeallocator = ::std::option::Option<
  unsafe extern "C" fn(payload: *mut ::std::os::raw::c_void, name: *mut xmlChar),
>;
/// xmlHashCopier:
/// @payload:  the data in the hash
/// @name:  the name associated
///
/// Callback to copy data from a hash.
///
/// Returns a copy of the data or NULL in case of error.
pub type xmlHashCopier = ::std::option::Option<
  unsafe extern "C" fn(payload: *mut ::std::os::raw::c_void, name: *mut xmlChar)
    -> *mut ::std::os::raw::c_void,
>;
/// xmlHashScanner:
/// @payload:  the data in the hash
/// @data:  extra scannner data
/// @name:  the name associated
///
/// Callback when scanning data in a hash with the simple scanner.
pub type xmlHashScanner = ::std::option::Option<
  unsafe extern "C" fn(
    payload: *mut ::std::os::raw::c_void,
    data: *mut ::std::os::raw::c_void,
    name: *mut xmlChar,
  ),
>;
/// xmlHashScannerFull:
/// @payload:  the data in the hash
/// @data:  extra scannner data
/// @name:  the name associated
/// @name2:  the second name associated
/// @name3:  the third name associated
///
/// Callback when scanning data in a hash with the full scanner.
pub type xmlHashScannerFull = ::std::option::Option<
  unsafe extern "C" fn(
    payload: *mut ::std::os::raw::c_void,
    data: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    name2: *const xmlChar,
    name3: *const xmlChar,
  ),
>;
extern "C" {
  pub fn xmlHashCreate(size: ::std::os::raw::c_int) -> xmlHashTablePtr;
}
extern "C" {
  pub fn xmlHashCreateDict(size: ::std::os::raw::c_int, dict: xmlDictPtr) -> xmlHashTablePtr;
}
extern "C" {
  pub fn xmlHashFree(table: xmlHashTablePtr, f: xmlHashDeallocator);
}
extern "C" {
  pub fn xmlHashAddEntry(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    userdata: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashUpdateEntry(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    userdata: *mut ::std::os::raw::c_void,
    f: xmlHashDeallocator,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashAddEntry2(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    userdata: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashUpdateEntry2(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    userdata: *mut ::std::os::raw::c_void,
    f: xmlHashDeallocator,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashAddEntry3(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    name3: *const xmlChar,
    userdata: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashUpdateEntry3(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    name3: *const xmlChar,
    userdata: *mut ::std::os::raw::c_void,
    f: xmlHashDeallocator,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashRemoveEntry(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    f: xmlHashDeallocator,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashRemoveEntry2(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    f: xmlHashDeallocator,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashRemoveEntry3(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    name3: *const xmlChar,
    f: xmlHashDeallocator,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashLookup(table: xmlHashTablePtr, name: *const xmlChar)
    -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlHashLookup2(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlHashLookup3(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    name3: *const xmlChar,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlHashQLookup(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    prefix: *const xmlChar,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlHashQLookup2(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    prefix: *const xmlChar,
    name2: *const xmlChar,
    prefix2: *const xmlChar,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlHashQLookup3(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    prefix: *const xmlChar,
    name2: *const xmlChar,
    prefix2: *const xmlChar,
    name3: *const xmlChar,
    prefix3: *const xmlChar,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlHashCopy(table: xmlHashTablePtr, f: xmlHashCopier) -> xmlHashTablePtr;
}
extern "C" {
  pub fn xmlHashSize(table: xmlHashTablePtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlHashScan(table: xmlHashTablePtr, f: xmlHashScanner, data: *mut ::std::os::raw::c_void);
}
extern "C" {
  pub fn xmlHashScan3(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    name3: *const xmlChar,
    f: xmlHashScanner,
    data: *mut ::std::os::raw::c_void,
  );
}
extern "C" {
  pub fn xmlHashScanFull(
    table: xmlHashTablePtr,
    f: xmlHashScannerFull,
    data: *mut ::std::os::raw::c_void,
  );
}
extern "C" {
  pub fn xmlHashScanFull3(
    table: xmlHashTablePtr,
    name: *const xmlChar,
    name2: *const xmlChar,
    name3: *const xmlChar,
    f: xmlHashScannerFull,
    data: *mut ::std::os::raw::c_void,
  );
}
pub const xmlErrorLevel_XML_ERR_NONE: xmlErrorLevel = 0;
pub const xmlErrorLevel_XML_ERR_WARNING: xmlErrorLevel = 1;
pub const xmlErrorLevel_XML_ERR_ERROR: xmlErrorLevel = 2;
pub const xmlErrorLevel_XML_ERR_FATAL: xmlErrorLevel = 3;
/// xmlErrorLevel:
///
/// Indicates the level of an error
pub type xmlErrorLevel = u32;
pub const xmlErrorDomain_XML_FROM_NONE: xmlErrorDomain = 0;
pub const xmlErrorDomain_XML_FROM_PARSER: xmlErrorDomain = 1;
pub const xmlErrorDomain_XML_FROM_TREE: xmlErrorDomain = 2;
pub const xmlErrorDomain_XML_FROM_NAMESPACE: xmlErrorDomain = 3;
pub const xmlErrorDomain_XML_FROM_DTD: xmlErrorDomain = 4;
pub const xmlErrorDomain_XML_FROM_HTML: xmlErrorDomain = 5;
pub const xmlErrorDomain_XML_FROM_MEMORY: xmlErrorDomain = 6;
pub const xmlErrorDomain_XML_FROM_OUTPUT: xmlErrorDomain = 7;
pub const xmlErrorDomain_XML_FROM_IO: xmlErrorDomain = 8;
pub const xmlErrorDomain_XML_FROM_FTP: xmlErrorDomain = 9;
pub const xmlErrorDomain_XML_FROM_HTTP: xmlErrorDomain = 10;
pub const xmlErrorDomain_XML_FROM_XINCLUDE: xmlErrorDomain = 11;
pub const xmlErrorDomain_XML_FROM_XPATH: xmlErrorDomain = 12;
pub const xmlErrorDomain_XML_FROM_XPOINTER: xmlErrorDomain = 13;
pub const xmlErrorDomain_XML_FROM_REGEXP: xmlErrorDomain = 14;
pub const xmlErrorDomain_XML_FROM_DATATYPE: xmlErrorDomain = 15;
pub const xmlErrorDomain_XML_FROM_SCHEMASP: xmlErrorDomain = 16;
pub const xmlErrorDomain_XML_FROM_SCHEMASV: xmlErrorDomain = 17;
pub const xmlErrorDomain_XML_FROM_RELAXNGP: xmlErrorDomain = 18;
pub const xmlErrorDomain_XML_FROM_RELAXNGV: xmlErrorDomain = 19;
pub const xmlErrorDomain_XML_FROM_CATALOG: xmlErrorDomain = 20;
pub const xmlErrorDomain_XML_FROM_C14N: xmlErrorDomain = 21;
pub const xmlErrorDomain_XML_FROM_XSLT: xmlErrorDomain = 22;
pub const xmlErrorDomain_XML_FROM_VALID: xmlErrorDomain = 23;
pub const xmlErrorDomain_XML_FROM_CHECK: xmlErrorDomain = 24;
pub const xmlErrorDomain_XML_FROM_WRITER: xmlErrorDomain = 25;
pub const xmlErrorDomain_XML_FROM_MODULE: xmlErrorDomain = 26;
pub const xmlErrorDomain_XML_FROM_I18N: xmlErrorDomain = 27;
pub const xmlErrorDomain_XML_FROM_SCHEMATRONV: xmlErrorDomain = 28;
pub const xmlErrorDomain_XML_FROM_BUFFER: xmlErrorDomain = 29;
pub const xmlErrorDomain_XML_FROM_URI: xmlErrorDomain = 30;
/// xmlErrorDomain:
///
/// Indicates where an error may have come from
pub type xmlErrorDomain = u32;
/// xmlError:
///
/// An XML Error instance.
pub type xmlError = _xmlError;
pub type xmlErrorPtr = *mut xmlError;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlError {
  pub domain: ::std::os::raw::c_int,
  pub code: ::std::os::raw::c_int,
  pub message: *mut ::std::os::raw::c_char,
  pub level: xmlErrorLevel,
  pub file: *mut ::std::os::raw::c_char,
  pub line: ::std::os::raw::c_int,
  pub str1: *mut ::std::os::raw::c_char,
  pub str2: *mut ::std::os::raw::c_char,
  pub str3: *mut ::std::os::raw::c_char,
  pub int1: ::std::os::raw::c_int,
  pub int2: ::std::os::raw::c_int,
  pub ctxt: *mut ::std::os::raw::c_void,
  pub node: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__xmlError() {
  assert_eq!(
    ::std::mem::size_of::<_xmlError>(),
    88usize,
    concat!("Size of: ", stringify!(_xmlError))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlError>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlError))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).domain as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(domain)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).code as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(code)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).message as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(message)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).level as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(level)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).file as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(file)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).line as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(line)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).str1 as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(str1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).str2 as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(str2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).str3 as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(str3)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).int1 as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(int1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).int2 as *const _ as usize },
    68usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(int2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).ctxt as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(ctxt)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlError>())).node as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlError),
      "::",
      stringify!(node)
    )
  );
}
pub const xmlParserErrors_XML_ERR_OK: xmlParserErrors = 0;
pub const xmlParserErrors_XML_ERR_INTERNAL_ERROR: xmlParserErrors = 1;
pub const xmlParserErrors_XML_ERR_NO_MEMORY: xmlParserErrors = 2;
pub const xmlParserErrors_XML_ERR_DOCUMENT_START: xmlParserErrors = 3;
pub const xmlParserErrors_XML_ERR_DOCUMENT_EMPTY: xmlParserErrors = 4;
pub const xmlParserErrors_XML_ERR_DOCUMENT_END: xmlParserErrors = 5;
pub const xmlParserErrors_XML_ERR_INVALID_HEX_CHARREF: xmlParserErrors = 6;
pub const xmlParserErrors_XML_ERR_INVALID_DEC_CHARREF: xmlParserErrors = 7;
pub const xmlParserErrors_XML_ERR_INVALID_CHARREF: xmlParserErrors = 8;
pub const xmlParserErrors_XML_ERR_INVALID_CHAR: xmlParserErrors = 9;
pub const xmlParserErrors_XML_ERR_CHARREF_AT_EOF: xmlParserErrors = 10;
pub const xmlParserErrors_XML_ERR_CHARREF_IN_PROLOG: xmlParserErrors = 11;
pub const xmlParserErrors_XML_ERR_CHARREF_IN_EPILOG: xmlParserErrors = 12;
pub const xmlParserErrors_XML_ERR_CHARREF_IN_DTD: xmlParserErrors = 13;
pub const xmlParserErrors_XML_ERR_ENTITYREF_AT_EOF: xmlParserErrors = 14;
pub const xmlParserErrors_XML_ERR_ENTITYREF_IN_PROLOG: xmlParserErrors = 15;
pub const xmlParserErrors_XML_ERR_ENTITYREF_IN_EPILOG: xmlParserErrors = 16;
pub const xmlParserErrors_XML_ERR_ENTITYREF_IN_DTD: xmlParserErrors = 17;
pub const xmlParserErrors_XML_ERR_PEREF_AT_EOF: xmlParserErrors = 18;
pub const xmlParserErrors_XML_ERR_PEREF_IN_PROLOG: xmlParserErrors = 19;
pub const xmlParserErrors_XML_ERR_PEREF_IN_EPILOG: xmlParserErrors = 20;
pub const xmlParserErrors_XML_ERR_PEREF_IN_INT_SUBSET: xmlParserErrors = 21;
pub const xmlParserErrors_XML_ERR_ENTITYREF_NO_NAME: xmlParserErrors = 22;
pub const xmlParserErrors_XML_ERR_ENTITYREF_SEMICOL_MISSING: xmlParserErrors = 23;
pub const xmlParserErrors_XML_ERR_PEREF_NO_NAME: xmlParserErrors = 24;
pub const xmlParserErrors_XML_ERR_PEREF_SEMICOL_MISSING: xmlParserErrors = 25;
pub const xmlParserErrors_XML_ERR_UNDECLARED_ENTITY: xmlParserErrors = 26;
pub const xmlParserErrors_XML_WAR_UNDECLARED_ENTITY: xmlParserErrors = 27;
pub const xmlParserErrors_XML_ERR_UNPARSED_ENTITY: xmlParserErrors = 28;
pub const xmlParserErrors_XML_ERR_ENTITY_IS_EXTERNAL: xmlParserErrors = 29;
pub const xmlParserErrors_XML_ERR_ENTITY_IS_PARAMETER: xmlParserErrors = 30;
pub const xmlParserErrors_XML_ERR_UNKNOWN_ENCODING: xmlParserErrors = 31;
pub const xmlParserErrors_XML_ERR_UNSUPPORTED_ENCODING: xmlParserErrors = 32;
pub const xmlParserErrors_XML_ERR_STRING_NOT_STARTED: xmlParserErrors = 33;
pub const xmlParserErrors_XML_ERR_STRING_NOT_CLOSED: xmlParserErrors = 34;
pub const xmlParserErrors_XML_ERR_NS_DECL_ERROR: xmlParserErrors = 35;
pub const xmlParserErrors_XML_ERR_ENTITY_NOT_STARTED: xmlParserErrors = 36;
pub const xmlParserErrors_XML_ERR_ENTITY_NOT_FINISHED: xmlParserErrors = 37;
pub const xmlParserErrors_XML_ERR_LT_IN_ATTRIBUTE: xmlParserErrors = 38;
pub const xmlParserErrors_XML_ERR_ATTRIBUTE_NOT_STARTED: xmlParserErrors = 39;
pub const xmlParserErrors_XML_ERR_ATTRIBUTE_NOT_FINISHED: xmlParserErrors = 40;
pub const xmlParserErrors_XML_ERR_ATTRIBUTE_WITHOUT_VALUE: xmlParserErrors = 41;
pub const xmlParserErrors_XML_ERR_ATTRIBUTE_REDEFINED: xmlParserErrors = 42;
pub const xmlParserErrors_XML_ERR_LITERAL_NOT_STARTED: xmlParserErrors = 43;
pub const xmlParserErrors_XML_ERR_LITERAL_NOT_FINISHED: xmlParserErrors = 44;
pub const xmlParserErrors_XML_ERR_COMMENT_NOT_FINISHED: xmlParserErrors = 45;
pub const xmlParserErrors_XML_ERR_PI_NOT_STARTED: xmlParserErrors = 46;
pub const xmlParserErrors_XML_ERR_PI_NOT_FINISHED: xmlParserErrors = 47;
pub const xmlParserErrors_XML_ERR_NOTATION_NOT_STARTED: xmlParserErrors = 48;
pub const xmlParserErrors_XML_ERR_NOTATION_NOT_FINISHED: xmlParserErrors = 49;
pub const xmlParserErrors_XML_ERR_ATTLIST_NOT_STARTED: xmlParserErrors = 50;
pub const xmlParserErrors_XML_ERR_ATTLIST_NOT_FINISHED: xmlParserErrors = 51;
pub const xmlParserErrors_XML_ERR_MIXED_NOT_STARTED: xmlParserErrors = 52;
pub const xmlParserErrors_XML_ERR_MIXED_NOT_FINISHED: xmlParserErrors = 53;
pub const xmlParserErrors_XML_ERR_ELEMCONTENT_NOT_STARTED: xmlParserErrors = 54;
pub const xmlParserErrors_XML_ERR_ELEMCONTENT_NOT_FINISHED: xmlParserErrors = 55;
pub const xmlParserErrors_XML_ERR_XMLDECL_NOT_STARTED: xmlParserErrors = 56;
pub const xmlParserErrors_XML_ERR_XMLDECL_NOT_FINISHED: xmlParserErrors = 57;
pub const xmlParserErrors_XML_ERR_CONDSEC_NOT_STARTED: xmlParserErrors = 58;
pub const xmlParserErrors_XML_ERR_CONDSEC_NOT_FINISHED: xmlParserErrors = 59;
pub const xmlParserErrors_XML_ERR_EXT_SUBSET_NOT_FINISHED: xmlParserErrors = 60;
pub const xmlParserErrors_XML_ERR_DOCTYPE_NOT_FINISHED: xmlParserErrors = 61;
pub const xmlParserErrors_XML_ERR_MISPLACED_CDATA_END: xmlParserErrors = 62;
pub const xmlParserErrors_XML_ERR_CDATA_NOT_FINISHED: xmlParserErrors = 63;
pub const xmlParserErrors_XML_ERR_RESERVED_XML_NAME: xmlParserErrors = 64;
pub const xmlParserErrors_XML_ERR_SPACE_REQUIRED: xmlParserErrors = 65;
pub const xmlParserErrors_XML_ERR_SEPARATOR_REQUIRED: xmlParserErrors = 66;
pub const xmlParserErrors_XML_ERR_NMTOKEN_REQUIRED: xmlParserErrors = 67;
pub const xmlParserErrors_XML_ERR_NAME_REQUIRED: xmlParserErrors = 68;
pub const xmlParserErrors_XML_ERR_PCDATA_REQUIRED: xmlParserErrors = 69;
pub const xmlParserErrors_XML_ERR_URI_REQUIRED: xmlParserErrors = 70;
pub const xmlParserErrors_XML_ERR_PUBID_REQUIRED: xmlParserErrors = 71;
pub const xmlParserErrors_XML_ERR_LT_REQUIRED: xmlParserErrors = 72;
pub const xmlParserErrors_XML_ERR_GT_REQUIRED: xmlParserErrors = 73;
pub const xmlParserErrors_XML_ERR_LTSLASH_REQUIRED: xmlParserErrors = 74;
pub const xmlParserErrors_XML_ERR_EQUAL_REQUIRED: xmlParserErrors = 75;
pub const xmlParserErrors_XML_ERR_TAG_NAME_MISMATCH: xmlParserErrors = 76;
pub const xmlParserErrors_XML_ERR_TAG_NOT_FINISHED: xmlParserErrors = 77;
pub const xmlParserErrors_XML_ERR_STANDALONE_VALUE: xmlParserErrors = 78;
pub const xmlParserErrors_XML_ERR_ENCODING_NAME: xmlParserErrors = 79;
pub const xmlParserErrors_XML_ERR_HYPHEN_IN_COMMENT: xmlParserErrors = 80;
pub const xmlParserErrors_XML_ERR_INVALID_ENCODING: xmlParserErrors = 81;
pub const xmlParserErrors_XML_ERR_EXT_ENTITY_STANDALONE: xmlParserErrors = 82;
pub const xmlParserErrors_XML_ERR_CONDSEC_INVALID: xmlParserErrors = 83;
pub const xmlParserErrors_XML_ERR_VALUE_REQUIRED: xmlParserErrors = 84;
pub const xmlParserErrors_XML_ERR_NOT_WELL_BALANCED: xmlParserErrors = 85;
pub const xmlParserErrors_XML_ERR_EXTRA_CONTENT: xmlParserErrors = 86;
pub const xmlParserErrors_XML_ERR_ENTITY_CHAR_ERROR: xmlParserErrors = 87;
pub const xmlParserErrors_XML_ERR_ENTITY_PE_INTERNAL: xmlParserErrors = 88;
pub const xmlParserErrors_XML_ERR_ENTITY_LOOP: xmlParserErrors = 89;
pub const xmlParserErrors_XML_ERR_ENTITY_BOUNDARY: xmlParserErrors = 90;
pub const xmlParserErrors_XML_ERR_INVALID_URI: xmlParserErrors = 91;
pub const xmlParserErrors_XML_ERR_URI_FRAGMENT: xmlParserErrors = 92;
pub const xmlParserErrors_XML_WAR_CATALOG_PI: xmlParserErrors = 93;
pub const xmlParserErrors_XML_ERR_NO_DTD: xmlParserErrors = 94;
pub const xmlParserErrors_XML_ERR_CONDSEC_INVALID_KEYWORD: xmlParserErrors = 95;
pub const xmlParserErrors_XML_ERR_VERSION_MISSING: xmlParserErrors = 96;
pub const xmlParserErrors_XML_WAR_UNKNOWN_VERSION: xmlParserErrors = 97;
pub const xmlParserErrors_XML_WAR_LANG_VALUE: xmlParserErrors = 98;
pub const xmlParserErrors_XML_WAR_NS_URI: xmlParserErrors = 99;
pub const xmlParserErrors_XML_WAR_NS_URI_RELATIVE: xmlParserErrors = 100;
pub const xmlParserErrors_XML_ERR_MISSING_ENCODING: xmlParserErrors = 101;
pub const xmlParserErrors_XML_WAR_SPACE_VALUE: xmlParserErrors = 102;
pub const xmlParserErrors_XML_ERR_NOT_STANDALONE: xmlParserErrors = 103;
pub const xmlParserErrors_XML_ERR_ENTITY_PROCESSING: xmlParserErrors = 104;
pub const xmlParserErrors_XML_ERR_NOTATION_PROCESSING: xmlParserErrors = 105;
pub const xmlParserErrors_XML_WAR_NS_COLUMN: xmlParserErrors = 106;
pub const xmlParserErrors_XML_WAR_ENTITY_REDEFINED: xmlParserErrors = 107;
pub const xmlParserErrors_XML_ERR_UNKNOWN_VERSION: xmlParserErrors = 108;
pub const xmlParserErrors_XML_ERR_VERSION_MISMATCH: xmlParserErrors = 109;
pub const xmlParserErrors_XML_ERR_NAME_TOO_LONG: xmlParserErrors = 110;
pub const xmlParserErrors_XML_ERR_USER_STOP: xmlParserErrors = 111;
pub const xmlParserErrors_XML_NS_ERR_XML_NAMESPACE: xmlParserErrors = 200;
pub const xmlParserErrors_XML_NS_ERR_UNDEFINED_NAMESPACE: xmlParserErrors = 201;
pub const xmlParserErrors_XML_NS_ERR_QNAME: xmlParserErrors = 202;
pub const xmlParserErrors_XML_NS_ERR_ATTRIBUTE_REDEFINED: xmlParserErrors = 203;
pub const xmlParserErrors_XML_NS_ERR_EMPTY: xmlParserErrors = 204;
pub const xmlParserErrors_XML_NS_ERR_COLON: xmlParserErrors = 205;
pub const xmlParserErrors_XML_DTD_ATTRIBUTE_DEFAULT: xmlParserErrors = 500;
pub const xmlParserErrors_XML_DTD_ATTRIBUTE_REDEFINED: xmlParserErrors = 501;
pub const xmlParserErrors_XML_DTD_ATTRIBUTE_VALUE: xmlParserErrors = 502;
pub const xmlParserErrors_XML_DTD_CONTENT_ERROR: xmlParserErrors = 503;
pub const xmlParserErrors_XML_DTD_CONTENT_MODEL: xmlParserErrors = 504;
pub const xmlParserErrors_XML_DTD_CONTENT_NOT_DETERMINIST: xmlParserErrors = 505;
pub const xmlParserErrors_XML_DTD_DIFFERENT_PREFIX: xmlParserErrors = 506;
pub const xmlParserErrors_XML_DTD_ELEM_DEFAULT_NAMESPACE: xmlParserErrors = 507;
pub const xmlParserErrors_XML_DTD_ELEM_NAMESPACE: xmlParserErrors = 508;
pub const xmlParserErrors_XML_DTD_ELEM_REDEFINED: xmlParserErrors = 509;
pub const xmlParserErrors_XML_DTD_EMPTY_NOTATION: xmlParserErrors = 510;
pub const xmlParserErrors_XML_DTD_ENTITY_TYPE: xmlParserErrors = 511;
pub const xmlParserErrors_XML_DTD_ID_FIXED: xmlParserErrors = 512;
pub const xmlParserErrors_XML_DTD_ID_REDEFINED: xmlParserErrors = 513;
pub const xmlParserErrors_XML_DTD_ID_SUBSET: xmlParserErrors = 514;
pub const xmlParserErrors_XML_DTD_INVALID_CHILD: xmlParserErrors = 515;
pub const xmlParserErrors_XML_DTD_INVALID_DEFAULT: xmlParserErrors = 516;
pub const xmlParserErrors_XML_DTD_LOAD_ERROR: xmlParserErrors = 517;
pub const xmlParserErrors_XML_DTD_MISSING_ATTRIBUTE: xmlParserErrors = 518;
pub const xmlParserErrors_XML_DTD_MIXED_CORRUPT: xmlParserErrors = 519;
pub const xmlParserErrors_XML_DTD_MULTIPLE_ID: xmlParserErrors = 520;
pub const xmlParserErrors_XML_DTD_NO_DOC: xmlParserErrors = 521;
pub const xmlParserErrors_XML_DTD_NO_DTD: xmlParserErrors = 522;
pub const xmlParserErrors_XML_DTD_NO_ELEM_NAME: xmlParserErrors = 523;
pub const xmlParserErrors_XML_DTD_NO_PREFIX: xmlParserErrors = 524;
pub const xmlParserErrors_XML_DTD_NO_ROOT: xmlParserErrors = 525;
pub const xmlParserErrors_XML_DTD_NOTATION_REDEFINED: xmlParserErrors = 526;
pub const xmlParserErrors_XML_DTD_NOTATION_VALUE: xmlParserErrors = 527;
pub const xmlParserErrors_XML_DTD_NOT_EMPTY: xmlParserErrors = 528;
pub const xmlParserErrors_XML_DTD_NOT_PCDATA: xmlParserErrors = 529;
pub const xmlParserErrors_XML_DTD_NOT_STANDALONE: xmlParserErrors = 530;
pub const xmlParserErrors_XML_DTD_ROOT_NAME: xmlParserErrors = 531;
pub const xmlParserErrors_XML_DTD_STANDALONE_WHITE_SPACE: xmlParserErrors = 532;
pub const xmlParserErrors_XML_DTD_UNKNOWN_ATTRIBUTE: xmlParserErrors = 533;
pub const xmlParserErrors_XML_DTD_UNKNOWN_ELEM: xmlParserErrors = 534;
pub const xmlParserErrors_XML_DTD_UNKNOWN_ENTITY: xmlParserErrors = 535;
pub const xmlParserErrors_XML_DTD_UNKNOWN_ID: xmlParserErrors = 536;
pub const xmlParserErrors_XML_DTD_UNKNOWN_NOTATION: xmlParserErrors = 537;
pub const xmlParserErrors_XML_DTD_STANDALONE_DEFAULTED: xmlParserErrors = 538;
pub const xmlParserErrors_XML_DTD_XMLID_VALUE: xmlParserErrors = 539;
pub const xmlParserErrors_XML_DTD_XMLID_TYPE: xmlParserErrors = 540;
pub const xmlParserErrors_XML_DTD_DUP_TOKEN: xmlParserErrors = 541;
pub const xmlParserErrors_XML_HTML_STRUCURE_ERROR: xmlParserErrors = 800;
pub const xmlParserErrors_XML_HTML_UNKNOWN_TAG: xmlParserErrors = 801;
pub const xmlParserErrors_XML_RNGP_ANYNAME_ATTR_ANCESTOR: xmlParserErrors = 1000;
pub const xmlParserErrors_XML_RNGP_ATTR_CONFLICT: xmlParserErrors = 1001;
pub const xmlParserErrors_XML_RNGP_ATTRIBUTE_CHILDREN: xmlParserErrors = 1002;
pub const xmlParserErrors_XML_RNGP_ATTRIBUTE_CONTENT: xmlParserErrors = 1003;
pub const xmlParserErrors_XML_RNGP_ATTRIBUTE_EMPTY: xmlParserErrors = 1004;
pub const xmlParserErrors_XML_RNGP_ATTRIBUTE_NOOP: xmlParserErrors = 1005;
pub const xmlParserErrors_XML_RNGP_CHOICE_CONTENT: xmlParserErrors = 1006;
pub const xmlParserErrors_XML_RNGP_CHOICE_EMPTY: xmlParserErrors = 1007;
pub const xmlParserErrors_XML_RNGP_CREATE_FAILURE: xmlParserErrors = 1008;
pub const xmlParserErrors_XML_RNGP_DATA_CONTENT: xmlParserErrors = 1009;
pub const xmlParserErrors_XML_RNGP_DEF_CHOICE_AND_INTERLEAVE: xmlParserErrors = 1010;
pub const xmlParserErrors_XML_RNGP_DEFINE_CREATE_FAILED: xmlParserErrors = 1011;
pub const xmlParserErrors_XML_RNGP_DEFINE_EMPTY: xmlParserErrors = 1012;
pub const xmlParserErrors_XML_RNGP_DEFINE_MISSING: xmlParserErrors = 1013;
pub const xmlParserErrors_XML_RNGP_DEFINE_NAME_MISSING: xmlParserErrors = 1014;
pub const xmlParserErrors_XML_RNGP_ELEM_CONTENT_EMPTY: xmlParserErrors = 1015;
pub const xmlParserErrors_XML_RNGP_ELEM_CONTENT_ERROR: xmlParserErrors = 1016;
pub const xmlParserErrors_XML_RNGP_ELEMENT_EMPTY: xmlParserErrors = 1017;
pub const xmlParserErrors_XML_RNGP_ELEMENT_CONTENT: xmlParserErrors = 1018;
pub const xmlParserErrors_XML_RNGP_ELEMENT_NAME: xmlParserErrors = 1019;
pub const xmlParserErrors_XML_RNGP_ELEMENT_NO_CONTENT: xmlParserErrors = 1020;
pub const xmlParserErrors_XML_RNGP_ELEM_TEXT_CONFLICT: xmlParserErrors = 1021;
pub const xmlParserErrors_XML_RNGP_EMPTY: xmlParserErrors = 1022;
pub const xmlParserErrors_XML_RNGP_EMPTY_CONSTRUCT: xmlParserErrors = 1023;
pub const xmlParserErrors_XML_RNGP_EMPTY_CONTENT: xmlParserErrors = 1024;
pub const xmlParserErrors_XML_RNGP_EMPTY_NOT_EMPTY: xmlParserErrors = 1025;
pub const xmlParserErrors_XML_RNGP_ERROR_TYPE_LIB: xmlParserErrors = 1026;
pub const xmlParserErrors_XML_RNGP_EXCEPT_EMPTY: xmlParserErrors = 1027;
pub const xmlParserErrors_XML_RNGP_EXCEPT_MISSING: xmlParserErrors = 1028;
pub const xmlParserErrors_XML_RNGP_EXCEPT_MULTIPLE: xmlParserErrors = 1029;
pub const xmlParserErrors_XML_RNGP_EXCEPT_NO_CONTENT: xmlParserErrors = 1030;
pub const xmlParserErrors_XML_RNGP_EXTERNALREF_EMTPY: xmlParserErrors = 1031;
pub const xmlParserErrors_XML_RNGP_EXTERNAL_REF_FAILURE: xmlParserErrors = 1032;
pub const xmlParserErrors_XML_RNGP_EXTERNALREF_RECURSE: xmlParserErrors = 1033;
pub const xmlParserErrors_XML_RNGP_FORBIDDEN_ATTRIBUTE: xmlParserErrors = 1034;
pub const xmlParserErrors_XML_RNGP_FOREIGN_ELEMENT: xmlParserErrors = 1035;
pub const xmlParserErrors_XML_RNGP_GRAMMAR_CONTENT: xmlParserErrors = 1036;
pub const xmlParserErrors_XML_RNGP_GRAMMAR_EMPTY: xmlParserErrors = 1037;
pub const xmlParserErrors_XML_RNGP_GRAMMAR_MISSING: xmlParserErrors = 1038;
pub const xmlParserErrors_XML_RNGP_GRAMMAR_NO_START: xmlParserErrors = 1039;
pub const xmlParserErrors_XML_RNGP_GROUP_ATTR_CONFLICT: xmlParserErrors = 1040;
pub const xmlParserErrors_XML_RNGP_HREF_ERROR: xmlParserErrors = 1041;
pub const xmlParserErrors_XML_RNGP_INCLUDE_EMPTY: xmlParserErrors = 1042;
pub const xmlParserErrors_XML_RNGP_INCLUDE_FAILURE: xmlParserErrors = 1043;
pub const xmlParserErrors_XML_RNGP_INCLUDE_RECURSE: xmlParserErrors = 1044;
pub const xmlParserErrors_XML_RNGP_INTERLEAVE_ADD: xmlParserErrors = 1045;
pub const xmlParserErrors_XML_RNGP_INTERLEAVE_CREATE_FAILED: xmlParserErrors = 1046;
pub const xmlParserErrors_XML_RNGP_INTERLEAVE_EMPTY: xmlParserErrors = 1047;
pub const xmlParserErrors_XML_RNGP_INTERLEAVE_NO_CONTENT: xmlParserErrors = 1048;
pub const xmlParserErrors_XML_RNGP_INVALID_DEFINE_NAME: xmlParserErrors = 1049;
pub const xmlParserErrors_XML_RNGP_INVALID_URI: xmlParserErrors = 1050;
pub const xmlParserErrors_XML_RNGP_INVALID_VALUE: xmlParserErrors = 1051;
pub const xmlParserErrors_XML_RNGP_MISSING_HREF: xmlParserErrors = 1052;
pub const xmlParserErrors_XML_RNGP_NAME_MISSING: xmlParserErrors = 1053;
pub const xmlParserErrors_XML_RNGP_NEED_COMBINE: xmlParserErrors = 1054;
pub const xmlParserErrors_XML_RNGP_NOTALLOWED_NOT_EMPTY: xmlParserErrors = 1055;
pub const xmlParserErrors_XML_RNGP_NSNAME_ATTR_ANCESTOR: xmlParserErrors = 1056;
pub const xmlParserErrors_XML_RNGP_NSNAME_NO_NS: xmlParserErrors = 1057;
pub const xmlParserErrors_XML_RNGP_PARAM_FORBIDDEN: xmlParserErrors = 1058;
pub const xmlParserErrors_XML_RNGP_PARAM_NAME_MISSING: xmlParserErrors = 1059;
pub const xmlParserErrors_XML_RNGP_PARENTREF_CREATE_FAILED: xmlParserErrors = 1060;
pub const xmlParserErrors_XML_RNGP_PARENTREF_NAME_INVALID: xmlParserErrors = 1061;
pub const xmlParserErrors_XML_RNGP_PARENTREF_NO_NAME: xmlParserErrors = 1062;
pub const xmlParserErrors_XML_RNGP_PARENTREF_NO_PARENT: xmlParserErrors = 1063;
pub const xmlParserErrors_XML_RNGP_PARENTREF_NOT_EMPTY: xmlParserErrors = 1064;
pub const xmlParserErrors_XML_RNGP_PARSE_ERROR: xmlParserErrors = 1065;
pub const xmlParserErrors_XML_RNGP_PAT_ANYNAME_EXCEPT_ANYNAME: xmlParserErrors = 1066;
pub const xmlParserErrors_XML_RNGP_PAT_ATTR_ATTR: xmlParserErrors = 1067;
pub const xmlParserErrors_XML_RNGP_PAT_ATTR_ELEM: xmlParserErrors = 1068;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_ATTR: xmlParserErrors = 1069;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_ELEM: xmlParserErrors = 1070;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_EMPTY: xmlParserErrors = 1071;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_GROUP: xmlParserErrors = 1072;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_INTERLEAVE: xmlParserErrors = 1073;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_LIST: xmlParserErrors = 1074;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_ONEMORE: xmlParserErrors = 1075;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_REF: xmlParserErrors = 1076;
pub const xmlParserErrors_XML_RNGP_PAT_DATA_EXCEPT_TEXT: xmlParserErrors = 1077;
pub const xmlParserErrors_XML_RNGP_PAT_LIST_ATTR: xmlParserErrors = 1078;
pub const xmlParserErrors_XML_RNGP_PAT_LIST_ELEM: xmlParserErrors = 1079;
pub const xmlParserErrors_XML_RNGP_PAT_LIST_INTERLEAVE: xmlParserErrors = 1080;
pub const xmlParserErrors_XML_RNGP_PAT_LIST_LIST: xmlParserErrors = 1081;
pub const xmlParserErrors_XML_RNGP_PAT_LIST_REF: xmlParserErrors = 1082;
pub const xmlParserErrors_XML_RNGP_PAT_LIST_TEXT: xmlParserErrors = 1083;
pub const xmlParserErrors_XML_RNGP_PAT_NSNAME_EXCEPT_ANYNAME: xmlParserErrors = 1084;
pub const xmlParserErrors_XML_RNGP_PAT_NSNAME_EXCEPT_NSNAME: xmlParserErrors = 1085;
pub const xmlParserErrors_XML_RNGP_PAT_ONEMORE_GROUP_ATTR: xmlParserErrors = 1086;
pub const xmlParserErrors_XML_RNGP_PAT_ONEMORE_INTERLEAVE_ATTR: xmlParserErrors = 1087;
pub const xmlParserErrors_XML_RNGP_PAT_START_ATTR: xmlParserErrors = 1088;
pub const xmlParserErrors_XML_RNGP_PAT_START_DATA: xmlParserErrors = 1089;
pub const xmlParserErrors_XML_RNGP_PAT_START_EMPTY: xmlParserErrors = 1090;
pub const xmlParserErrors_XML_RNGP_PAT_START_GROUP: xmlParserErrors = 1091;
pub const xmlParserErrors_XML_RNGP_PAT_START_INTERLEAVE: xmlParserErrors = 1092;
pub const xmlParserErrors_XML_RNGP_PAT_START_LIST: xmlParserErrors = 1093;
pub const xmlParserErrors_XML_RNGP_PAT_START_ONEMORE: xmlParserErrors = 1094;
pub const xmlParserErrors_XML_RNGP_PAT_START_TEXT: xmlParserErrors = 1095;
pub const xmlParserErrors_XML_RNGP_PAT_START_VALUE: xmlParserErrors = 1096;
pub const xmlParserErrors_XML_RNGP_PREFIX_UNDEFINED: xmlParserErrors = 1097;
pub const xmlParserErrors_XML_RNGP_REF_CREATE_FAILED: xmlParserErrors = 1098;
pub const xmlParserErrors_XML_RNGP_REF_CYCLE: xmlParserErrors = 1099;
pub const xmlParserErrors_XML_RNGP_REF_NAME_INVALID: xmlParserErrors = 1100;
pub const xmlParserErrors_XML_RNGP_REF_NO_DEF: xmlParserErrors = 1101;
pub const xmlParserErrors_XML_RNGP_REF_NO_NAME: xmlParserErrors = 1102;
pub const xmlParserErrors_XML_RNGP_REF_NOT_EMPTY: xmlParserErrors = 1103;
pub const xmlParserErrors_XML_RNGP_START_CHOICE_AND_INTERLEAVE: xmlParserErrors = 1104;
pub const xmlParserErrors_XML_RNGP_START_CONTENT: xmlParserErrors = 1105;
pub const xmlParserErrors_XML_RNGP_START_EMPTY: xmlParserErrors = 1106;
pub const xmlParserErrors_XML_RNGP_START_MISSING: xmlParserErrors = 1107;
pub const xmlParserErrors_XML_RNGP_TEXT_EXPECTED: xmlParserErrors = 1108;
pub const xmlParserErrors_XML_RNGP_TEXT_HAS_CHILD: xmlParserErrors = 1109;
pub const xmlParserErrors_XML_RNGP_TYPE_MISSING: xmlParserErrors = 1110;
pub const xmlParserErrors_XML_RNGP_TYPE_NOT_FOUND: xmlParserErrors = 1111;
pub const xmlParserErrors_XML_RNGP_TYPE_VALUE: xmlParserErrors = 1112;
pub const xmlParserErrors_XML_RNGP_UNKNOWN_ATTRIBUTE: xmlParserErrors = 1113;
pub const xmlParserErrors_XML_RNGP_UNKNOWN_COMBINE: xmlParserErrors = 1114;
pub const xmlParserErrors_XML_RNGP_UNKNOWN_CONSTRUCT: xmlParserErrors = 1115;
pub const xmlParserErrors_XML_RNGP_UNKNOWN_TYPE_LIB: xmlParserErrors = 1116;
pub const xmlParserErrors_XML_RNGP_URI_FRAGMENT: xmlParserErrors = 1117;
pub const xmlParserErrors_XML_RNGP_URI_NOT_ABSOLUTE: xmlParserErrors = 1118;
pub const xmlParserErrors_XML_RNGP_VALUE_EMPTY: xmlParserErrors = 1119;
pub const xmlParserErrors_XML_RNGP_VALUE_NO_CONTENT: xmlParserErrors = 1120;
pub const xmlParserErrors_XML_RNGP_XMLNS_NAME: xmlParserErrors = 1121;
pub const xmlParserErrors_XML_RNGP_XML_NS: xmlParserErrors = 1122;
pub const xmlParserErrors_XML_XPATH_EXPRESSION_OK: xmlParserErrors = 1200;
pub const xmlParserErrors_XML_XPATH_NUMBER_ERROR: xmlParserErrors = 1201;
pub const xmlParserErrors_XML_XPATH_UNFINISHED_LITERAL_ERROR: xmlParserErrors = 1202;
pub const xmlParserErrors_XML_XPATH_START_LITERAL_ERROR: xmlParserErrors = 1203;
pub const xmlParserErrors_XML_XPATH_VARIABLE_REF_ERROR: xmlParserErrors = 1204;
pub const xmlParserErrors_XML_XPATH_UNDEF_VARIABLE_ERROR: xmlParserErrors = 1205;
pub const xmlParserErrors_XML_XPATH_INVALID_PREDICATE_ERROR: xmlParserErrors = 1206;
pub const xmlParserErrors_XML_XPATH_EXPR_ERROR: xmlParserErrors = 1207;
pub const xmlParserErrors_XML_XPATH_UNCLOSED_ERROR: xmlParserErrors = 1208;
pub const xmlParserErrors_XML_XPATH_UNKNOWN_FUNC_ERROR: xmlParserErrors = 1209;
pub const xmlParserErrors_XML_XPATH_INVALID_OPERAND: xmlParserErrors = 1210;
pub const xmlParserErrors_XML_XPATH_INVALID_TYPE: xmlParserErrors = 1211;
pub const xmlParserErrors_XML_XPATH_INVALID_ARITY: xmlParserErrors = 1212;
pub const xmlParserErrors_XML_XPATH_INVALID_CTXT_SIZE: xmlParserErrors = 1213;
pub const xmlParserErrors_XML_XPATH_INVALID_CTXT_POSITION: xmlParserErrors = 1214;
pub const xmlParserErrors_XML_XPATH_MEMORY_ERROR: xmlParserErrors = 1215;
pub const xmlParserErrors_XML_XPTR_SYNTAX_ERROR: xmlParserErrors = 1216;
pub const xmlParserErrors_XML_XPTR_RESOURCE_ERROR: xmlParserErrors = 1217;
pub const xmlParserErrors_XML_XPTR_SUB_RESOURCE_ERROR: xmlParserErrors = 1218;
pub const xmlParserErrors_XML_XPATH_UNDEF_PREFIX_ERROR: xmlParserErrors = 1219;
pub const xmlParserErrors_XML_XPATH_ENCODING_ERROR: xmlParserErrors = 1220;
pub const xmlParserErrors_XML_XPATH_INVALID_CHAR_ERROR: xmlParserErrors = 1221;
pub const xmlParserErrors_XML_TREE_INVALID_HEX: xmlParserErrors = 1300;
pub const xmlParserErrors_XML_TREE_INVALID_DEC: xmlParserErrors = 1301;
pub const xmlParserErrors_XML_TREE_UNTERMINATED_ENTITY: xmlParserErrors = 1302;
pub const xmlParserErrors_XML_TREE_NOT_UTF8: xmlParserErrors = 1303;
pub const xmlParserErrors_XML_SAVE_NOT_UTF8: xmlParserErrors = 1400;
pub const xmlParserErrors_XML_SAVE_CHAR_INVALID: xmlParserErrors = 1401;
pub const xmlParserErrors_XML_SAVE_NO_DOCTYPE: xmlParserErrors = 1402;
pub const xmlParserErrors_XML_SAVE_UNKNOWN_ENCODING: xmlParserErrors = 1403;
pub const xmlParserErrors_XML_REGEXP_COMPILE_ERROR: xmlParserErrors = 1450;
pub const xmlParserErrors_XML_IO_UNKNOWN: xmlParserErrors = 1500;
pub const xmlParserErrors_XML_IO_EACCES: xmlParserErrors = 1501;
pub const xmlParserErrors_XML_IO_EAGAIN: xmlParserErrors = 1502;
pub const xmlParserErrors_XML_IO_EBADF: xmlParserErrors = 1503;
pub const xmlParserErrors_XML_IO_EBADMSG: xmlParserErrors = 1504;
pub const xmlParserErrors_XML_IO_EBUSY: xmlParserErrors = 1505;
pub const xmlParserErrors_XML_IO_ECANCELED: xmlParserErrors = 1506;
pub const xmlParserErrors_XML_IO_ECHILD: xmlParserErrors = 1507;
pub const xmlParserErrors_XML_IO_EDEADLK: xmlParserErrors = 1508;
pub const xmlParserErrors_XML_IO_EDOM: xmlParserErrors = 1509;
pub const xmlParserErrors_XML_IO_EEXIST: xmlParserErrors = 1510;
pub const xmlParserErrors_XML_IO_EFAULT: xmlParserErrors = 1511;
pub const xmlParserErrors_XML_IO_EFBIG: xmlParserErrors = 1512;
pub const xmlParserErrors_XML_IO_EINPROGRESS: xmlParserErrors = 1513;
pub const xmlParserErrors_XML_IO_EINTR: xmlParserErrors = 1514;
pub const xmlParserErrors_XML_IO_EINVAL: xmlParserErrors = 1515;
pub const xmlParserErrors_XML_IO_EIO: xmlParserErrors = 1516;
pub const xmlParserErrors_XML_IO_EISDIR: xmlParserErrors = 1517;
pub const xmlParserErrors_XML_IO_EMFILE: xmlParserErrors = 1518;
pub const xmlParserErrors_XML_IO_EMLINK: xmlParserErrors = 1519;
pub const xmlParserErrors_XML_IO_EMSGSIZE: xmlParserErrors = 1520;
pub const xmlParserErrors_XML_IO_ENAMETOOLONG: xmlParserErrors = 1521;
pub const xmlParserErrors_XML_IO_ENFILE: xmlParserErrors = 1522;
pub const xmlParserErrors_XML_IO_ENODEV: xmlParserErrors = 1523;
pub const xmlParserErrors_XML_IO_ENOENT: xmlParserErrors = 1524;
pub const xmlParserErrors_XML_IO_ENOEXEC: xmlParserErrors = 1525;
pub const xmlParserErrors_XML_IO_ENOLCK: xmlParserErrors = 1526;
pub const xmlParserErrors_XML_IO_ENOMEM: xmlParserErrors = 1527;
pub const xmlParserErrors_XML_IO_ENOSPC: xmlParserErrors = 1528;
pub const xmlParserErrors_XML_IO_ENOSYS: xmlParserErrors = 1529;
pub const xmlParserErrors_XML_IO_ENOTDIR: xmlParserErrors = 1530;
pub const xmlParserErrors_XML_IO_ENOTEMPTY: xmlParserErrors = 1531;
pub const xmlParserErrors_XML_IO_ENOTSUP: xmlParserErrors = 1532;
pub const xmlParserErrors_XML_IO_ENOTTY: xmlParserErrors = 1533;
pub const xmlParserErrors_XML_IO_ENXIO: xmlParserErrors = 1534;
pub const xmlParserErrors_XML_IO_EPERM: xmlParserErrors = 1535;
pub const xmlParserErrors_XML_IO_EPIPE: xmlParserErrors = 1536;
pub const xmlParserErrors_XML_IO_ERANGE: xmlParserErrors = 1537;
pub const xmlParserErrors_XML_IO_EROFS: xmlParserErrors = 1538;
pub const xmlParserErrors_XML_IO_ESPIPE: xmlParserErrors = 1539;
pub const xmlParserErrors_XML_IO_ESRCH: xmlParserErrors = 1540;
pub const xmlParserErrors_XML_IO_ETIMEDOUT: xmlParserErrors = 1541;
pub const xmlParserErrors_XML_IO_EXDEV: xmlParserErrors = 1542;
pub const xmlParserErrors_XML_IO_NETWORK_ATTEMPT: xmlParserErrors = 1543;
pub const xmlParserErrors_XML_IO_ENCODER: xmlParserErrors = 1544;
pub const xmlParserErrors_XML_IO_FLUSH: xmlParserErrors = 1545;
pub const xmlParserErrors_XML_IO_WRITE: xmlParserErrors = 1546;
pub const xmlParserErrors_XML_IO_NO_INPUT: xmlParserErrors = 1547;
pub const xmlParserErrors_XML_IO_BUFFER_FULL: xmlParserErrors = 1548;
pub const xmlParserErrors_XML_IO_LOAD_ERROR: xmlParserErrors = 1549;
pub const xmlParserErrors_XML_IO_ENOTSOCK: xmlParserErrors = 1550;
pub const xmlParserErrors_XML_IO_EISCONN: xmlParserErrors = 1551;
pub const xmlParserErrors_XML_IO_ECONNREFUSED: xmlParserErrors = 1552;
pub const xmlParserErrors_XML_IO_ENETUNREACH: xmlParserErrors = 1553;
pub const xmlParserErrors_XML_IO_EADDRINUSE: xmlParserErrors = 1554;
pub const xmlParserErrors_XML_IO_EALREADY: xmlParserErrors = 1555;
pub const xmlParserErrors_XML_IO_EAFNOSUPPORT: xmlParserErrors = 1556;
pub const xmlParserErrors_XML_XINCLUDE_RECURSION: xmlParserErrors = 1600;
pub const xmlParserErrors_XML_XINCLUDE_PARSE_VALUE: xmlParserErrors = 1601;
pub const xmlParserErrors_XML_XINCLUDE_ENTITY_DEF_MISMATCH: xmlParserErrors = 1602;
pub const xmlParserErrors_XML_XINCLUDE_NO_HREF: xmlParserErrors = 1603;
pub const xmlParserErrors_XML_XINCLUDE_NO_FALLBACK: xmlParserErrors = 1604;
pub const xmlParserErrors_XML_XINCLUDE_HREF_URI: xmlParserErrors = 1605;
pub const xmlParserErrors_XML_XINCLUDE_TEXT_FRAGMENT: xmlParserErrors = 1606;
pub const xmlParserErrors_XML_XINCLUDE_TEXT_DOCUMENT: xmlParserErrors = 1607;
pub const xmlParserErrors_XML_XINCLUDE_INVALID_CHAR: xmlParserErrors = 1608;
pub const xmlParserErrors_XML_XINCLUDE_BUILD_FAILED: xmlParserErrors = 1609;
pub const xmlParserErrors_XML_XINCLUDE_UNKNOWN_ENCODING: xmlParserErrors = 1610;
pub const xmlParserErrors_XML_XINCLUDE_MULTIPLE_ROOT: xmlParserErrors = 1611;
pub const xmlParserErrors_XML_XINCLUDE_XPTR_FAILED: xmlParserErrors = 1612;
pub const xmlParserErrors_XML_XINCLUDE_XPTR_RESULT: xmlParserErrors = 1613;
pub const xmlParserErrors_XML_XINCLUDE_INCLUDE_IN_INCLUDE: xmlParserErrors = 1614;
pub const xmlParserErrors_XML_XINCLUDE_FALLBACKS_IN_INCLUDE: xmlParserErrors = 1615;
pub const xmlParserErrors_XML_XINCLUDE_FALLBACK_NOT_IN_INCLUDE: xmlParserErrors = 1616;
pub const xmlParserErrors_XML_XINCLUDE_DEPRECATED_NS: xmlParserErrors = 1617;
pub const xmlParserErrors_XML_XINCLUDE_FRAGMENT_ID: xmlParserErrors = 1618;
pub const xmlParserErrors_XML_CATALOG_MISSING_ATTR: xmlParserErrors = 1650;
pub const xmlParserErrors_XML_CATALOG_ENTRY_BROKEN: xmlParserErrors = 1651;
pub const xmlParserErrors_XML_CATALOG_PREFER_VALUE: xmlParserErrors = 1652;
pub const xmlParserErrors_XML_CATALOG_NOT_CATALOG: xmlParserErrors = 1653;
pub const xmlParserErrors_XML_CATALOG_RECURSION: xmlParserErrors = 1654;
pub const xmlParserErrors_XML_SCHEMAP_PREFIX_UNDEFINED: xmlParserErrors = 1700;
pub const xmlParserErrors_XML_SCHEMAP_ATTRFORMDEFAULT_VALUE: xmlParserErrors = 1701;
pub const xmlParserErrors_XML_SCHEMAP_ATTRGRP_NONAME_NOREF: xmlParserErrors = 1702;
pub const xmlParserErrors_XML_SCHEMAP_ATTR_NONAME_NOREF: xmlParserErrors = 1703;
pub const xmlParserErrors_XML_SCHEMAP_COMPLEXTYPE_NONAME_NOREF: xmlParserErrors = 1704;
pub const xmlParserErrors_XML_SCHEMAP_ELEMFORMDEFAULT_VALUE: xmlParserErrors = 1705;
pub const xmlParserErrors_XML_SCHEMAP_ELEM_NONAME_NOREF: xmlParserErrors = 1706;
pub const xmlParserErrors_XML_SCHEMAP_EXTENSION_NO_BASE: xmlParserErrors = 1707;
pub const xmlParserErrors_XML_SCHEMAP_FACET_NO_VALUE: xmlParserErrors = 1708;
pub const xmlParserErrors_XML_SCHEMAP_FAILED_BUILD_IMPORT: xmlParserErrors = 1709;
pub const xmlParserErrors_XML_SCHEMAP_GROUP_NONAME_NOREF: xmlParserErrors = 1710;
pub const xmlParserErrors_XML_SCHEMAP_IMPORT_NAMESPACE_NOT_URI: xmlParserErrors = 1711;
pub const xmlParserErrors_XML_SCHEMAP_IMPORT_REDEFINE_NSNAME: xmlParserErrors = 1712;
pub const xmlParserErrors_XML_SCHEMAP_IMPORT_SCHEMA_NOT_URI: xmlParserErrors = 1713;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_BOOLEAN: xmlParserErrors = 1714;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_ENUM: xmlParserErrors = 1715;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_FACET: xmlParserErrors = 1716;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_FACET_VALUE: xmlParserErrors = 1717;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_MAXOCCURS: xmlParserErrors = 1718;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_MINOCCURS: xmlParserErrors = 1719;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_REF_AND_SUBTYPE: xmlParserErrors = 1720;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_WHITE_SPACE: xmlParserErrors = 1721;
pub const xmlParserErrors_XML_SCHEMAP_NOATTR_NOREF: xmlParserErrors = 1722;
pub const xmlParserErrors_XML_SCHEMAP_NOTATION_NO_NAME: xmlParserErrors = 1723;
pub const xmlParserErrors_XML_SCHEMAP_NOTYPE_NOREF: xmlParserErrors = 1724;
pub const xmlParserErrors_XML_SCHEMAP_REF_AND_SUBTYPE: xmlParserErrors = 1725;
pub const xmlParserErrors_XML_SCHEMAP_RESTRICTION_NONAME_NOREF: xmlParserErrors = 1726;
pub const xmlParserErrors_XML_SCHEMAP_SIMPLETYPE_NONAME: xmlParserErrors = 1727;
pub const xmlParserErrors_XML_SCHEMAP_TYPE_AND_SUBTYPE: xmlParserErrors = 1728;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_ALL_CHILD: xmlParserErrors = 1729;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_ANYATTRIBUTE_CHILD: xmlParserErrors = 1730;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_ATTR_CHILD: xmlParserErrors = 1731;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_ATTRGRP_CHILD: xmlParserErrors = 1732;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_ATTRIBUTE_GROUP: xmlParserErrors = 1733;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_BASE_TYPE: xmlParserErrors = 1734;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_CHOICE_CHILD: xmlParserErrors = 1735;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_COMPLEXCONTENT_CHILD: xmlParserErrors = 1736;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_COMPLEXTYPE_CHILD: xmlParserErrors = 1737;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_ELEM_CHILD: xmlParserErrors = 1738;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_EXTENSION_CHILD: xmlParserErrors = 1739;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_FACET_CHILD: xmlParserErrors = 1740;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_FACET_TYPE: xmlParserErrors = 1741;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_GROUP_CHILD: xmlParserErrors = 1742;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_IMPORT_CHILD: xmlParserErrors = 1743;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_LIST_CHILD: xmlParserErrors = 1744;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_NOTATION_CHILD: xmlParserErrors = 1745;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_PROCESSCONTENT_CHILD: xmlParserErrors = 1746;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_REF: xmlParserErrors = 1747;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_RESTRICTION_CHILD: xmlParserErrors = 1748;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_SCHEMAS_CHILD: xmlParserErrors = 1749;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_SEQUENCE_CHILD: xmlParserErrors = 1750;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_SIMPLECONTENT_CHILD: xmlParserErrors = 1751;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_SIMPLETYPE_CHILD: xmlParserErrors = 1752;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_TYPE: xmlParserErrors = 1753;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_UNION_CHILD: xmlParserErrors = 1754;
pub const xmlParserErrors_XML_SCHEMAP_ELEM_DEFAULT_FIXED: xmlParserErrors = 1755;
pub const xmlParserErrors_XML_SCHEMAP_REGEXP_INVALID: xmlParserErrors = 1756;
pub const xmlParserErrors_XML_SCHEMAP_FAILED_LOAD: xmlParserErrors = 1757;
pub const xmlParserErrors_XML_SCHEMAP_NOTHING_TO_PARSE: xmlParserErrors = 1758;
pub const xmlParserErrors_XML_SCHEMAP_NOROOT: xmlParserErrors = 1759;
pub const xmlParserErrors_XML_SCHEMAP_REDEFINED_GROUP: xmlParserErrors = 1760;
pub const xmlParserErrors_XML_SCHEMAP_REDEFINED_TYPE: xmlParserErrors = 1761;
pub const xmlParserErrors_XML_SCHEMAP_REDEFINED_ELEMENT: xmlParserErrors = 1762;
pub const xmlParserErrors_XML_SCHEMAP_REDEFINED_ATTRGROUP: xmlParserErrors = 1763;
pub const xmlParserErrors_XML_SCHEMAP_REDEFINED_ATTR: xmlParserErrors = 1764;
pub const xmlParserErrors_XML_SCHEMAP_REDEFINED_NOTATION: xmlParserErrors = 1765;
pub const xmlParserErrors_XML_SCHEMAP_FAILED_PARSE: xmlParserErrors = 1766;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_PREFIX: xmlParserErrors = 1767;
pub const xmlParserErrors_XML_SCHEMAP_DEF_AND_PREFIX: xmlParserErrors = 1768;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_INCLUDE_CHILD: xmlParserErrors = 1769;
pub const xmlParserErrors_XML_SCHEMAP_INCLUDE_SCHEMA_NOT_URI: xmlParserErrors = 1770;
pub const xmlParserErrors_XML_SCHEMAP_INCLUDE_SCHEMA_NO_URI: xmlParserErrors = 1771;
pub const xmlParserErrors_XML_SCHEMAP_NOT_SCHEMA: xmlParserErrors = 1772;
pub const xmlParserErrors_XML_SCHEMAP_UNKNOWN_MEMBER_TYPE: xmlParserErrors = 1773;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_ATTR_USE: xmlParserErrors = 1774;
pub const xmlParserErrors_XML_SCHEMAP_RECURSIVE: xmlParserErrors = 1775;
pub const xmlParserErrors_XML_SCHEMAP_SUPERNUMEROUS_LIST_ITEM_TYPE: xmlParserErrors = 1776;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_ATTR_COMBINATION: xmlParserErrors = 1777;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_ATTR_INLINE_COMBINATION: xmlParserErrors = 1778;
pub const xmlParserErrors_XML_SCHEMAP_MISSING_SIMPLETYPE_CHILD: xmlParserErrors = 1779;
pub const xmlParserErrors_XML_SCHEMAP_INVALID_ATTR_NAME: xmlParserErrors = 1780;
pub const xmlParserErrors_XML_SCHEMAP_REF_AND_CONTENT: xmlParserErrors = 1781;
pub const xmlParserErrors_XML_SCHEMAP_CT_PROPS_CORRECT_1: xmlParserErrors = 1782;
pub const xmlParserErrors_XML_SCHEMAP_CT_PROPS_CORRECT_2: xmlParserErrors = 1783;
pub const xmlParserErrors_XML_SCHEMAP_CT_PROPS_CORRECT_3: xmlParserErrors = 1784;
pub const xmlParserErrors_XML_SCHEMAP_CT_PROPS_CORRECT_4: xmlParserErrors = 1785;
pub const xmlParserErrors_XML_SCHEMAP_CT_PROPS_CORRECT_5: xmlParserErrors = 1786;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_1: xmlParserErrors = 1787;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_2_1_1: xmlParserErrors = 1788;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_2_1_2: xmlParserErrors = 1789;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_2_2: xmlParserErrors = 1790;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_3: xmlParserErrors = 1791;
pub const xmlParserErrors_XML_SCHEMAP_WILDCARD_INVALID_NS_MEMBER: xmlParserErrors = 1792;
pub const xmlParserErrors_XML_SCHEMAP_INTERSECTION_NOT_EXPRESSIBLE: xmlParserErrors = 1793;
pub const xmlParserErrors_XML_SCHEMAP_UNION_NOT_EXPRESSIBLE: xmlParserErrors = 1794;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT_3_1: xmlParserErrors = 1795;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT_3_2: xmlParserErrors = 1796;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_4_1: xmlParserErrors = 1797;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_4_2: xmlParserErrors = 1798;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_4_3: xmlParserErrors = 1799;
pub const xmlParserErrors_XML_SCHEMAP_COS_CT_EXTENDS_1_3: xmlParserErrors = 1800;
pub const xmlParserErrors_XML_SCHEMAV_NOROOT: xmlParserErrors = 1801;
pub const xmlParserErrors_XML_SCHEMAV_UNDECLAREDELEM: xmlParserErrors = 1802;
pub const xmlParserErrors_XML_SCHEMAV_NOTTOPLEVEL: xmlParserErrors = 1803;
pub const xmlParserErrors_XML_SCHEMAV_MISSING: xmlParserErrors = 1804;
pub const xmlParserErrors_XML_SCHEMAV_WRONGELEM: xmlParserErrors = 1805;
pub const xmlParserErrors_XML_SCHEMAV_NOTYPE: xmlParserErrors = 1806;
pub const xmlParserErrors_XML_SCHEMAV_NOROLLBACK: xmlParserErrors = 1807;
pub const xmlParserErrors_XML_SCHEMAV_ISABSTRACT: xmlParserErrors = 1808;
pub const xmlParserErrors_XML_SCHEMAV_NOTEMPTY: xmlParserErrors = 1809;
pub const xmlParserErrors_XML_SCHEMAV_ELEMCONT: xmlParserErrors = 1810;
pub const xmlParserErrors_XML_SCHEMAV_HAVEDEFAULT: xmlParserErrors = 1811;
pub const xmlParserErrors_XML_SCHEMAV_NOTNILLABLE: xmlParserErrors = 1812;
pub const xmlParserErrors_XML_SCHEMAV_EXTRACONTENT: xmlParserErrors = 1813;
pub const xmlParserErrors_XML_SCHEMAV_INVALIDATTR: xmlParserErrors = 1814;
pub const xmlParserErrors_XML_SCHEMAV_INVALIDELEM: xmlParserErrors = 1815;
pub const xmlParserErrors_XML_SCHEMAV_NOTDETERMINIST: xmlParserErrors = 1816;
pub const xmlParserErrors_XML_SCHEMAV_CONSTRUCT: xmlParserErrors = 1817;
pub const xmlParserErrors_XML_SCHEMAV_INTERNAL: xmlParserErrors = 1818;
pub const xmlParserErrors_XML_SCHEMAV_NOTSIMPLE: xmlParserErrors = 1819;
pub const xmlParserErrors_XML_SCHEMAV_ATTRUNKNOWN: xmlParserErrors = 1820;
pub const xmlParserErrors_XML_SCHEMAV_ATTRINVALID: xmlParserErrors = 1821;
pub const xmlParserErrors_XML_SCHEMAV_VALUE: xmlParserErrors = 1822;
pub const xmlParserErrors_XML_SCHEMAV_FACET: xmlParserErrors = 1823;
pub const xmlParserErrors_XML_SCHEMAV_CVC_DATATYPE_VALID_1_2_1: xmlParserErrors = 1824;
pub const xmlParserErrors_XML_SCHEMAV_CVC_DATATYPE_VALID_1_2_2: xmlParserErrors = 1825;
pub const xmlParserErrors_XML_SCHEMAV_CVC_DATATYPE_VALID_1_2_3: xmlParserErrors = 1826;
pub const xmlParserErrors_XML_SCHEMAV_CVC_TYPE_3_1_1: xmlParserErrors = 1827;
pub const xmlParserErrors_XML_SCHEMAV_CVC_TYPE_3_1_2: xmlParserErrors = 1828;
pub const xmlParserErrors_XML_SCHEMAV_CVC_FACET_VALID: xmlParserErrors = 1829;
pub const xmlParserErrors_XML_SCHEMAV_CVC_LENGTH_VALID: xmlParserErrors = 1830;
pub const xmlParserErrors_XML_SCHEMAV_CVC_MINLENGTH_VALID: xmlParserErrors = 1831;
pub const xmlParserErrors_XML_SCHEMAV_CVC_MAXLENGTH_VALID: xmlParserErrors = 1832;
pub const xmlParserErrors_XML_SCHEMAV_CVC_MININCLUSIVE_VALID: xmlParserErrors = 1833;
pub const xmlParserErrors_XML_SCHEMAV_CVC_MAXINCLUSIVE_VALID: xmlParserErrors = 1834;
pub const xmlParserErrors_XML_SCHEMAV_CVC_MINEXCLUSIVE_VALID: xmlParserErrors = 1835;
pub const xmlParserErrors_XML_SCHEMAV_CVC_MAXEXCLUSIVE_VALID: xmlParserErrors = 1836;
pub const xmlParserErrors_XML_SCHEMAV_CVC_TOTALDIGITS_VALID: xmlParserErrors = 1837;
pub const xmlParserErrors_XML_SCHEMAV_CVC_FRACTIONDIGITS_VALID: xmlParserErrors = 1838;
pub const xmlParserErrors_XML_SCHEMAV_CVC_PATTERN_VALID: xmlParserErrors = 1839;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ENUMERATION_VALID: xmlParserErrors = 1840;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_2_1: xmlParserErrors = 1841;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_2_2: xmlParserErrors = 1842;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_2_3: xmlParserErrors = 1843;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_2_4: xmlParserErrors = 1844;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_1: xmlParserErrors = 1845;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_2: xmlParserErrors = 1846;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_3_1: xmlParserErrors = 1847;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_3_2_1: xmlParserErrors = 1848;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_3_2_2: xmlParserErrors = 1849;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_4_1: xmlParserErrors = 1850;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_4_2: xmlParserErrors = 1851;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_4_3: xmlParserErrors = 1852;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_5_1_1: xmlParserErrors = 1853;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_5_1_2: xmlParserErrors = 1854;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_5_2_1: xmlParserErrors = 1855;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_5_2_2_1: xmlParserErrors = 1856;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_5_2_2_2_1: xmlParserErrors = 1857;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_5_2_2_2_2: xmlParserErrors = 1858;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_6: xmlParserErrors = 1859;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ELT_7: xmlParserErrors = 1860;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ATTRIBUTE_1: xmlParserErrors = 1861;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ATTRIBUTE_2: xmlParserErrors = 1862;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ATTRIBUTE_3: xmlParserErrors = 1863;
pub const xmlParserErrors_XML_SCHEMAV_CVC_ATTRIBUTE_4: xmlParserErrors = 1864;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_3_1: xmlParserErrors = 1865;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_3_2_1: xmlParserErrors = 1866;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_3_2_2: xmlParserErrors = 1867;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_4: xmlParserErrors = 1868;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_5_1: xmlParserErrors = 1869;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_5_2: xmlParserErrors = 1870;
pub const xmlParserErrors_XML_SCHEMAV_ELEMENT_CONTENT: xmlParserErrors = 1871;
pub const xmlParserErrors_XML_SCHEMAV_DOCUMENT_ELEMENT_MISSING: xmlParserErrors = 1872;
pub const xmlParserErrors_XML_SCHEMAV_CVC_COMPLEX_TYPE_1: xmlParserErrors = 1873;
pub const xmlParserErrors_XML_SCHEMAV_CVC_AU: xmlParserErrors = 1874;
pub const xmlParserErrors_XML_SCHEMAV_CVC_TYPE_1: xmlParserErrors = 1875;
pub const xmlParserErrors_XML_SCHEMAV_CVC_TYPE_2: xmlParserErrors = 1876;
pub const xmlParserErrors_XML_SCHEMAV_CVC_IDC: xmlParserErrors = 1877;
pub const xmlParserErrors_XML_SCHEMAV_CVC_WILDCARD: xmlParserErrors = 1878;
pub const xmlParserErrors_XML_SCHEMAV_MISC: xmlParserErrors = 1879;
pub const xmlParserErrors_XML_XPTR_UNKNOWN_SCHEME: xmlParserErrors = 1900;
pub const xmlParserErrors_XML_XPTR_CHILDSEQ_START: xmlParserErrors = 1901;
pub const xmlParserErrors_XML_XPTR_EVAL_FAILED: xmlParserErrors = 1902;
pub const xmlParserErrors_XML_XPTR_EXTRA_OBJECTS: xmlParserErrors = 1903;
pub const xmlParserErrors_XML_C14N_CREATE_CTXT: xmlParserErrors = 1950;
pub const xmlParserErrors_XML_C14N_REQUIRES_UTF8: xmlParserErrors = 1951;
pub const xmlParserErrors_XML_C14N_CREATE_STACK: xmlParserErrors = 1952;
pub const xmlParserErrors_XML_C14N_INVALID_NODE: xmlParserErrors = 1953;
pub const xmlParserErrors_XML_C14N_UNKNOW_NODE: xmlParserErrors = 1954;
pub const xmlParserErrors_XML_C14N_RELATIVE_NAMESPACE: xmlParserErrors = 1955;
pub const xmlParserErrors_XML_FTP_PASV_ANSWER: xmlParserErrors = 2000;
pub const xmlParserErrors_XML_FTP_EPSV_ANSWER: xmlParserErrors = 2001;
pub const xmlParserErrors_XML_FTP_ACCNT: xmlParserErrors = 2002;
pub const xmlParserErrors_XML_FTP_URL_SYNTAX: xmlParserErrors = 2003;
pub const xmlParserErrors_XML_HTTP_URL_SYNTAX: xmlParserErrors = 2020;
pub const xmlParserErrors_XML_HTTP_USE_IP: xmlParserErrors = 2021;
pub const xmlParserErrors_XML_HTTP_UNKNOWN_HOST: xmlParserErrors = 2022;
pub const xmlParserErrors_XML_SCHEMAP_SRC_SIMPLE_TYPE_1: xmlParserErrors = 3000;
pub const xmlParserErrors_XML_SCHEMAP_SRC_SIMPLE_TYPE_2: xmlParserErrors = 3001;
pub const xmlParserErrors_XML_SCHEMAP_SRC_SIMPLE_TYPE_3: xmlParserErrors = 3002;
pub const xmlParserErrors_XML_SCHEMAP_SRC_SIMPLE_TYPE_4: xmlParserErrors = 3003;
pub const xmlParserErrors_XML_SCHEMAP_SRC_RESOLVE: xmlParserErrors = 3004;
pub const xmlParserErrors_XML_SCHEMAP_SRC_RESTRICTION_BASE_OR_SIMPLETYPE: xmlParserErrors = 3005;
pub const xmlParserErrors_XML_SCHEMAP_SRC_LIST_ITEMTYPE_OR_SIMPLETYPE: xmlParserErrors = 3006;
pub const xmlParserErrors_XML_SCHEMAP_SRC_UNION_MEMBERTYPES_OR_SIMPLETYPES: xmlParserErrors = 3007;
pub const xmlParserErrors_XML_SCHEMAP_ST_PROPS_CORRECT_1: xmlParserErrors = 3008;
pub const xmlParserErrors_XML_SCHEMAP_ST_PROPS_CORRECT_2: xmlParserErrors = 3009;
pub const xmlParserErrors_XML_SCHEMAP_ST_PROPS_CORRECT_3: xmlParserErrors = 3010;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_1_1: xmlParserErrors = 3011;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_1_2: xmlParserErrors = 3012;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_1_3_1: xmlParserErrors = 3013;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_1_3_2: xmlParserErrors = 3014;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_1: xmlParserErrors = 3015;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_3_1_1: xmlParserErrors = 3016;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_3_1_2: xmlParserErrors = 3017;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_3_2_1: xmlParserErrors = 3018;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_3_2_2: xmlParserErrors = 3019;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_3_2_3: xmlParserErrors = 3020;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_3_2_4: xmlParserErrors = 3021;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_2_3_2_5: xmlParserErrors = 3022;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_1: xmlParserErrors = 3023;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_3_1: xmlParserErrors = 3024;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_3_1_2: xmlParserErrors = 3025;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_3_2_2: xmlParserErrors = 3026;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_3_2_1: xmlParserErrors = 3027;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_3_2_3: xmlParserErrors = 3028;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_3_2_4: xmlParserErrors = 3029;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_RESTRICTS_3_3_2_5: xmlParserErrors = 3030;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_DERIVED_OK_2_1: xmlParserErrors = 3031;
pub const xmlParserErrors_XML_SCHEMAP_COS_ST_DERIVED_OK_2_2: xmlParserErrors = 3032;
pub const xmlParserErrors_XML_SCHEMAP_S4S_ELEM_NOT_ALLOWED: xmlParserErrors = 3033;
pub const xmlParserErrors_XML_SCHEMAP_S4S_ELEM_MISSING: xmlParserErrors = 3034;
pub const xmlParserErrors_XML_SCHEMAP_S4S_ATTR_NOT_ALLOWED: xmlParserErrors = 3035;
pub const xmlParserErrors_XML_SCHEMAP_S4S_ATTR_MISSING: xmlParserErrors = 3036;
pub const xmlParserErrors_XML_SCHEMAP_S4S_ATTR_INVALID_VALUE: xmlParserErrors = 3037;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ELEMENT_1: xmlParserErrors = 3038;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ELEMENT_2_1: xmlParserErrors = 3039;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ELEMENT_2_2: xmlParserErrors = 3040;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ELEMENT_3: xmlParserErrors = 3041;
pub const xmlParserErrors_XML_SCHEMAP_P_PROPS_CORRECT_1: xmlParserErrors = 3042;
pub const xmlParserErrors_XML_SCHEMAP_P_PROPS_CORRECT_2_1: xmlParserErrors = 3043;
pub const xmlParserErrors_XML_SCHEMAP_P_PROPS_CORRECT_2_2: xmlParserErrors = 3044;
pub const xmlParserErrors_XML_SCHEMAP_E_PROPS_CORRECT_2: xmlParserErrors = 3045;
pub const xmlParserErrors_XML_SCHEMAP_E_PROPS_CORRECT_3: xmlParserErrors = 3046;
pub const xmlParserErrors_XML_SCHEMAP_E_PROPS_CORRECT_4: xmlParserErrors = 3047;
pub const xmlParserErrors_XML_SCHEMAP_E_PROPS_CORRECT_5: xmlParserErrors = 3048;
pub const xmlParserErrors_XML_SCHEMAP_E_PROPS_CORRECT_6: xmlParserErrors = 3049;
pub const xmlParserErrors_XML_SCHEMAP_SRC_INCLUDE: xmlParserErrors = 3050;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_1: xmlParserErrors = 3051;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_2: xmlParserErrors = 3052;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_3_1: xmlParserErrors = 3053;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_3_2: xmlParserErrors = 3054;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_4: xmlParserErrors = 3055;
pub const xmlParserErrors_XML_SCHEMAP_NO_XMLNS: xmlParserErrors = 3056;
pub const xmlParserErrors_XML_SCHEMAP_NO_XSI: xmlParserErrors = 3057;
pub const xmlParserErrors_XML_SCHEMAP_COS_VALID_DEFAULT_1: xmlParserErrors = 3058;
pub const xmlParserErrors_XML_SCHEMAP_COS_VALID_DEFAULT_2_1: xmlParserErrors = 3059;
pub const xmlParserErrors_XML_SCHEMAP_COS_VALID_DEFAULT_2_2_1: xmlParserErrors = 3060;
pub const xmlParserErrors_XML_SCHEMAP_COS_VALID_DEFAULT_2_2_2: xmlParserErrors = 3061;
pub const xmlParserErrors_XML_SCHEMAP_CVC_SIMPLE_TYPE: xmlParserErrors = 3062;
pub const xmlParserErrors_XML_SCHEMAP_COS_CT_EXTENDS_1_1: xmlParserErrors = 3063;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT_1_1: xmlParserErrors = 3064;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT_1_2: xmlParserErrors = 3065;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT_2: xmlParserErrors = 3066;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT_2_1: xmlParserErrors = 3067;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT_2_2: xmlParserErrors = 3068;
pub const xmlParserErrors_XML_SCHEMAP_INTERNAL: xmlParserErrors = 3069;
pub const xmlParserErrors_XML_SCHEMAP_NOT_DETERMINISTIC: xmlParserErrors = 3070;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_GROUP_1: xmlParserErrors = 3071;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_GROUP_2: xmlParserErrors = 3072;
pub const xmlParserErrors_XML_SCHEMAP_SRC_ATTRIBUTE_GROUP_3: xmlParserErrors = 3073;
pub const xmlParserErrors_XML_SCHEMAP_MG_PROPS_CORRECT_1: xmlParserErrors = 3074;
pub const xmlParserErrors_XML_SCHEMAP_MG_PROPS_CORRECT_2: xmlParserErrors = 3075;
pub const xmlParserErrors_XML_SCHEMAP_SRC_CT_1: xmlParserErrors = 3076;
pub const xmlParserErrors_XML_SCHEMAP_DERIVATION_OK_RESTRICTION_2_1_3: xmlParserErrors = 3077;
pub const xmlParserErrors_XML_SCHEMAP_AU_PROPS_CORRECT_2: xmlParserErrors = 3078;
pub const xmlParserErrors_XML_SCHEMAP_A_PROPS_CORRECT_2: xmlParserErrors = 3079;
pub const xmlParserErrors_XML_SCHEMAP_C_PROPS_CORRECT: xmlParserErrors = 3080;
pub const xmlParserErrors_XML_SCHEMAP_SRC_REDEFINE: xmlParserErrors = 3081;
pub const xmlParserErrors_XML_SCHEMAP_SRC_IMPORT: xmlParserErrors = 3082;
pub const xmlParserErrors_XML_SCHEMAP_WARN_SKIP_SCHEMA: xmlParserErrors = 3083;
pub const xmlParserErrors_XML_SCHEMAP_WARN_UNLOCATED_SCHEMA: xmlParserErrors = 3084;
pub const xmlParserErrors_XML_SCHEMAP_WARN_ATTR_REDECL_PROH: xmlParserErrors = 3085;
pub const xmlParserErrors_XML_SCHEMAP_WARN_ATTR_POINTLESS_PROH: xmlParserErrors = 3086;
pub const xmlParserErrors_XML_SCHEMAP_AG_PROPS_CORRECT: xmlParserErrors = 3087;
pub const xmlParserErrors_XML_SCHEMAP_COS_CT_EXTENDS_1_2: xmlParserErrors = 3088;
pub const xmlParserErrors_XML_SCHEMAP_AU_PROPS_CORRECT: xmlParserErrors = 3089;
pub const xmlParserErrors_XML_SCHEMAP_A_PROPS_CORRECT_3: xmlParserErrors = 3090;
pub const xmlParserErrors_XML_SCHEMAP_COS_ALL_LIMITED: xmlParserErrors = 3091;
pub const xmlParserErrors_XML_SCHEMATRONV_ASSERT: xmlParserErrors = 4000;
pub const xmlParserErrors_XML_SCHEMATRONV_REPORT: xmlParserErrors = 4001;
pub const xmlParserErrors_XML_MODULE_OPEN: xmlParserErrors = 4900;
pub const xmlParserErrors_XML_MODULE_CLOSE: xmlParserErrors = 4901;
pub const xmlParserErrors_XML_CHECK_FOUND_ELEMENT: xmlParserErrors = 5000;
pub const xmlParserErrors_XML_CHECK_FOUND_ATTRIBUTE: xmlParserErrors = 5001;
pub const xmlParserErrors_XML_CHECK_FOUND_TEXT: xmlParserErrors = 5002;
pub const xmlParserErrors_XML_CHECK_FOUND_CDATA: xmlParserErrors = 5003;
pub const xmlParserErrors_XML_CHECK_FOUND_ENTITYREF: xmlParserErrors = 5004;
pub const xmlParserErrors_XML_CHECK_FOUND_ENTITY: xmlParserErrors = 5005;
pub const xmlParserErrors_XML_CHECK_FOUND_PI: xmlParserErrors = 5006;
pub const xmlParserErrors_XML_CHECK_FOUND_COMMENT: xmlParserErrors = 5007;
pub const xmlParserErrors_XML_CHECK_FOUND_DOCTYPE: xmlParserErrors = 5008;
pub const xmlParserErrors_XML_CHECK_FOUND_FRAGMENT: xmlParserErrors = 5009;
pub const xmlParserErrors_XML_CHECK_FOUND_NOTATION: xmlParserErrors = 5010;
pub const xmlParserErrors_XML_CHECK_UNKNOWN_NODE: xmlParserErrors = 5011;
pub const xmlParserErrors_XML_CHECK_ENTITY_TYPE: xmlParserErrors = 5012;
pub const xmlParserErrors_XML_CHECK_NO_PARENT: xmlParserErrors = 5013;
pub const xmlParserErrors_XML_CHECK_NO_DOC: xmlParserErrors = 5014;
pub const xmlParserErrors_XML_CHECK_NO_NAME: xmlParserErrors = 5015;
pub const xmlParserErrors_XML_CHECK_NO_ELEM: xmlParserErrors = 5016;
pub const xmlParserErrors_XML_CHECK_WRONG_DOC: xmlParserErrors = 5017;
pub const xmlParserErrors_XML_CHECK_NO_PREV: xmlParserErrors = 5018;
pub const xmlParserErrors_XML_CHECK_WRONG_PREV: xmlParserErrors = 5019;
pub const xmlParserErrors_XML_CHECK_NO_NEXT: xmlParserErrors = 5020;
pub const xmlParserErrors_XML_CHECK_WRONG_NEXT: xmlParserErrors = 5021;
pub const xmlParserErrors_XML_CHECK_NOT_DTD: xmlParserErrors = 5022;
pub const xmlParserErrors_XML_CHECK_NOT_ATTR: xmlParserErrors = 5023;
pub const xmlParserErrors_XML_CHECK_NOT_ATTR_DECL: xmlParserErrors = 5024;
pub const xmlParserErrors_XML_CHECK_NOT_ELEM_DECL: xmlParserErrors = 5025;
pub const xmlParserErrors_XML_CHECK_NOT_ENTITY_DECL: xmlParserErrors = 5026;
pub const xmlParserErrors_XML_CHECK_NOT_NS_DECL: xmlParserErrors = 5027;
pub const xmlParserErrors_XML_CHECK_NO_HREF: xmlParserErrors = 5028;
pub const xmlParserErrors_XML_CHECK_WRONG_PARENT: xmlParserErrors = 5029;
pub const xmlParserErrors_XML_CHECK_NS_SCOPE: xmlParserErrors = 5030;
pub const xmlParserErrors_XML_CHECK_NS_ANCESTOR: xmlParserErrors = 5031;
pub const xmlParserErrors_XML_CHECK_NOT_UTF8: xmlParserErrors = 5032;
pub const xmlParserErrors_XML_CHECK_NO_DICT: xmlParserErrors = 5033;
pub const xmlParserErrors_XML_CHECK_NOT_NCNAME: xmlParserErrors = 5034;
pub const xmlParserErrors_XML_CHECK_OUTSIDE_DICT: xmlParserErrors = 5035;
pub const xmlParserErrors_XML_CHECK_WRONG_NAME: xmlParserErrors = 5036;
pub const xmlParserErrors_XML_CHECK_NAME_NOT_NULL: xmlParserErrors = 5037;
pub const xmlParserErrors_XML_I18N_NO_NAME: xmlParserErrors = 6000;
pub const xmlParserErrors_XML_I18N_NO_HANDLER: xmlParserErrors = 6001;
pub const xmlParserErrors_XML_I18N_EXCESS_HANDLER: xmlParserErrors = 6002;
pub const xmlParserErrors_XML_I18N_CONV_FAILED: xmlParserErrors = 6003;
pub const xmlParserErrors_XML_I18N_NO_OUTPUT: xmlParserErrors = 6004;
pub const xmlParserErrors_XML_BUF_OVERFLOW: xmlParserErrors = 7000;
/// xmlParserError:
///
/// This is an error that the XML (or HTML) parser can generate
pub type xmlParserErrors = u32;
/// xmlGenericErrorFunc:
/// @ctx:  a parsing context
/// @msg:  the message
/// @...:  the extra arguments of the varags to format the message
///
/// Signature of the function to use when there is an error and
/// no parsing or validity context available .
pub type xmlGenericErrorFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, msg: *const ::std::os::raw::c_char, ...),
>;
/// xmlStructuredErrorFunc:
/// @userData:  user provided data for the error callback
/// @error:  the error being raised.
///
/// Signature of the function to use when there is an error and
/// the module handles the new error reporting mechanism.
pub type xmlStructuredErrorFunc = ::std::option::Option<
  unsafe extern "C" fn(userData: *mut ::std::os::raw::c_void, error: xmlErrorPtr),
>;
extern "C" {
  pub fn xmlSetGenericErrorFunc(ctx: *mut ::std::os::raw::c_void, handler: xmlGenericErrorFunc);
}
extern "C" {
  pub fn initGenericErrorDefaultFunc(handler: *mut xmlGenericErrorFunc);
}
extern "C" {
  pub fn xmlSetStructuredErrorFunc(
    ctx: *mut ::std::os::raw::c_void,
    handler: xmlStructuredErrorFunc,
  );
}
extern "C" {
  pub fn xmlParserError(ctx: *mut ::std::os::raw::c_void, msg: *const ::std::os::raw::c_char, ...);
}
extern "C" {
  pub fn xmlParserWarning(
    ctx: *mut ::std::os::raw::c_void,
    msg: *const ::std::os::raw::c_char,
    ...
  );
}
extern "C" {
  pub fn xmlParserValidityError(
    ctx: *mut ::std::os::raw::c_void,
    msg: *const ::std::os::raw::c_char,
    ...
  );
}
extern "C" {
  pub fn xmlParserValidityWarning(
    ctx: *mut ::std::os::raw::c_void,
    msg: *const ::std::os::raw::c_char,
    ...
  );
}
extern "C" {
  pub fn xmlParserPrintFileInfo(input: xmlParserInputPtr);
}
extern "C" {
  pub fn xmlParserPrintFileContext(input: xmlParserInputPtr);
}
extern "C" {
  pub fn xmlGetLastError() -> xmlErrorPtr;
}
extern "C" {
  pub fn xmlResetLastError();
}
extern "C" {
  pub fn xmlCtxtGetLastError(ctx: *mut ::std::os::raw::c_void) -> xmlErrorPtr;
}
extern "C" {
  pub fn xmlCtxtResetLastError(ctx: *mut ::std::os::raw::c_void);
}
extern "C" {
  pub fn xmlResetError(err: xmlErrorPtr);
}
extern "C" {
  pub fn xmlCopyError(from: xmlErrorPtr, to: xmlErrorPtr) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlLink {
  _unused: [u8; 0],
}
pub type xmlLink = _xmlLink;
pub type xmlLinkPtr = *mut xmlLink;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlList {
  _unused: [u8; 0],
}
pub type xmlList = _xmlList;
pub type xmlListPtr = *mut xmlList;
/// xmlListDeallocator:
/// @lk:  the data to deallocate
///
/// Callback function used to free data from a list.
pub type xmlListDeallocator = ::std::option::Option<unsafe extern "C" fn(lk: xmlLinkPtr)>;
/// xmlListDataCompare:
/// @data0: the first data
/// @data1: the second data
///
/// Callback function used to compare 2 data.
///
/// Returns 0 is equality, -1 or 1 otherwise depending on the ordering.
pub type xmlListDataCompare = ::std::option::Option<
  unsafe extern "C" fn(data0: *const ::std::os::raw::c_void, data1: *const ::std::os::raw::c_void)
    -> ::std::os::raw::c_int,
>;
/// xmlListWalker:
/// @data: the data found in the list
/// @user: extra user provided data to the walker
///
/// Callback function used when walking a list with xmlListWalk().
///
/// Returns 0 to stop walking the list, 1 otherwise.
pub type xmlListWalker = ::std::option::Option<
  unsafe extern "C" fn(data: *const ::std::os::raw::c_void, user: *const ::std::os::raw::c_void)
    -> ::std::os::raw::c_int,
>;
extern "C" {
  pub fn xmlListCreate(deallocator: xmlListDeallocator, compare: xmlListDataCompare) -> xmlListPtr;
}
extern "C" {
  pub fn xmlListDelete(l: xmlListPtr);
}
extern "C" {
  pub fn xmlListSearch(
    l: xmlListPtr,
    data: *mut ::std::os::raw::c_void,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlListReverseSearch(
    l: xmlListPtr,
    data: *mut ::std::os::raw::c_void,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn xmlListInsert(l: xmlListPtr, data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListAppend(l: xmlListPtr, data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListRemoveFirst(
    l: xmlListPtr,
    data: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListRemoveLast(
    l: xmlListPtr,
    data: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListRemoveAll(
    l: xmlListPtr,
    data: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListClear(l: xmlListPtr);
}
extern "C" {
  pub fn xmlListEmpty(l: xmlListPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListFront(l: xmlListPtr) -> xmlLinkPtr;
}
extern "C" {
  pub fn xmlListEnd(l: xmlListPtr) -> xmlLinkPtr;
}
extern "C" {
  pub fn xmlListSize(l: xmlListPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListPopFront(l: xmlListPtr);
}
extern "C" {
  pub fn xmlListPopBack(l: xmlListPtr);
}
extern "C" {
  pub fn xmlListPushFront(
    l: xmlListPtr,
    data: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListPushBack(l: xmlListPtr, data: *mut ::std::os::raw::c_void)
    -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlListReverse(l: xmlListPtr);
}
extern "C" {
  pub fn xmlListSort(l: xmlListPtr);
}
extern "C" {
  pub fn xmlListWalk(l: xmlListPtr, walker: xmlListWalker, user: *const ::std::os::raw::c_void);
}
extern "C" {
  pub fn xmlListReverseWalk(
    l: xmlListPtr,
    walker: xmlListWalker,
    user: *const ::std::os::raw::c_void,
  );
}
extern "C" {
  pub fn xmlListMerge(l1: xmlListPtr, l2: xmlListPtr);
}
extern "C" {
  pub fn xmlListDup(old: xmlListPtr) -> xmlListPtr;
}
extern "C" {
  pub fn xmlListCopy(cur: xmlListPtr, old: xmlListPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlLinkGetData(lk: xmlLinkPtr) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlAutomata {
  _unused: [u8; 0],
}
/// xmlAutomataPtr:
///
/// A libxml automata description, It can be compiled into a regexp
pub type xmlAutomata = _xmlAutomata;
pub type xmlAutomataPtr = *mut xmlAutomata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlAutomataState {
  _unused: [u8; 0],
}
/// xmlAutomataStatePtr:
///
/// A state int the automata description,
pub type xmlAutomataState = _xmlAutomataState;
pub type xmlAutomataStatePtr = *mut xmlAutomataState;
extern "C" {
  pub fn xmlNewAutomata() -> xmlAutomataPtr;
}
extern "C" {
  pub fn xmlFreeAutomata(am: xmlAutomataPtr);
}
extern "C" {
  pub fn xmlAutomataGetInitState(am: xmlAutomataPtr) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataSetFinalState(
    am: xmlAutomataPtr,
    state: xmlAutomataStatePtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlAutomataNewState(am: xmlAutomataPtr) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewTransition(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    token: *const xmlChar,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewTransition2(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    token: *const xmlChar,
    token2: *const xmlChar,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewNegTrans(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    token: *const xmlChar,
    token2: *const xmlChar,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewCountTrans(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    token: *const xmlChar,
    min: ::std::os::raw::c_int,
    max: ::std::os::raw::c_int,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewCountTrans2(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    token: *const xmlChar,
    token2: *const xmlChar,
    min: ::std::os::raw::c_int,
    max: ::std::os::raw::c_int,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewOnceTrans(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    token: *const xmlChar,
    min: ::std::os::raw::c_int,
    max: ::std::os::raw::c_int,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewOnceTrans2(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    token: *const xmlChar,
    token2: *const xmlChar,
    min: ::std::os::raw::c_int,
    max: ::std::os::raw::c_int,
    data: *mut ::std::os::raw::c_void,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewAllTrans(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    lax: ::std::os::raw::c_int,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewEpsilon(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewCountedTrans(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    counter: ::std::os::raw::c_int,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewCounterTrans(
    am: xmlAutomataPtr,
    from: xmlAutomataStatePtr,
    to: xmlAutomataStatePtr,
    counter: ::std::os::raw::c_int,
  ) -> xmlAutomataStatePtr;
}
extern "C" {
  pub fn xmlAutomataNewCounter(
    am: xmlAutomataPtr,
    min: ::std::os::raw::c_int,
    max: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlAutomataCompile(am: xmlAutomataPtr) -> xmlRegexpPtr;
}
extern "C" {
  pub fn xmlAutomataIsDeterminist(am: xmlAutomataPtr) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlValidState {
  _unused: [u8; 0],
}
pub type xmlValidState = _xmlValidState;
pub type xmlValidStatePtr = *mut xmlValidState;
/// xmlValidityErrorFunc:
/// @ctx:  usually an xmlValidCtxtPtr to a validity error context,
/// but comes from ctxt->userData (which normally contains such
/// a pointer); ctxt->userData can be changed by the user.
/// @msg:  the string to format *printf like vararg
/// @...:  remaining arguments to the format
///
/// Callback called when a validity error is found. This is a message
/// oriented function similar to an *printf function.
pub type xmlValidityErrorFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, msg: *const ::std::os::raw::c_char, ...),
>;
/// xmlValidityWarningFunc:
/// @ctx:  usually an xmlValidCtxtPtr to a validity error context,
/// but comes from ctxt->userData (which normally contains such
/// a pointer); ctxt->userData can be changed by the user.
/// @msg:  the string to format *printf like vararg
/// @...:  remaining arguments to the format
///
/// Callback called when a validity warning is found. This is a message
/// oriented function similar to an *printf function.
pub type xmlValidityWarningFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, msg: *const ::std::os::raw::c_char, ...),
>;
pub type xmlValidCtxt = _xmlValidCtxt;
pub type xmlValidCtxtPtr = *mut xmlValidCtxt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlValidCtxt {
  pub userData: *mut ::std::os::raw::c_void,
  pub error: xmlValidityErrorFunc,
  pub warning: xmlValidityWarningFunc,
  pub node: xmlNodePtr,
  pub nodeNr: ::std::os::raw::c_int,
  pub nodeMax: ::std::os::raw::c_int,
  pub nodeTab: *mut xmlNodePtr,
  pub finishDtd: ::std::os::raw::c_uint,
  pub doc: xmlDocPtr,
  pub valid: ::std::os::raw::c_int,
  pub vstate: *mut xmlValidState,
  pub vstateNr: ::std::os::raw::c_int,
  pub vstateMax: ::std::os::raw::c_int,
  pub vstateTab: *mut xmlValidState,
  pub am: xmlAutomataPtr,
  pub state: xmlAutomataStatePtr,
}
#[test]
fn bindgen_test_layout__xmlValidCtxt() {
  assert_eq!(
    ::std::mem::size_of::<_xmlValidCtxt>(),
    112usize,
    concat!("Size of: ", stringify!(_xmlValidCtxt))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlValidCtxt>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlValidCtxt))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).userData as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(userData)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).error as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(error)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).warning as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(warning)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).node as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(node)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).nodeNr as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(nodeNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).nodeMax as *const _ as usize },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(nodeMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).nodeTab as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(nodeTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).finishDtd as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(finishDtd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).doc as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).valid as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(valid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).vstate as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(vstate)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).vstateNr as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(vstateNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).vstateMax as *const _ as usize },
    84usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(vstateMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).vstateTab as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(vstateTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).am as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(am)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlValidCtxt>())).state as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlValidCtxt),
      "::",
      stringify!(state)
    )
  );
}
pub type xmlNotationTable = _xmlHashTable;
pub type xmlNotationTablePtr = *mut xmlNotationTable;
pub type xmlElementTable = _xmlHashTable;
pub type xmlElementTablePtr = *mut xmlElementTable;
pub type xmlAttributeTable = _xmlHashTable;
pub type xmlAttributeTablePtr = *mut xmlAttributeTable;
pub type xmlIDTable = _xmlHashTable;
pub type xmlIDTablePtr = *mut xmlIDTable;
pub type xmlRefTable = _xmlHashTable;
pub type xmlRefTablePtr = *mut xmlRefTable;
extern "C" {
  pub fn xmlAddNotationDecl(
    ctxt: xmlValidCtxtPtr,
    dtd: xmlDtdPtr,
    name: *const xmlChar,
    PublicID: *const xmlChar,
    SystemID: *const xmlChar,
  ) -> xmlNotationPtr;
}
extern "C" {
  pub fn xmlCopyNotationTable(table: xmlNotationTablePtr) -> xmlNotationTablePtr;
}
extern "C" {
  pub fn xmlFreeNotationTable(table: xmlNotationTablePtr);
}
extern "C" {
  pub fn xmlDumpNotationDecl(buf: xmlBufferPtr, nota: xmlNotationPtr);
}
extern "C" {
  pub fn xmlDumpNotationTable(buf: xmlBufferPtr, table: xmlNotationTablePtr);
}
extern "C" {
  pub fn xmlNewElementContent(
    name: *const xmlChar,
    type_: xmlElementContentType,
  ) -> xmlElementContentPtr;
}
extern "C" {
  pub fn xmlCopyElementContent(content: xmlElementContentPtr) -> xmlElementContentPtr;
}
extern "C" {
  pub fn xmlFreeElementContent(cur: xmlElementContentPtr);
}
extern "C" {
  pub fn xmlNewDocElementContent(
    doc: xmlDocPtr,
    name: *const xmlChar,
    type_: xmlElementContentType,
  ) -> xmlElementContentPtr;
}
extern "C" {
  pub fn xmlCopyDocElementContent(
    doc: xmlDocPtr,
    content: xmlElementContentPtr,
  ) -> xmlElementContentPtr;
}
extern "C" {
  pub fn xmlFreeDocElementContent(doc: xmlDocPtr, cur: xmlElementContentPtr);
}
extern "C" {
  pub fn xmlSnprintfElementContent(
    buf: *mut ::std::os::raw::c_char,
    size: ::std::os::raw::c_int,
    content: xmlElementContentPtr,
    englob: ::std::os::raw::c_int,
  );
}
extern "C" {
  pub fn xmlSprintfElementContent(
    buf: *mut ::std::os::raw::c_char,
    content: xmlElementContentPtr,
    englob: ::std::os::raw::c_int,
  );
}
extern "C" {
  pub fn xmlAddElementDecl(
    ctxt: xmlValidCtxtPtr,
    dtd: xmlDtdPtr,
    name: *const xmlChar,
    type_: xmlElementTypeVal,
    content: xmlElementContentPtr,
  ) -> xmlElementPtr;
}
extern "C" {
  pub fn xmlCopyElementTable(table: xmlElementTablePtr) -> xmlElementTablePtr;
}
extern "C" {
  pub fn xmlFreeElementTable(table: xmlElementTablePtr);
}
extern "C" {
  pub fn xmlDumpElementTable(buf: xmlBufferPtr, table: xmlElementTablePtr);
}
extern "C" {
  pub fn xmlDumpElementDecl(buf: xmlBufferPtr, elem: xmlElementPtr);
}
extern "C" {
  pub fn xmlCreateEnumeration(name: *const xmlChar) -> xmlEnumerationPtr;
}
extern "C" {
  pub fn xmlFreeEnumeration(cur: xmlEnumerationPtr);
}
extern "C" {
  pub fn xmlCopyEnumeration(cur: xmlEnumerationPtr) -> xmlEnumerationPtr;
}
extern "C" {
  pub fn xmlAddAttributeDecl(
    ctxt: xmlValidCtxtPtr,
    dtd: xmlDtdPtr,
    elem: *const xmlChar,
    name: *const xmlChar,
    ns: *const xmlChar,
    type_: xmlAttributeType,
    def: xmlAttributeDefault,
    defaultValue: *const xmlChar,
    tree: xmlEnumerationPtr,
  ) -> xmlAttributePtr;
}
extern "C" {
  pub fn xmlCopyAttributeTable(table: xmlAttributeTablePtr) -> xmlAttributeTablePtr;
}
extern "C" {
  pub fn xmlFreeAttributeTable(table: xmlAttributeTablePtr);
}
extern "C" {
  pub fn xmlDumpAttributeTable(buf: xmlBufferPtr, table: xmlAttributeTablePtr);
}
extern "C" {
  pub fn xmlDumpAttributeDecl(buf: xmlBufferPtr, attr: xmlAttributePtr);
}
extern "C" {
  pub fn xmlAddID(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    value: *const xmlChar,
    attr: xmlAttrPtr,
  ) -> xmlIDPtr;
}
extern "C" {
  pub fn xmlFreeIDTable(table: xmlIDTablePtr);
}
extern "C" {
  pub fn xmlGetID(doc: xmlDocPtr, ID: *const xmlChar) -> xmlAttrPtr;
}
extern "C" {
  pub fn xmlIsID(doc: xmlDocPtr, elem: xmlNodePtr, attr: xmlAttrPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlRemoveID(doc: xmlDocPtr, attr: xmlAttrPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlAddRef(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    value: *const xmlChar,
    attr: xmlAttrPtr,
  ) -> xmlRefPtr;
}
extern "C" {
  pub fn xmlFreeRefTable(table: xmlRefTablePtr);
}
extern "C" {
  pub fn xmlIsRef(doc: xmlDocPtr, elem: xmlNodePtr, attr: xmlAttrPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlRemoveRef(doc: xmlDocPtr, attr: xmlAttrPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlGetRefs(doc: xmlDocPtr, ID: *const xmlChar) -> xmlListPtr;
}
extern "C" {
  pub fn xmlNewValidCtxt() -> xmlValidCtxtPtr;
}
extern "C" {
  pub fn xmlFreeValidCtxt(arg1: xmlValidCtxtPtr);
}
extern "C" {
  pub fn xmlValidateRoot(ctxt: xmlValidCtxtPtr, doc: xmlDocPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateElementDecl(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlElementPtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidNormalizeAttributeValue(
    doc: xmlDocPtr,
    elem: xmlNodePtr,
    name: *const xmlChar,
    value: *const xmlChar,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlValidCtxtNormalizeAttributeValue(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlNodePtr,
    name: *const xmlChar,
    value: *const xmlChar,
  ) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlValidateAttributeDecl(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    attr: xmlAttributePtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateAttributeValue(
    type_: xmlAttributeType,
    value: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateNotationDecl(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    nota: xmlNotationPtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateDtd(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    dtd: xmlDtdPtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateDtdFinal(ctxt: xmlValidCtxtPtr, doc: xmlDocPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateDocument(ctxt: xmlValidCtxtPtr, doc: xmlDocPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateElement(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlNodePtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateOneElement(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlNodePtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateOneAttribute(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlNodePtr,
    attr: xmlAttrPtr,
    value: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateOneNamespace(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlNodePtr,
    prefix: *const xmlChar,
    ns: xmlNsPtr,
    value: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateDocumentFinal(ctxt: xmlValidCtxtPtr, doc: xmlDocPtr) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateNotationUse(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    notationName: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlIsMixedElement(doc: xmlDocPtr, name: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlGetDtdAttrDesc(
    dtd: xmlDtdPtr,
    elem: *const xmlChar,
    name: *const xmlChar,
  ) -> xmlAttributePtr;
}
extern "C" {
  pub fn xmlGetDtdQAttrDesc(
    dtd: xmlDtdPtr,
    elem: *const xmlChar,
    name: *const xmlChar,
    prefix: *const xmlChar,
  ) -> xmlAttributePtr;
}
extern "C" {
  pub fn xmlGetDtdNotationDesc(dtd: xmlDtdPtr, name: *const xmlChar) -> xmlNotationPtr;
}
extern "C" {
  pub fn xmlGetDtdQElementDesc(
    dtd: xmlDtdPtr,
    name: *const xmlChar,
    prefix: *const xmlChar,
  ) -> xmlElementPtr;
}
extern "C" {
  pub fn xmlGetDtdElementDesc(dtd: xmlDtdPtr, name: *const xmlChar) -> xmlElementPtr;
}
extern "C" {
  pub fn xmlValidGetPotentialChildren(
    ctree: *mut xmlElementContent,
    names: *mut *const xmlChar,
    len: *mut ::std::os::raw::c_int,
    max: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidGetValidElements(
    prev: *mut xmlNode,
    next: *mut xmlNode,
    names: *mut *const xmlChar,
    max: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateNameValue(value: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateNamesValue(value: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateNmtokenValue(value: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidateNmtokensValue(value: *const xmlChar) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidBuildContentModel(
    ctxt: xmlValidCtxtPtr,
    elem: xmlElementPtr,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidatePushElement(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlNodePtr,
    qname: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidatePushCData(
    ctxt: xmlValidCtxtPtr,
    data: *const xmlChar,
    len: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn xmlValidatePopElement(
    ctxt: xmlValidCtxtPtr,
    doc: xmlDocPtr,
    elem: xmlNodePtr,
    qname: *const xmlChar,
  ) -> ::std::os::raw::c_int;
}
pub const xmlEntityType_XML_INTERNAL_GENERAL_ENTITY: xmlEntityType = 1;
pub const xmlEntityType_XML_EXTERNAL_GENERAL_PARSED_ENTITY: xmlEntityType = 2;
pub const xmlEntityType_XML_EXTERNAL_GENERAL_UNPARSED_ENTITY: xmlEntityType = 3;
pub const xmlEntityType_XML_INTERNAL_PARAMETER_ENTITY: xmlEntityType = 4;
pub const xmlEntityType_XML_EXTERNAL_PARAMETER_ENTITY: xmlEntityType = 5;
pub const xmlEntityType_XML_INTERNAL_PREDEFINED_ENTITY: xmlEntityType = 6;
pub type xmlEntityType = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlEntity {
  pub _private: *mut ::std::os::raw::c_void,
  pub type_: xmlElementType,
  pub name: *const xmlChar,
  pub children: *mut _xmlNode,
  pub last: *mut _xmlNode,
  pub parent: *mut _xmlDtd,
  pub next: *mut _xmlNode,
  pub prev: *mut _xmlNode,
  pub doc: *mut _xmlDoc,
  pub orig: *mut xmlChar,
  pub content: *mut xmlChar,
  pub length: ::std::os::raw::c_int,
  pub etype: xmlEntityType,
  pub ExternalID: *const xmlChar,
  pub SystemID: *const xmlChar,
  pub nexte: *mut _xmlEntity,
  pub URI: *const xmlChar,
  pub owner: ::std::os::raw::c_int,
  pub checked: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__xmlEntity() {
  assert_eq!(
    ::std::mem::size_of::<_xmlEntity>(),
    136usize,
    concat!("Size of: ", stringify!(_xmlEntity))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlEntity>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlEntity))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>()))._private as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).type_ as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(type_)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).name as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).children as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(children)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).last as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(last)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).parent as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(parent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).next as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(next)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).prev as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(prev)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).doc as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(doc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).orig as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(orig)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).content as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(content)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).length as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(length)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).etype as *const _ as usize },
    92usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(etype)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).ExternalID as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(ExternalID)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).SystemID as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(SystemID)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).nexte as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(nexte)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).URI as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(URI)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).owner as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(owner)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlEntity>())).checked as *const _ as usize },
    132usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlEntity),
      "::",
      stringify!(checked)
    )
  );
}
pub type xmlEntitiesTable = _xmlHashTable;
pub type xmlEntitiesTablePtr = *mut xmlEntitiesTable;
extern "C" {
  pub fn xmlInitializePredefinedEntities();
}
extern "C" {
  pub fn xmlNewEntity(
    doc: xmlDocPtr,
    name: *const xmlChar,
    type_: ::std::os::raw::c_int,
    ExternalID: *const xmlChar,
    SystemID: *const xmlChar,
    content: *const xmlChar,
  ) -> xmlEntityPtr;
}
extern "C" {
  pub fn xmlAddDocEntity(
    doc: xmlDocPtr,
    name: *const xmlChar,
    type_: ::std::os::raw::c_int,
    ExternalID: *const xmlChar,
    SystemID: *const xmlChar,
    content: *const xmlChar,
  ) -> xmlEntityPtr;
}
extern "C" {
  pub fn xmlAddDtdEntity(
    doc: xmlDocPtr,
    name: *const xmlChar,
    type_: ::std::os::raw::c_int,
    ExternalID: *const xmlChar,
    SystemID: *const xmlChar,
    content: *const xmlChar,
  ) -> xmlEntityPtr;
}
extern "C" {
  pub fn xmlGetPredefinedEntity(name: *const xmlChar) -> xmlEntityPtr;
}
extern "C" {
  pub fn xmlGetDocEntity(doc: *const xmlDoc, name: *const xmlChar) -> xmlEntityPtr;
}
extern "C" {
  pub fn xmlGetDtdEntity(doc: xmlDocPtr, name: *const xmlChar) -> xmlEntityPtr;
}
extern "C" {
  pub fn xmlGetParameterEntity(doc: xmlDocPtr, name: *const xmlChar) -> xmlEntityPtr;
}
extern "C" {
  pub fn xmlEncodeEntities(doc: xmlDocPtr, input: *const xmlChar) -> *const xmlChar;
}
extern "C" {
  pub fn xmlEncodeEntitiesReentrant(doc: xmlDocPtr, input: *const xmlChar) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlEncodeSpecialChars(doc: *const xmlDoc, input: *const xmlChar) -> *mut xmlChar;
}
extern "C" {
  pub fn xmlCreateEntitiesTable() -> xmlEntitiesTablePtr;
}
extern "C" {
  pub fn xmlCopyEntitiesTable(table: xmlEntitiesTablePtr) -> xmlEntitiesTablePtr;
}
extern "C" {
  pub fn xmlFreeEntitiesTable(table: xmlEntitiesTablePtr);
}
extern "C" {
  pub fn xmlDumpEntitiesTable(buf: xmlBufferPtr, table: xmlEntitiesTablePtr);
}
extern "C" {
  pub fn xmlDumpEntityDecl(buf: xmlBufferPtr, ent: xmlEntityPtr);
}
extern "C" {
  pub fn xmlCleanupPredefinedEntities();
}
/// xmlParserInputDeallocate:
/// @str:  the string to deallocate
///
/// Callback for freeing some parser input allocations.
pub type xmlParserInputDeallocate = ::std::option::Option<unsafe extern "C" fn(str: *mut xmlChar)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlParserInput {
  pub buf: xmlParserInputBufferPtr,
  pub filename: *const ::std::os::raw::c_char,
  pub directory: *const ::std::os::raw::c_char,
  pub base: *const xmlChar,
  pub cur: *const xmlChar,
  pub end: *const xmlChar,
  pub length: ::std::os::raw::c_int,
  pub line: ::std::os::raw::c_int,
  pub col: ::std::os::raw::c_int,
  pub consumed: ::std::os::raw::c_ulong,
  pub free: xmlParserInputDeallocate,
  pub encoding: *const xmlChar,
  pub version: *const xmlChar,
  pub standalone: ::std::os::raw::c_int,
  pub id: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__xmlParserInput() {
  assert_eq!(
    ::std::mem::size_of::<_xmlParserInput>(),
    104usize,
    concat!("Size of: ", stringify!(_xmlParserInput))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlParserInput>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlParserInput))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).buf as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(buf)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).filename as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(filename)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).directory as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(directory)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).base as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(base)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).cur as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(cur)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).end as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(end)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).length as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(length)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).line as *const _ as usize },
    52usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(line)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).col as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(col)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).consumed as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(consumed)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).free as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(free)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).encoding as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(encoding)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).version as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(version)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).standalone as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(standalone)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserInput>())).id as *const _ as usize },
    100usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserInput),
      "::",
      stringify!(id)
    )
  );
}
/// xmlParserNodeInfo:
///
/// The parser can be asked to collect Node informations, i.e. at what
/// place in the file they were detected.
/// NOTE: This is off by default and not very well tested.
pub type xmlParserNodeInfo = _xmlParserNodeInfo;
pub type xmlParserNodeInfoPtr = *mut xmlParserNodeInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlParserNodeInfo {
  pub node: *const _xmlNode,
  pub begin_pos: ::std::os::raw::c_ulong,
  pub begin_line: ::std::os::raw::c_ulong,
  pub end_pos: ::std::os::raw::c_ulong,
  pub end_line: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__xmlParserNodeInfo() {
  assert_eq!(
    ::std::mem::size_of::<_xmlParserNodeInfo>(),
    40usize,
    concat!("Size of: ", stringify!(_xmlParserNodeInfo))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlParserNodeInfo>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlParserNodeInfo))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfo>())).node as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfo),
      "::",
      stringify!(node)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfo>())).begin_pos as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfo),
      "::",
      stringify!(begin_pos)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfo>())).begin_line as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfo),
      "::",
      stringify!(begin_line)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfo>())).end_pos as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfo),
      "::",
      stringify!(end_pos)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfo>())).end_line as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfo),
      "::",
      stringify!(end_line)
    )
  );
}
pub type xmlParserNodeInfoSeq = _xmlParserNodeInfoSeq;
pub type xmlParserNodeInfoSeqPtr = *mut xmlParserNodeInfoSeq;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlParserNodeInfoSeq {
  pub maximum: ::std::os::raw::c_ulong,
  pub length: ::std::os::raw::c_ulong,
  pub buffer: *mut xmlParserNodeInfo,
}
#[test]
fn bindgen_test_layout__xmlParserNodeInfoSeq() {
  assert_eq!(
    ::std::mem::size_of::<_xmlParserNodeInfoSeq>(),
    24usize,
    concat!("Size of: ", stringify!(_xmlParserNodeInfoSeq))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlParserNodeInfoSeq>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlParserNodeInfoSeq))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfoSeq>())).maximum as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfoSeq),
      "::",
      stringify!(maximum)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfoSeq>())).length as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfoSeq),
      "::",
      stringify!(length)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserNodeInfoSeq>())).buffer as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserNodeInfoSeq),
      "::",
      stringify!(buffer)
    )
  );
}
pub const xmlParserInputState_XML_PARSER_EOF: xmlParserInputState = -1;
pub const xmlParserInputState_XML_PARSER_START: xmlParserInputState = 0;
pub const xmlParserInputState_XML_PARSER_MISC: xmlParserInputState = 1;
pub const xmlParserInputState_XML_PARSER_PI: xmlParserInputState = 2;
pub const xmlParserInputState_XML_PARSER_DTD: xmlParserInputState = 3;
pub const xmlParserInputState_XML_PARSER_PROLOG: xmlParserInputState = 4;
pub const xmlParserInputState_XML_PARSER_COMMENT: xmlParserInputState = 5;
pub const xmlParserInputState_XML_PARSER_START_TAG: xmlParserInputState = 6;
pub const xmlParserInputState_XML_PARSER_CONTENT: xmlParserInputState = 7;
pub const xmlParserInputState_XML_PARSER_CDATA_SECTION: xmlParserInputState = 8;
pub const xmlParserInputState_XML_PARSER_END_TAG: xmlParserInputState = 9;
pub const xmlParserInputState_XML_PARSER_ENTITY_DECL: xmlParserInputState = 10;
pub const xmlParserInputState_XML_PARSER_ENTITY_VALUE: xmlParserInputState = 11;
pub const xmlParserInputState_XML_PARSER_ATTRIBUTE_VALUE: xmlParserInputState = 12;
pub const xmlParserInputState_XML_PARSER_SYSTEM_LITERAL: xmlParserInputState = 13;
pub const xmlParserInputState_XML_PARSER_EPILOG: xmlParserInputState = 14;
pub const xmlParserInputState_XML_PARSER_IGNORE: xmlParserInputState = 15;
pub const xmlParserInputState_XML_PARSER_PUBLIC_LITERAL: xmlParserInputState = 16;
/// xmlParserInputState:
///
/// The parser is now working also as a state based parser.
/// The recursive one use the state info for entities processing.
pub type xmlParserInputState = i32;
pub const xmlParserMode_XML_PARSE_UNKNOWN: xmlParserMode = 0;
pub const xmlParserMode_XML_PARSE_DOM: xmlParserMode = 1;
pub const xmlParserMode_XML_PARSE_SAX: xmlParserMode = 2;
pub const xmlParserMode_XML_PARSE_PUSH_DOM: xmlParserMode = 3;
pub const xmlParserMode_XML_PARSE_PUSH_SAX: xmlParserMode = 4;
pub const xmlParserMode_XML_PARSE_READER: xmlParserMode = 5;
/// xmlParserMode:
///
/// A parser can operate in various modes
pub type xmlParserMode = u32;
/// xmlParserCtxt:
///
/// The parser context.
/// NOTE This doesn't completely define the parser state, the (current ?)
/// design of the parser uses recursive function calls since this allow
/// and easy mapping from the production rules of the specification
/// to the actual code. The drawback is that the actual function call
/// also reflect the parser state. However most of the parsing routines
/// takes as the only argument the parser context pointer, so migrating
/// to a state based parser for progressive parsing shouldn't be too hard.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlParserCtxt {
  pub sax: *mut _xmlSAXHandler,
  pub userData: *mut ::std::os::raw::c_void,
  pub myDoc: xmlDocPtr,
  pub wellFormed: ::std::os::raw::c_int,
  pub replaceEntities: ::std::os::raw::c_int,
  pub version: *const xmlChar,
  pub encoding: *const xmlChar,
  pub standalone: ::std::os::raw::c_int,
  pub html: ::std::os::raw::c_int,
  pub input: xmlParserInputPtr,
  pub inputNr: ::std::os::raw::c_int,
  pub inputMax: ::std::os::raw::c_int,
  pub inputTab: *mut xmlParserInputPtr,
  pub node: xmlNodePtr,
  pub nodeNr: ::std::os::raw::c_int,
  pub nodeMax: ::std::os::raw::c_int,
  pub nodeTab: *mut xmlNodePtr,
  pub record_info: ::std::os::raw::c_int,
  pub node_seq: xmlParserNodeInfoSeq,
  pub errNo: ::std::os::raw::c_int,
  pub hasExternalSubset: ::std::os::raw::c_int,
  pub hasPErefs: ::std::os::raw::c_int,
  pub external: ::std::os::raw::c_int,
  pub valid: ::std::os::raw::c_int,
  pub validate: ::std::os::raw::c_int,
  pub vctxt: xmlValidCtxt,
  pub instate: xmlParserInputState,
  pub token: ::std::os::raw::c_int,
  pub directory: *mut ::std::os::raw::c_char,
  pub name: *const xmlChar,
  pub nameNr: ::std::os::raw::c_int,
  pub nameMax: ::std::os::raw::c_int,
  pub nameTab: *mut *const xmlChar,
  pub nbChars: ::std::os::raw::c_long,
  pub checkIndex: ::std::os::raw::c_long,
  pub keepBlanks: ::std::os::raw::c_int,
  pub disableSAX: ::std::os::raw::c_int,
  pub inSubset: ::std::os::raw::c_int,
  pub intSubName: *const xmlChar,
  pub extSubURI: *mut xmlChar,
  pub extSubSystem: *mut xmlChar,
  pub space: *mut ::std::os::raw::c_int,
  pub spaceNr: ::std::os::raw::c_int,
  pub spaceMax: ::std::os::raw::c_int,
  pub spaceTab: *mut ::std::os::raw::c_int,
  pub depth: ::std::os::raw::c_int,
  pub entity: xmlParserInputPtr,
  pub charset: ::std::os::raw::c_int,
  pub nodelen: ::std::os::raw::c_int,
  pub nodemem: ::std::os::raw::c_int,
  pub pedantic: ::std::os::raw::c_int,
  pub _private: *mut ::std::os::raw::c_void,
  pub loadsubset: ::std::os::raw::c_int,
  pub linenumbers: ::std::os::raw::c_int,
  pub catalogs: *mut ::std::os::raw::c_void,
  pub recovery: ::std::os::raw::c_int,
  pub progressive: ::std::os::raw::c_int,
  pub dict: xmlDictPtr,
  pub atts: *mut *const xmlChar,
  pub maxatts: ::std::os::raw::c_int,
  pub docdict: ::std::os::raw::c_int,
  pub str_xml: *const xmlChar,
  pub str_xmlns: *const xmlChar,
  pub str_xml_ns: *const xmlChar,
  pub sax2: ::std::os::raw::c_int,
  pub nsNr: ::std::os::raw::c_int,
  pub nsMax: ::std::os::raw::c_int,
  pub nsTab: *mut *const xmlChar,
  pub attallocs: *mut ::std::os::raw::c_int,
  pub pushTab: *mut *mut ::std::os::raw::c_void,
  pub attsDefault: xmlHashTablePtr,
  pub attsSpecial: xmlHashTablePtr,
  pub nsWellFormed: ::std::os::raw::c_int,
  pub options: ::std::os::raw::c_int,
  pub dictNames: ::std::os::raw::c_int,
  pub freeElemsNr: ::std::os::raw::c_int,
  pub freeElems: xmlNodePtr,
  pub freeAttrsNr: ::std::os::raw::c_int,
  pub freeAttrs: xmlAttrPtr,
  pub lastError: xmlError,
  pub parseMode: xmlParserMode,
  pub nbentities: ::std::os::raw::c_ulong,
  pub sizeentities: ::std::os::raw::c_ulong,
  pub nodeInfo: *mut xmlParserNodeInfo,
  pub nodeInfoNr: ::std::os::raw::c_int,
  pub nodeInfoMax: ::std::os::raw::c_int,
  pub nodeInfoTab: *mut xmlParserNodeInfo,
  pub input_id: ::std::os::raw::c_int,
  pub sizeentcopy: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__xmlParserCtxt() {
  assert_eq!(
    ::std::mem::size_of::<_xmlParserCtxt>(),
    752usize,
    concat!("Size of: ", stringify!(_xmlParserCtxt))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlParserCtxt>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlParserCtxt))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).sax as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(sax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).userData as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(userData)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).myDoc as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(myDoc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).wellFormed as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(wellFormed)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).replaceEntities as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(replaceEntities)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).version as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(version)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).encoding as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(encoding)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).standalone as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(standalone)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).html as *const _ as usize },
    52usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(html)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).input as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(input)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).inputNr as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(inputNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).inputMax as *const _ as usize },
    68usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(inputMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).inputTab as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(inputTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).node as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(node)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodeNr as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodeNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodeMax as *const _ as usize },
    92usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodeMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodeTab as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodeTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).record_info as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(record_info)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).node_seq as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(node_seq)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).errNo as *const _ as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(errNo)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).hasExternalSubset as *const _ as usize },
    140usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(hasExternalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).hasPErefs as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(hasPErefs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).external as *const _ as usize },
    148usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(external)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).valid as *const _ as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(valid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).validate as *const _ as usize },
    156usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(validate)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).vctxt as *const _ as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(vctxt)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).instate as *const _ as usize },
    272usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(instate)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).token as *const _ as usize },
    276usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(token)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).directory as *const _ as usize },
    280usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(directory)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).name as *const _ as usize },
    288usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nameNr as *const _ as usize },
    296usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nameNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nameMax as *const _ as usize },
    300usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nameMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nameTab as *const _ as usize },
    304usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nameTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nbChars as *const _ as usize },
    312usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nbChars)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).checkIndex as *const _ as usize },
    320usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(checkIndex)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).keepBlanks as *const _ as usize },
    328usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(keepBlanks)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).disableSAX as *const _ as usize },
    332usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(disableSAX)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).inSubset as *const _ as usize },
    336usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(inSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).intSubName as *const _ as usize },
    344usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(intSubName)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).extSubURI as *const _ as usize },
    352usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(extSubURI)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).extSubSystem as *const _ as usize },
    360usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(extSubSystem)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).space as *const _ as usize },
    368usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(space)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).spaceNr as *const _ as usize },
    376usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(spaceNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).spaceMax as *const _ as usize },
    380usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(spaceMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).spaceTab as *const _ as usize },
    384usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(spaceTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).depth as *const _ as usize },
    392usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(depth)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).entity as *const _ as usize },
    400usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(entity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).charset as *const _ as usize },
    408usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(charset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodelen as *const _ as usize },
    412usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodelen)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodemem as *const _ as usize },
    416usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodemem)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).pedantic as *const _ as usize },
    420usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(pedantic)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>()))._private as *const _ as usize },
    424usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).loadsubset as *const _ as usize },
    432usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(loadsubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).linenumbers as *const _ as usize },
    436usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(linenumbers)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).catalogs as *const _ as usize },
    440usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(catalogs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).recovery as *const _ as usize },
    448usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(recovery)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).progressive as *const _ as usize },
    452usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(progressive)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).dict as *const _ as usize },
    456usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(dict)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).atts as *const _ as usize },
    464usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(atts)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).maxatts as *const _ as usize },
    472usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(maxatts)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).docdict as *const _ as usize },
    476usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(docdict)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).str_xml as *const _ as usize },
    480usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(str_xml)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).str_xmlns as *const _ as usize },
    488usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(str_xmlns)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).str_xml_ns as *const _ as usize },
    496usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(str_xml_ns)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).sax2 as *const _ as usize },
    504usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(sax2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nsNr as *const _ as usize },
    508usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nsNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nsMax as *const _ as usize },
    512usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nsMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nsTab as *const _ as usize },
    520usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nsTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).attallocs as *const _ as usize },
    528usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(attallocs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).pushTab as *const _ as usize },
    536usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(pushTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).attsDefault as *const _ as usize },
    544usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(attsDefault)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).attsSpecial as *const _ as usize },
    552usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(attsSpecial)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nsWellFormed as *const _ as usize },
    560usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nsWellFormed)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).options as *const _ as usize },
    564usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(options)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).dictNames as *const _ as usize },
    568usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(dictNames)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).freeElemsNr as *const _ as usize },
    572usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(freeElemsNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).freeElems as *const _ as usize },
    576usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(freeElems)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).freeAttrsNr as *const _ as usize },
    584usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(freeAttrsNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).freeAttrs as *const _ as usize },
    592usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(freeAttrs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).lastError as *const _ as usize },
    600usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(lastError)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).parseMode as *const _ as usize },
    688usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(parseMode)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nbentities as *const _ as usize },
    696usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nbentities)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).sizeentities as *const _ as usize },
    704usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(sizeentities)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodeInfo as *const _ as usize },
    712usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodeInfo)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodeInfoNr as *const _ as usize },
    720usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodeInfoNr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodeInfoMax as *const _ as usize },
    724usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodeInfoMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).nodeInfoTab as *const _ as usize },
    728usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(nodeInfoTab)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).input_id as *const _ as usize },
    736usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(input_id)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlParserCtxt>())).sizeentcopy as *const _ as usize },
    744usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlParserCtxt),
      "::",
      stringify!(sizeentcopy)
    )
  );
}
/// xmlSAXLocator:
///
/// A SAX Locator.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlSAXLocator {
  pub getPublicId:
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> *const xmlChar>,
  pub getSystemId:
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> *const xmlChar>,
  pub getLineNumber: ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
  >,
  pub getColumnNumber: ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
  >,
}
#[test]
fn bindgen_test_layout__xmlSAXLocator() {
  assert_eq!(
    ::std::mem::size_of::<_xmlSAXLocator>(),
    32usize,
    concat!("Size of: ", stringify!(_xmlSAXLocator))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlSAXLocator>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlSAXLocator))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXLocator>())).getPublicId as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXLocator),
      "::",
      stringify!(getPublicId)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXLocator>())).getSystemId as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXLocator),
      "::",
      stringify!(getSystemId)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXLocator>())).getLineNumber as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXLocator),
      "::",
      stringify!(getLineNumber)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXLocator>())).getColumnNumber as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXLocator),
      "::",
      stringify!(getColumnNumber)
    )
  );
}
/// resolveEntitySAXFunc:
/// @ctx:  the user data (XML parser context)
/// @publicId: The public ID of the entity
/// @systemId: The system ID of the entity
///
/// Callback:
/// The entity loader, to control the loading of external entities,
/// the application can either:
/// - override this resolveEntity() callback in the SAX block
/// - or better use the xmlSetExternalEntityLoader() function to
/// set up it's own entity resolution routine
///
/// Returns the xmlParserInputPtr if inlined or NULL for DOM behaviour.
pub type resolveEntitySAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    publicId: *const xmlChar,
    systemId: *const xmlChar,
  ) -> xmlParserInputPtr,
>;
/// internalSubsetSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  the root element name
/// @ExternalID:  the external ID
/// @SystemID:  the SYSTEM ID (e.g. filename or URL)
///
/// Callback on internal subset declaration.
pub type internalSubsetSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    ExternalID: *const xmlChar,
    SystemID: *const xmlChar,
  ),
>;
/// externalSubsetSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  the root element name
/// @ExternalID:  the external ID
/// @SystemID:  the SYSTEM ID (e.g. filename or URL)
///
/// Callback on external subset declaration.
pub type externalSubsetSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    ExternalID: *const xmlChar,
    SystemID: *const xmlChar,
  ),
>;
/// getEntitySAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name: The entity name
///
/// Get an entity by name.
///
/// Returns the xmlEntityPtr if found.
pub type getEntitySAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, name: *const xmlChar) -> xmlEntityPtr,
>;
/// getParameterEntitySAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name: The entity name
///
/// Get a parameter entity by name.
///
/// Returns the xmlEntityPtr if found.
pub type getParameterEntitySAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, name: *const xmlChar) -> xmlEntityPtr,
>;
/// entityDeclSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  the entity name
/// @type:  the entity type
/// @publicId: The public ID of the entity
/// @systemId: The system ID of the entity
/// @content: the entity value (without processing).
///
/// An entity definition has been parsed.
pub type entityDeclSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    type_: ::std::os::raw::c_int,
    publicId: *const xmlChar,
    systemId: *const xmlChar,
    content: *mut xmlChar,
  ),
>;
/// notationDeclSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name: The name of the notation
/// @publicId: The public ID of the entity
/// @systemId: The system ID of the entity
///
/// What to do when a notation declaration has been parsed.
pub type notationDeclSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    publicId: *const xmlChar,
    systemId: *const xmlChar,
  ),
>;
/// attributeDeclSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @elem:  the name of the element
/// @fullname:  the attribute name
/// @type:  the attribute type
/// @def:  the type of default value
/// @defaultValue: the attribute default value
/// @tree:  the tree of enumerated value set
///
/// An attribute definition has been parsed.
pub type attributeDeclSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    elem: *const xmlChar,
    fullname: *const xmlChar,
    type_: ::std::os::raw::c_int,
    def: ::std::os::raw::c_int,
    defaultValue: *const xmlChar,
    tree: xmlEnumerationPtr,
  ),
>;
/// elementDeclSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  the element name
/// @type:  the element type
/// @content: the element value tree
///
/// An element definition has been parsed.
pub type elementDeclSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    type_: ::std::os::raw::c_int,
    content: xmlElementContentPtr,
  ),
>;
/// unparsedEntityDeclSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name: The name of the entity
/// @publicId: The public ID of the entity
/// @systemId: The system ID of the entity
/// @notationName: the name of the notation
///
/// What to do when an unparsed entity declaration is parsed.
pub type unparsedEntityDeclSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    publicId: *const xmlChar,
    systemId: *const xmlChar,
    notationName: *const xmlChar,
  ),
>;
/// setDocumentLocatorSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @loc: A SAX Locator
///
/// Receive the document locator at startup, actually xmlDefaultSAXLocator.
/// Everything is available on the context, so this is useless in our case.
pub type setDocumentLocatorSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, loc: xmlSAXLocatorPtr),
>;
/// startDocumentSAXFunc:
/// @ctx:  the user data (XML parser context)
///
/// Called when the document start being processed.
pub type startDocumentSAXFunc =
  ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>;
/// endDocumentSAXFunc:
/// @ctx:  the user data (XML parser context)
///
/// Called when the document end has been detected.
pub type endDocumentSAXFunc =
  ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>;
/// startElementSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  The element name, including namespace prefix
/// @atts:  An array of name/value attributes pairs, NULL terminated
///
/// Called when an opening tag has been processed.
pub type startElementSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    atts: *mut *const xmlChar,
  ),
>;
/// endElementSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  The element name
///
/// Called when the end of an element has been detected.
pub type endElementSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, name: *const xmlChar),
>;
/// attributeSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  The attribute name, including namespace prefix
/// @value:  The attribute value
///
/// Handle an attribute that has been read by the parser.
/// The default handling is to convert the attribute into an
/// DOM subtree and past it in a new xmlAttr element added to
/// the element.
pub type attributeSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    name: *const xmlChar,
    value: *const xmlChar,
  ),
>;
/// referenceSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @name:  The entity name
///
/// Called when an entity reference is detected.
pub type referenceSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, name: *const xmlChar),
>;
/// charactersSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @ch:  a xmlChar string
/// @len: the number of xmlChar
///
/// Receiving some chars from the parser.
pub type charactersSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    ch: *const xmlChar,
    len: ::std::os::raw::c_int,
  ),
>;
/// ignorableWhitespaceSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @ch:  a xmlChar string
/// @len: the number of xmlChar
///
/// Receiving some ignorable whitespaces from the parser.
/// UNUSED: by default the DOM building will use characters.
pub type ignorableWhitespaceSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    ch: *const xmlChar,
    len: ::std::os::raw::c_int,
  ),
>;
/// processingInstructionSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @target:  the target name
/// @data: the PI data's
///
/// A processing instruction has been parsed.
pub type processingInstructionSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    target: *const xmlChar,
    data: *const xmlChar,
  ),
>;
/// commentSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @value:  the comment content
///
/// A comment has been parsed.
pub type commentSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, value: *const xmlChar),
>;
/// cdataBlockSAXFunc:
/// @ctx:  the user data (XML parser context)
/// @value:  The pcdata content
/// @len:  the block length
///
/// Called when a pcdata block has been parsed.
pub type cdataBlockSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    value: *const xmlChar,
    len: ::std::os::raw::c_int,
  ),
>;
/// warningSAXFunc:
/// @ctx:  an XML parser context
/// @msg:  the message to display/transmit
/// @...:  extra parameters for the message display
///
/// Display and format a warning messages, callback.
pub type warningSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, msg: *const ::std::os::raw::c_char, ...),
>;
/// errorSAXFunc:
/// @ctx:  an XML parser context
/// @msg:  the message to display/transmit
/// @...:  extra parameters for the message display
///
/// Display and format an error messages, callback.
pub type errorSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, msg: *const ::std::os::raw::c_char, ...),
>;
/// fatalErrorSAXFunc:
/// @ctx:  an XML parser context
/// @msg:  the message to display/transmit
/// @...:  extra parameters for the message display
///
/// Display and format fatal error messages, callback.
/// Note: so far fatalError() SAX callbacks are not used, error()
/// get all the callbacks for errors.
pub type fatalErrorSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, msg: *const ::std::os::raw::c_char, ...),
>;
/// isStandaloneSAXFunc:
/// @ctx:  the user data (XML parser context)
///
/// Is this document tagged standalone?
///
/// Returns 1 if true
pub type isStandaloneSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
/// hasInternalSubsetSAXFunc:
/// @ctx:  the user data (XML parser context)
///
/// Does this document has an internal subset.
///
/// Returns 1 if true
pub type hasInternalSubsetSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
/// hasExternalSubsetSAXFunc:
/// @ctx:  the user data (XML parser context)
///
/// Does this document has an external subset?
///
/// Returns 1 if true
pub type hasExternalSubsetSAXFunc = ::std::option::Option<
  unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
/// startElementNsSAX2Func:
/// @ctx:  the user data (XML parser context)
/// @localname:  the local name of the element
/// @prefix:  the element namespace prefix if available
/// @URI:  the element namespace name if available
/// @nb_namespaces:  number of namespace definitions on that node
/// @namespaces:  pointer to the array of prefix/URI pairs namespace definitions
/// @nb_attributes:  the number of attributes on that node
/// @nb_defaulted:  the number of defaulted attributes. The defaulted
/// ones are at the end of the array
/// @attributes:  pointer to the array of (localname/prefix/URI/value/end)
/// attribute values.
///
/// SAX2 callback when an element start has been detected by the parser.
/// It provides the namespace informations for the element, as well as
/// the new namespace declarations on the element.
pub type startElementNsSAX2Func = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    localname: *const xmlChar,
    prefix: *const xmlChar,
    URI: *const xmlChar,
    nb_namespaces: ::std::os::raw::c_int,
    namespaces: *mut *const xmlChar,
    nb_attributes: ::std::os::raw::c_int,
    nb_defaulted: ::std::os::raw::c_int,
    attributes: *mut *const xmlChar,
  ),
>;
/// endElementNsSAX2Func:
/// @ctx:  the user data (XML parser context)
/// @localname:  the local name of the element
/// @prefix:  the element namespace prefix if available
/// @URI:  the element namespace name if available
///
/// SAX2 callback when an element end has been detected by the parser.
/// It provides the namespace informations for the element.
pub type endElementNsSAX2Func = ::std::option::Option<
  unsafe extern "C" fn(
    ctx: *mut ::std::os::raw::c_void,
    localname: *const xmlChar,
    prefix: *const xmlChar,
    URI: *const xmlChar,
  ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlSAXHandler {
  pub internalSubset: internalSubsetSAXFunc,
  pub isStandalone: isStandaloneSAXFunc,
  pub hasInternalSubset: hasInternalSubsetSAXFunc,
  pub hasExternalSubset: hasExternalSubsetSAXFunc,
  pub resolveEntity: resolveEntitySAXFunc,
  pub getEntity: getEntitySAXFunc,
  pub entityDecl: entityDeclSAXFunc,
  pub notationDecl: notationDeclSAXFunc,
  pub attributeDecl: attributeDeclSAXFunc,
  pub elementDecl: elementDeclSAXFunc,
  pub unparsedEntityDecl: unparsedEntityDeclSAXFunc,
  pub setDocumentLocator: setDocumentLocatorSAXFunc,
  pub startDocument: startDocumentSAXFunc,
  pub endDocument: endDocumentSAXFunc,
  pub startElement: startElementSAXFunc,
  pub endElement: endElementSAXFunc,
  pub reference: referenceSAXFunc,
  pub characters: charactersSAXFunc,
  pub ignorableWhitespace: ignorableWhitespaceSAXFunc,
  pub processingInstruction: processingInstructionSAXFunc,
  pub comment: commentSAXFunc,
  pub warning: warningSAXFunc,
  pub error: errorSAXFunc,
  pub fatalError: fatalErrorSAXFunc,
  pub getParameterEntity: getParameterEntitySAXFunc,
  pub cdataBlock: cdataBlockSAXFunc,
  pub externalSubset: externalSubsetSAXFunc,
  pub initialized: ::std::os::raw::c_uint,
  pub _private: *mut ::std::os::raw::c_void,
  pub startElementNs: startElementNsSAX2Func,
  pub endElementNs: endElementNsSAX2Func,
  pub serror: xmlStructuredErrorFunc,
}
#[test]
fn bindgen_test_layout__xmlSAXHandler() {
  assert_eq!(
    ::std::mem::size_of::<_xmlSAXHandler>(),
    256usize,
    concat!("Size of: ", stringify!(_xmlSAXHandler))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlSAXHandler>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlSAXHandler))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).internalSubset as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(internalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).isStandalone as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(isStandalone)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).hasInternalSubset as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(hasInternalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).hasExternalSubset as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(hasExternalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).resolveEntity as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(resolveEntity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).getEntity as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(getEntity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).entityDecl as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(entityDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).notationDecl as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(notationDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).attributeDecl as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(attributeDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).elementDecl as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(elementDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).unparsedEntityDecl as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(unparsedEntityDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).setDocumentLocator as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(setDocumentLocator)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).startDocument as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(startDocument)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).endDocument as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(endDocument)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).startElement as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(startElement)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).endElement as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(endElement)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).reference as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(reference)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).characters as *const _ as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(characters)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).ignorableWhitespace as *const _ as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(ignorableWhitespace)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_xmlSAXHandler>())).processingInstruction as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(processingInstruction)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).comment as *const _ as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(comment)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).warning as *const _ as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(warning)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).error as *const _ as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(error)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).fatalError as *const _ as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(fatalError)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).getParameterEntity as *const _ as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(getParameterEntity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).cdataBlock as *const _ as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(cdataBlock)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).externalSubset as *const _ as usize },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(externalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).initialized as *const _ as usize },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(initialized)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>()))._private as *const _ as usize },
    224usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(_private)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).startElementNs as *const _ as usize },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(startElementNs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).endElementNs as *const _ as usize },
    240usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(endElementNs)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandler>())).serror as *const _ as usize },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandler),
      "::",
      stringify!(serror)
    )
  );
}
pub type xmlSAXHandlerV1 = _xmlSAXHandlerV1;
pub type xmlSAXHandlerV1Ptr = *mut xmlSAXHandlerV1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmlSAXHandlerV1 {
  pub internalSubset: internalSubsetSAXFunc,
  pub isStandalone: isStandaloneSAXFunc,
  pub hasInternalSubset: hasInternalSubsetSAXFunc,
  pub hasExternalSubset: hasExternalSubsetSAXFunc,
  pub resolveEntity: resolveEntitySAXFunc,
  pub getEntity: getEntitySAXFunc,
  pub entityDecl: entityDeclSAXFunc,
  pub notationDecl: notationDeclSAXFunc,
  pub attributeDecl: attributeDeclSAXFunc,
  pub elementDecl: elementDeclSAXFunc,
  pub unparsedEntityDecl: unparsedEntityDeclSAXFunc,
  pub setDocumentLocator: setDocumentLocatorSAXFunc,
  pub startDocument: startDocumentSAXFunc,
  pub endDocument: endDocumentSAXFunc,
  pub startElement: startElementSAXFunc,
  pub endElement: endElementSAXFunc,
  pub reference: referenceSAXFunc,
  pub characters: charactersSAXFunc,
  pub ignorableWhitespace: ignorableWhitespaceSAXFunc,
  pub processingInstruction: processingInstructionSAXFunc,
  pub comment: commentSAXFunc,
  pub warning: warningSAXFunc,
  pub error: errorSAXFunc,
  pub fatalError: fatalErrorSAXFunc,
  pub getParameterEntity: getParameterEntitySAXFunc,
  pub cdataBlock: cdataBlockSAXFunc,
  pub externalSubset: externalSubsetSAXFunc,
  pub initialized: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout__xmlSAXHandlerV1() {
  assert_eq!(
    ::std::mem::size_of::<_xmlSAXHandlerV1>(),
    224usize,
    concat!("Size of: ", stringify!(_xmlSAXHandlerV1))
  );
  assert_eq!(
    ::std::mem::align_of::<_xmlSAXHandlerV1>(),
    8usize,
    concat!("Alignment of ", stringify!(_xmlSAXHandlerV1))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).internalSubset as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(internalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).isStandalone as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(isStandalone)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).hasInternalSubset as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(hasInternalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).hasExternalSubset as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(hasExternalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).resolveEntity as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(resolveEntity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).getEntity as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(getEntity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).entityDecl as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(entityDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).notationDecl as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(notationDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).attributeDecl as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(attributeDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).elementDecl as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(elementDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).unparsedEntityDecl as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(unparsedEntityDecl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).setDocumentLocator as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(setDocumentLocator)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).startDocument as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(startDocument)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).endDocument as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(endDocument)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).startElement as *const _ as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(startElement)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).endElement as *const _ as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(endElement)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).reference as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(reference)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).characters as *const _ as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(characters)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).ignorableWhitespace as *const _ as usize
    },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(ignorableWhitespace)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).processingInstruction as *const _ as usize
    },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(processingInstruction)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).comment as *const _ as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(comment)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).warning as *const _ as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(warning)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).error as *const _ as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(error)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).fatalError as *const _ as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(fatalError)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).getParameterEntity as *const _ as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(getParameterEntity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).cdataBlock as *const _ as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(cdataBlock)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).externalSubset as *const _ as usize },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(externalSubset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_xmlSAXHandlerV1>())).initialized as *const _ as usize },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(_xmlSAXHandlerV1),
      "::",
      stringify!(initialized)
    )
  );
}
/// xmlExternalEntityLoader:
/// @URL: The System ID of the resource requested
/// @ID: The Public ID of the resource requested
/// @context: the XML parser context
///
/// External entity loaders types.
///
/// Returns the entity input parser.
pub type xmlExternalEntityLoader = ::std::option::Option<
  unsafe extern "C" fn(
    URL: *const ::std::os::raw::c_char,
    ID: *const ::std::os::raw::c_char,
    context: xmlParserCtxtPtr,
  ) -> xmlParserInputPtr,
>;
pub type iconv_t = *mut ::std::os::raw::c_void;
extern "C" {
  pub fn iconv_open(
    __tocode: *const ::std::os::raw::c_char,
    __fromcode: *const ::std::os::raw::c_char,
  ) -> iconv_t;
}
extern "C" {
  pub fn iconv(
    __cd: iconv_t,
    __inbuf: *mut *mut ::std::os::raw::c_char,
    __inbytesleft: *mut usize,
    __outbuf: *mut *mut ::std::os::raw::c_char,
    __outbytesleft: *mut usize,
  ) -> usize;
}
extern "C" {
  pub fn iconv_close(__cd: iconv_t) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
  pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
  pub __bindgen_padding_0: u64,
  pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
  // assert_eq!(
  //   ::std::mem::size_of::<max_align_t>(),
  //   32usize,
  //   concat!("Size of: ", stringify!(max_align_t))
  // );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(max_align_t),
      "::",
      stringify!(__clang_max_align_nonce1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(max_align_t),
      "::",
      stringify!(__clang_max_align_nonce2)
    )
  );
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type UBool = i8;
pub type UChar = u16;
pub type OldUChar = ::std::os::raw::c_ushort;
pub type UChar32 = i32;
pub type UVersionInfo = [u8; 4usize];
extern "C" {
  pub fn u_versionFromString_60(
    versionArray: *mut u8,
    versionString: *const ::std::os::raw::c_char,
  );
}
extern "C" {
  pub fn u_versionFromUString_60(versionArray: *mut u8, versionString: *const UChar);
}
extern "C" {
  pub fn u_versionToString_60(versionArray: *mut u8, versionString: *mut ::std::os::raw::c_char);
}
extern "C" {
  pub fn u_getVersion_60(versionArray: *mut u8);
}
extern "C" {
  pub fn utf8_nextCharSafeBody_60(
    s: *const u8,
    pi: *mut i32,
    length: i32,
    c: UChar32,
    strict: UBool,
  ) -> UChar32;
}
extern "C" {
  pub fn utf8_appendCharSafeBody_60(
    s: *mut u8,
    i: i32,
    length: i32,
    c: UChar32,
    pIsError: *mut UBool,
  ) -> i32;
}
extern "C" {
  pub fn utf8_prevCharSafeBody_60(
    s: *const u8,
    start: i32,
    pi: *mut i32,
    c: UChar32,
    strict: UBool,
  ) -> UChar32;
}
extern "C" {
  pub fn utf8_back1SafeBody_60(s: *const u8, start: i32, i: i32) -> i32;
}
extern "C" {
  #[link_name = "\u{1}utf8_countTrailBytes_60"]
  pub static mut utf8_countTrailBytes_60: [u8; 0usize];
}
pub type UDate = f64;
pub const UErrorCode_U_USING_FALLBACK_WARNING: UErrorCode = -128;
pub const UErrorCode_U_ERROR_WARNING_START: UErrorCode = -128;
pub const UErrorCode_U_USING_DEFAULT_WARNING: UErrorCode = -127;
pub const UErrorCode_U_SAFECLONE_ALLOCATED_WARNING: UErrorCode = -126;
pub const UErrorCode_U_STATE_OLD_WARNING: UErrorCode = -125;
pub const UErrorCode_U_STRING_NOT_TERMINATED_WARNING: UErrorCode = -124;
pub const UErrorCode_U_SORT_KEY_TOO_SHORT_WARNING: UErrorCode = -123;
pub const UErrorCode_U_AMBIGUOUS_ALIAS_WARNING: UErrorCode = -122;
pub const UErrorCode_U_DIFFERENT_UCA_VERSION: UErrorCode = -121;
pub const UErrorCode_U_PLUGIN_CHANGED_LEVEL_WARNING: UErrorCode = -120;
pub const UErrorCode_U_ERROR_WARNING_LIMIT: UErrorCode = -119;
pub const UErrorCode_U_ZERO_ERROR: UErrorCode = 0;
pub const UErrorCode_U_ILLEGAL_ARGUMENT_ERROR: UErrorCode = 1;
pub const UErrorCode_U_MISSING_RESOURCE_ERROR: UErrorCode = 2;
pub const UErrorCode_U_INVALID_FORMAT_ERROR: UErrorCode = 3;
pub const UErrorCode_U_FILE_ACCESS_ERROR: UErrorCode = 4;
pub const UErrorCode_U_INTERNAL_PROGRAM_ERROR: UErrorCode = 5;
pub const UErrorCode_U_MESSAGE_PARSE_ERROR: UErrorCode = 6;
pub const UErrorCode_U_MEMORY_ALLOCATION_ERROR: UErrorCode = 7;
pub const UErrorCode_U_INDEX_OUTOFBOUNDS_ERROR: UErrorCode = 8;
pub const UErrorCode_U_PARSE_ERROR: UErrorCode = 9;
pub const UErrorCode_U_INVALID_CHAR_FOUND: UErrorCode = 10;
pub const UErrorCode_U_TRUNCATED_CHAR_FOUND: UErrorCode = 11;
pub const UErrorCode_U_ILLEGAL_CHAR_FOUND: UErrorCode = 12;
pub const UErrorCode_U_INVALID_TABLE_FORMAT: UErrorCode = 13;
pub const UErrorCode_U_INVALID_TABLE_FILE: UErrorCode = 14;
pub const UErrorCode_U_BUFFER_OVERFLOW_ERROR: UErrorCode = 15;
pub const UErrorCode_U_UNSUPPORTED_ERROR: UErrorCode = 16;
pub const UErrorCode_U_RESOURCE_TYPE_MISMATCH: UErrorCode = 17;
pub const UErrorCode_U_ILLEGAL_ESCAPE_SEQUENCE: UErrorCode = 18;
pub const UErrorCode_U_UNSUPPORTED_ESCAPE_SEQUENCE: UErrorCode = 19;
pub const UErrorCode_U_NO_SPACE_AVAILABLE: UErrorCode = 20;
pub const UErrorCode_U_CE_NOT_FOUND_ERROR: UErrorCode = 21;
pub const UErrorCode_U_PRIMARY_TOO_LONG_ERROR: UErrorCode = 22;
pub const UErrorCode_U_STATE_TOO_OLD_ERROR: UErrorCode = 23;
pub const UErrorCode_U_TOO_MANY_ALIASES_ERROR: UErrorCode = 24;
pub const UErrorCode_U_ENUM_OUT_OF_SYNC_ERROR: UErrorCode = 25;
pub const UErrorCode_U_INVARIANT_CONVERSION_ERROR: UErrorCode = 26;
pub const UErrorCode_U_INVALID_STATE_ERROR: UErrorCode = 27;
pub const UErrorCode_U_COLLATOR_VERSION_MISMATCH: UErrorCode = 28;
pub const UErrorCode_U_USELESS_COLLATOR_ERROR: UErrorCode = 29;
pub const UErrorCode_U_NO_WRITE_PERMISSION: UErrorCode = 30;
pub const UErrorCode_U_STANDARD_ERROR_LIMIT: UErrorCode = 31;
pub const UErrorCode_U_BAD_VARIABLE_DEFINITION: UErrorCode = 65536;
pub const UErrorCode_U_PARSE_ERROR_START: UErrorCode = 65536;
pub const UErrorCode_U_MALFORMED_RULE: UErrorCode = 65537;
pub const UErrorCode_U_MALFORMED_SET: UErrorCode = 65538;
pub const UErrorCode_U_MALFORMED_SYMBOL_REFERENCE: UErrorCode = 65539;
pub const UErrorCode_U_MALFORMED_UNICODE_ESCAPE: UErrorCode = 65540;
pub const UErrorCode_U_MALFORMED_VARIABLE_DEFINITION: UErrorCode = 65541;
pub const UErrorCode_U_MALFORMED_VARIABLE_REFERENCE: UErrorCode = 65542;
pub const UErrorCode_U_MISMATCHED_SEGMENT_DELIMITERS: UErrorCode = 65543;
pub const UErrorCode_U_MISPLACED_ANCHOR_START: UErrorCode = 65544;
pub const UErrorCode_U_MISPLACED_CURSOR_OFFSET: UErrorCode = 65545;
pub const UErrorCode_U_MISPLACED_QUANTIFIER: UErrorCode = 65546;
pub const UErrorCode_U_MISSING_OPERATOR: UErrorCode = 65547;
pub const UErrorCode_U_MISSING_SEGMENT_CLOSE: UErrorCode = 65548;
pub const UErrorCode_U_MULTIPLE_ANTE_CONTEXTS: UErrorCode = 65549;
pub const UErrorCode_U_MULTIPLE_CURSORS: UErrorCode = 65550;
pub const UErrorCode_U_MULTIPLE_POST_CONTEXTS: UErrorCode = 65551;
pub const UErrorCode_U_TRAILING_BACKSLASH: UErrorCode = 65552;
pub const UErrorCode_U_UNDEFINED_SEGMENT_REFERENCE: UErrorCode = 65553;
pub const UErrorCode_U_UNDEFINED_VARIABLE: UErrorCode = 65554;
pub const UErrorCode_U_UNQUOTED_SPECIAL: UErrorCode = 65555;
pub const UErrorCode_U_UNTERMINATED_QUOTE: UErrorCode = 65556;
pub const UErrorCode_U_RULE_MASK_ERROR: UErrorCode = 65557;
pub const UErrorCode_U_MISPLACED_COMPOUND_FILTER: UErrorCode = 65558;
pub const UErrorCode_U_MULTIPLE_COMPOUND_FILTERS: UErrorCode = 65559;
pub const UErrorCode_U_INVALID_RBT_SYNTAX: UErrorCode = 65560;
pub const UErrorCode_U_INVALID_PROPERTY_PATTERN: UErrorCode = 65561;
pub const UErrorCode_U_MALFORMED_PRAGMA: UErrorCode = 65562;
pub const UErrorCode_U_UNCLOSED_SEGMENT: UErrorCode = 65563;
pub const UErrorCode_U_ILLEGAL_CHAR_IN_SEGMENT: UErrorCode = 65564;
pub const UErrorCode_U_VARIABLE_RANGE_EXHAUSTED: UErrorCode = 65565;
pub const UErrorCode_U_VARIABLE_RANGE_OVERLAP: UErrorCode = 65566;
pub const UErrorCode_U_ILLEGAL_CHARACTER: UErrorCode = 65567;
pub const UErrorCode_U_INTERNAL_TRANSLITERATOR_ERROR: UErrorCode = 65568;
pub const UErrorCode_U_INVALID_ID: UErrorCode = 65569;
pub const UErrorCode_U_INVALID_FUNCTION: UErrorCode = 65570;
pub const UErrorCode_U_PARSE_ERROR_LIMIT: UErrorCode = 65571;
pub const UErrorCode_U_UNEXPECTED_TOKEN: UErrorCode = 65792;
pub const UErrorCode_U_FMT_PARSE_ERROR_START: UErrorCode = 65792;
pub const UErrorCode_U_MULTIPLE_DECIMAL_SEPARATORS: UErrorCode = 65793;
pub const UErrorCode_U_MULTIPLE_DECIMAL_SEPERATORS: UErrorCode = 65793;
pub const UErrorCode_U_MULTIPLE_EXPONENTIAL_SYMBOLS: UErrorCode = 65794;
pub const UErrorCode_U_MALFORMED_EXPONENTIAL_PATTERN: UErrorCode = 65795;
pub const UErrorCode_U_MULTIPLE_PERCENT_SYMBOLS: UErrorCode = 65796;
pub const UErrorCode_U_MULTIPLE_PERMILL_SYMBOLS: UErrorCode = 65797;
pub const UErrorCode_U_MULTIPLE_PAD_SPECIFIERS: UErrorCode = 65798;
pub const UErrorCode_U_PATTERN_SYNTAX_ERROR: UErrorCode = 65799;
pub const UErrorCode_U_ILLEGAL_PAD_POSITION: UErrorCode = 65800;
pub const UErrorCode_U_UNMATCHED_BRACES: UErrorCode = 65801;
pub const UErrorCode_U_UNSUPPORTED_PROPERTY: UErrorCode = 65802;
pub const UErrorCode_U_UNSUPPORTED_ATTRIBUTE: UErrorCode = 65803;
pub const UErrorCode_U_ARGUMENT_TYPE_MISMATCH: UErrorCode = 65804;
pub const UErrorCode_U_DUPLICATE_KEYWORD: UErrorCode = 65805;
pub const UErrorCode_U_UNDEFINED_KEYWORD: UErrorCode = 65806;
pub const UErrorCode_U_DEFAULT_KEYWORD_MISSING: UErrorCode = 65807;
pub const UErrorCode_U_DECIMAL_NUMBER_SYNTAX_ERROR: UErrorCode = 65808;
pub const UErrorCode_U_FORMAT_INEXACT_ERROR: UErrorCode = 65809;
pub const UErrorCode_U_FMT_PARSE_ERROR_LIMIT: UErrorCode = 65810;
pub const UErrorCode_U_BRK_INTERNAL_ERROR: UErrorCode = 66048;
pub const UErrorCode_U_BRK_ERROR_START: UErrorCode = 66048;
pub const UErrorCode_U_BRK_HEX_DIGITS_EXPECTED: UErrorCode = 66049;
pub const UErrorCode_U_BRK_SEMICOLON_EXPECTED: UErrorCode = 66050;
pub const UErrorCode_U_BRK_RULE_SYNTAX: UErrorCode = 66051;
pub const UErrorCode_U_BRK_UNCLOSED_SET: UErrorCode = 66052;
pub const UErrorCode_U_BRK_ASSIGN_ERROR: UErrorCode = 66053;
pub const UErrorCode_U_BRK_VARIABLE_REDFINITION: UErrorCode = 66054;
pub const UErrorCode_U_BRK_MISMATCHED_PAREN: UErrorCode = 66055;
pub const UErrorCode_U_BRK_NEW_LINE_IN_QUOTED_STRING: UErrorCode = 66056;
pub const UErrorCode_U_BRK_UNDEFINED_VARIABLE: UErrorCode = 66057;
pub const UErrorCode_U_BRK_INIT_ERROR: UErrorCode = 66058;
pub const UErrorCode_U_BRK_RULE_EMPTY_SET: UErrorCode = 66059;
pub const UErrorCode_U_BRK_UNRECOGNIZED_OPTION: UErrorCode = 66060;
pub const UErrorCode_U_BRK_MALFORMED_RULE_TAG: UErrorCode = 66061;
pub const UErrorCode_U_BRK_ERROR_LIMIT: UErrorCode = 66062;
pub const UErrorCode_U_REGEX_INTERNAL_ERROR: UErrorCode = 66304;
pub const UErrorCode_U_REGEX_ERROR_START: UErrorCode = 66304;
pub const UErrorCode_U_REGEX_RULE_SYNTAX: UErrorCode = 66305;
pub const UErrorCode_U_REGEX_INVALID_STATE: UErrorCode = 66306;
pub const UErrorCode_U_REGEX_BAD_ESCAPE_SEQUENCE: UErrorCode = 66307;
pub const UErrorCode_U_REGEX_PROPERTY_SYNTAX: UErrorCode = 66308;
pub const UErrorCode_U_REGEX_UNIMPLEMENTED: UErrorCode = 66309;
pub const UErrorCode_U_REGEX_MISMATCHED_PAREN: UErrorCode = 66310;
pub const UErrorCode_U_REGEX_NUMBER_TOO_BIG: UErrorCode = 66311;
pub const UErrorCode_U_REGEX_BAD_INTERVAL: UErrorCode = 66312;
pub const UErrorCode_U_REGEX_MAX_LT_MIN: UErrorCode = 66313;
pub const UErrorCode_U_REGEX_INVALID_BACK_REF: UErrorCode = 66314;
pub const UErrorCode_U_REGEX_INVALID_FLAG: UErrorCode = 66315;
pub const UErrorCode_U_REGEX_LOOK_BEHIND_LIMIT: UErrorCode = 66316;
pub const UErrorCode_U_REGEX_SET_CONTAINS_STRING: UErrorCode = 66317;
pub const UErrorCode_U_REGEX_OCTAL_TOO_BIG: UErrorCode = 66318;
pub const UErrorCode_U_REGEX_MISSING_CLOSE_BRACKET: UErrorCode = 66319;
pub const UErrorCode_U_REGEX_INVALID_RANGE: UErrorCode = 66320;
pub const UErrorCode_U_REGEX_STACK_OVERFLOW: UErrorCode = 66321;
pub const UErrorCode_U_REGEX_TIME_OUT: UErrorCode = 66322;
pub const UErrorCode_U_REGEX_STOPPED_BY_CALLER: UErrorCode = 66323;
pub const UErrorCode_U_REGEX_PATTERN_TOO_BIG: UErrorCode = 66324;
pub const UErrorCode_U_REGEX_INVALID_CAPTURE_GROUP_NAME: UErrorCode = 66325;
pub const UErrorCode_U_REGEX_ERROR_LIMIT: UErrorCode = 66326;
pub const UErrorCode_U_IDNA_PROHIBITED_ERROR: UErrorCode = 66560;
pub const UErrorCode_U_IDNA_ERROR_START: UErrorCode = 66560;
pub const UErrorCode_U_IDNA_UNASSIGNED_ERROR: UErrorCode = 66561;
pub const UErrorCode_U_IDNA_CHECK_BIDI_ERROR: UErrorCode = 66562;
pub const UErrorCode_U_IDNA_STD3_ASCII_RULES_ERROR: UErrorCode = 66563;
pub const UErrorCode_U_IDNA_ACE_PREFIX_ERROR: UErrorCode = 66564;
pub const UErrorCode_U_IDNA_VERIFICATION_ERROR: UErrorCode = 66565;
pub const UErrorCode_U_IDNA_LABEL_TOO_LONG_ERROR: UErrorCode = 66566;
pub const UErrorCode_U_IDNA_ZERO_LENGTH_LABEL_ERROR: UErrorCode = 66567;
pub const UErrorCode_U_IDNA_DOMAIN_NAME_TOO_LONG_ERROR: UErrorCode = 66568;
pub const UErrorCode_U_IDNA_ERROR_LIMIT: UErrorCode = 66569;
pub const UErrorCode_U_STRINGPREP_PROHIBITED_ERROR: UErrorCode = 66560;
pub const UErrorCode_U_STRINGPREP_UNASSIGNED_ERROR: UErrorCode = 66561;
pub const UErrorCode_U_STRINGPREP_CHECK_BIDI_ERROR: UErrorCode = 66562;
pub const UErrorCode_U_PLUGIN_ERROR_START: UErrorCode = 66816;
pub const UErrorCode_U_PLUGIN_TOO_HIGH: UErrorCode = 66816;
pub const UErrorCode_U_PLUGIN_DIDNT_SET_LEVEL: UErrorCode = 66817;
pub const UErrorCode_U_PLUGIN_ERROR_LIMIT: UErrorCode = 66818;
pub const UErrorCode_U_ERROR_LIMIT: UErrorCode = 66818;
pub type UErrorCode = i32;
extern "C" {
  pub fn u_errorName_60(code: UErrorCode) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UConverter {
  _unused: [u8; 0],
}
pub const UConverterCallbackReason_UCNV_UNASSIGNED: UConverterCallbackReason = 0;
pub const UConverterCallbackReason_UCNV_ILLEGAL: UConverterCallbackReason = 1;
pub const UConverterCallbackReason_UCNV_IRREGULAR: UConverterCallbackReason = 2;
pub const UConverterCallbackReason_UCNV_RESET: UConverterCallbackReason = 3;
pub const UConverterCallbackReason_UCNV_CLOSE: UConverterCallbackReason = 4;
pub const UConverterCallbackReason_UCNV_CLONE: UConverterCallbackReason = 5;
pub type UConverterCallbackReason = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UConverterFromUnicodeArgs {
  pub size: u16,
  pub flush: UBool,
  pub converter: *mut UConverter,
  pub source: *const UChar,
  pub sourceLimit: *const UChar,
  pub target: *mut ::std::os::raw::c_char,
  pub targetLimit: *const ::std::os::raw::c_char,
  pub offsets: *mut i32,
}
#[test]
fn bindgen_test_layout_UConverterFromUnicodeArgs() {
  assert_eq!(
    ::std::mem::size_of::<UConverterFromUnicodeArgs>(),
    56usize,
    concat!("Size of: ", stringify!(UConverterFromUnicodeArgs))
  );
  assert_eq!(
    ::std::mem::align_of::<UConverterFromUnicodeArgs>(),
    8usize,
    concat!("Alignment of ", stringify!(UConverterFromUnicodeArgs))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<UConverterFromUnicodeArgs>())).size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(UConverterFromUnicodeArgs),
      "::",
      stringify!(size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<UConverterFromUnicodeArgs>())).flush as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(UConverterFromUnicodeArgs),
      "::",
      stringify!(flush)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<UConverterFromUnicodeArgs>())).converter as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(UConverterFromUnicodeArgs),
      "::",
      stringify!(converter)
    )
  );
  assert_eq!(
